{
    "title": "Barbacoa Tacos",
    "Category": "Tacos",
    "Ingredients": [
        {
            "1": "1 small white onion, quartered"
        },
        {
            "2": "2  ripe plum tomatoes"
        },
        {
            "3": "2 cloves garlic"
        },
        {
            "4": "4  chipotle peppers in adobo sauce"
        },
        {
            "5": "3 teaspoons kosher salt"
        },
        {
            "6": "0.5 teaspoons chili powder"
        },
        {
            "7": "1 teaspoon ground cumin"
        },
        {
            "8": "0.5 teaspoon freshly ground black pepper"
        },
        {
            "9": "1 (3 pound) beef chuck roast"
        },
        {
            "10": "2 tablespoons olive oil"
        },
        {
            "11": "1 cup water"
        },
        {
            "12": "3  fresh bay leaves"
        },
        {
            "13": "2 teaspoons dried oregano"
        },
        {
            "14": "1 tablespoon light brown sugar"
        },
        {
            "15": "1 tablespoon lime juice"
        },
        {
            "16": "1 corn tortillas, warmed"
        },
        {
            "17": "2 tablespoons chopped fresh cilantro, or to taste"
        },
        {
            "18": "0.5 bunch radishes, thinly sliced"
        },
        {
            "19": "2  ripe avocados, peeled, pitted and sliced"
        }
    ],
    "Directions": [
        {
            "1": "Heat a large cast iron skillet over medium-high. Arrange onion wedges (cut side down), tomatoes, and garlic in the dry skillet in a single layer, working in batches if needed. Cook, turning occasionally, until charred on all sides, about 6 minutes for the garlic and about 12 minutes for the onions and tomatoes."
        },
        {
            "2": "Transfer charred vegetables to a blender and add chipotle peppers. Process until smooth, about 1 minute."
        },
        {
            "3": "Stir together salt, chili powder, cumin, and black pepper in a small bowl. Cut beef into 6 equal-sized cubes and season evenly with salt mixture."
        },
        {
            "4": "Heat oil in a Dutch oven over medium-high heat. Add beef in batches and cook, turning occasionally, until browned on all sides, about 3 minutes per side. Transfer browned beef to a large plate."
        },
        {
            "5": "Pour water into the Dutch oven and scrape up any browned bits from the bottom of the pan. Add onion-tomato mixture, bay leaves, oregano, and brown sugar and stir to combine. Reduce heat to medium-low and bring to a simmer."
        },
        {
            "6": "Nestle beef back into pot and cover. Cook, stirring and re-nestling beef occasionally (about every 20 to 30 minutes), until beef is tender and pulls easily apart with a fork, 1 hour and 45 minutes to 2 hours and 15 minutes. Remove bay leaves and discard."
        },
        {
            "7": "Remove beef from Dutch oven, place on cutting board; shred beef using 2 forks. Return beef to the Dutch oven, add lime juice, and stir to combine. Serve in corn tortillas with cilantro, radishes, and avocado."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 2 hrs"
        },
        {
            "Total Time": " 2 hrs 45 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "771"
        },
        {
            "Fat": "56g"
        },
        {
            "Carbs": "25g"
        },
        {
            "Protein": "43g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}