{
    "title": "Famous California Pizza Dough",
    "Category": "Pizza Dough and Crusts",
    "Ingredients": [
        {
            "1": "1 (.25 ounce) package active dry yeast"
        },
        {
            "2": "1 teaspoon honey"
        },
        {
            "3": "1 cup Water, municipal"
        },
        {
            "4": "1 teaspoon kosher salt"
        },
        {
            "5": "5 tablespoons extra-virgin olive oil, divided"
        },
        {
            "6": "1.5 cups all-purpose flour, or more as needed"
        },
        {
            "7": "0.25 cup cornmeal, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine yeast, honey, and 1/4 cup warm water in a large bowl with a whisk. Let stand to dissolve, about 10 minutes."
        },
        {
            "2": "Add salt, 1 tablespoon olive oil, remaining 3/4 cup warm water, and 1 cup flour to the mixture and stir until a batter forms. Add another 1 cup flour; stir to combine. Add 1/2 cup more flour and combine."
        },
        {
            "3": "Turn dough out onto a surface dusted with 1/4 cup flour. Knead until a smooth, fairly firm, slightly sticky dough is achieved, adding more flour as needed."
        },
        {
            "4": "Transfer dough to a lightly oiled bowl and cover with a damp towel. Let sit in a warm place until doubled in size, 30 to 40 minutes."
        },
        {
            "5": "Turn dough out onto a lightly floured cutting board and pat down with your hand. Divide dough into 4 equal pieces. Stretch and fold each piece down and under, tucking as you go, to form pizza dough rounds."
        },
        {
            "6": "Cover with a towel and let sit in a warm place until doubled in size, 20 to 30 minutes."
        },
        {
            "7": "Preheat the oven to 450 degrees F (230 degrees C). Dust a baking sheet with cornmeal."
        },
        {
            "8": "Transfer dough rounds to a lightly floured board and press each piece out to desired thickness, starting in the center, until 8 to 10 inches wide. Form a crust shape around the outer edges with your fingertips."
        },
        {
            "9": "Transfer one round of pizza dough to the prepared baking sheet and brush with 1 tablespoon olive oil. Top with any sauce and toppings you like."
        },
        {
            "10": "Bake in the lower rack of the preheated oven for 5 minutes. Move to the center of the oven and continue to bake until golden, about 10 minutes more. Repeat to bake remaining pizzas."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 35 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "4 8-inch pizza dough rounds"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "127"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F186e5a66062ce1b9fdcd57e4fdb1020d%2F1663596693IMG_3589.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9383025.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pizza"
}