{
    "title": "Premium Pizza Crust",
    "Category": "Pizza Dough and Crusts",
    "Ingredients": [
        {
            "1": "0.5 teaspoons active dry yeast"
        },
        {
            "2": "0.5 cups water"
        },
        {
            "3": "3 cups all-purpose flour"
        },
        {
            "4": "1 teaspoon sea salt"
        }
    ],
    "Directions": [
        {
            "1": "OVERNIGHT COLD RISE METHOD: In a large bowl, dissolve yeast in water. Stir in 2 cups of flour and salt; mix well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 15 minutes. Place dough in bowl dusted with flour cover with plastic wrap and refrigerate overnight."
        },
        {
            "2": "SPONGE RISE METHOD: In a large bowl, dissolve yeast in 1/2 cup water. Stir in 1/2 cup of flour; mix well. Cover bowl with plastic wrap and let rise until foamy, about 1 hour. Blend in remaining water, flour and salt; beat well. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 15 minutes. Place dough in bowl dusted with flour and cover with plastic wrap. Let rise until doubled, about 2 to 3 hours."
        },
        {
            "3": "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces. Roll dough out to half of its final size. Let rest for 10 to 15 minutes (while you prepare desired pizza toppings). Preheat oven to 450 degrees F (230 degrees C)."
        },
        {
            "4": "Stretch out dough over your floured knuckles and spin/toss 2 to 3 times until desired size is achieved. Place dough on a baker's peel sprinkled with cornmeal or a lightly greased pizza pan. Spread with desired toppings and bake on a pizza stone in preheated oven for 8 to 10 minutes, or until golden brown. Let baked pizza cool for 5 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 14 hrs 20 mins"
        },
        {
            "Total Time": " 15 hrs"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "2 to 12 - inch crusts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "173"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "36g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fa1d2eb32823078a80641e137883b2a04%2F16574221148C56BDC0-E2EA-43DE-95F5-299367FE3B3E.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8214877.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8125649.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7976366.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pizza"
}