{
    "title": "Best Stuffed Cabbage Rolls",
    "Category": "Cabbage Rolls",
    "Ingredients": [
        {
            "1": "6 teaspoons kosher salt, divided"
        },
        {
            "2": "1 large head cabbage"
        },
        {
            "3": "2 teaspoons oil"
        },
        {
            "4": "0.5 cup minced onion"
        },
        {
            "5": "1 (14 ounce) can tomato sauce"
        },
        {
            "6": "1 (14 ounce) can petite diced tomatoes, undrained"
        },
        {
            "7": "0.75 cup water"
        },
        {
            "8": "1 tablespoon red wine vinegar"
        },
        {
            "9": "1 teaspoon ground black pepper, divided"
        },
        {
            "10": "1 pound ground sirloin"
        },
        {
            "11": "1 cup uncooked white rice"
        },
        {
            "12": "2 cloves garlic, minced"
        },
        {
            "13": "0.5 teaspoon ground allspice"
        },
        {
            "14": "1 medium lemon, cut into 6 wedges"
        },
        {
            "15": "2 teaspoons chopped fresh parsley, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Bring a large pot of water to a boil. Stir in 4 teaspoons salt. Remove loose, outer leaves from the cabbage and place in the boiling water for 1 minute. Remove from the water and set aside."
        },
        {
            "2": "Remove core from the cabbage and carefully place the head in the boiling water. Cook for 5 minutes, removing the outer leaves one at a time as they loosen every minute. Set aside 12 large leaves and reserve inner portion of the cabbage for another use."
        },
        {
            "3": "Heat oil in a medium saucepan over medium heat. Set aside 2 tablespoons minced onion for cabbage rolls; add remaining onion to the hot oil. Cook, stirring often, until translucent, about 2 minutes. Stir in tomato sauce, undrained diced tomatoes, water, vinegar, 1/2 teaspoon pepper, and 1/2 teaspoon salt; bring to a simmer. Reduce heat to low and cook for 10 minutes."
        },
        {
            "4": "Meanwhile, preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "5": "Prepare cabbage rolls: Mix sirloin, rice, garlic, reserved minced onion, remaining 1 1/2 teaspoons salt, remaining pepper, and allspice together in a bowl until well combined."
        },
        {
            "6": "Place a softened cabbage leaf on a cutting board and remove the bottom, tough portion of the stem. Place about 3 tablespoons meat filling into the center of the leaf. Fold the sides inward and roll the leaf up tightly, like a burrito or spring roll. Repeat with remaining leaves and filling."
        },
        {
            "7": "Pour 1 cup tomato sauce mixture in a bottom of a 9x13-inch or 11x7-inch baking dish. Place cabbage rolls, seam-side down, in the baking dish and pour remaining sauce on top. Cover tightly with foil."
        },
        {
            "8": "Bake in preheated oven for 1 hour. Lightly squeeze a wedge of lemon over each serving and garnish with parsley."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs 30 mins"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "12 cabbage rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "390"
        },
        {
            "Fat": "13g"
        },
        {
            "Carbs": "46g"
        },
        {
            "Protein": "23g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9188635.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}