{
    "title": "Italian Sausage-Stuffed Cabbage Rolls",
    "Category": "Cabbage Rolls",
    "Ingredients": [
        {
            "1": "1 tablespoon olive oil"
        },
        {
            "2": "1 medium head cabbage"
        },
        {
            "3": "1 (19 ounce) package mild Italian sausage (such as Johnsonville®)"
        },
        {
            "4": "2 cups marinara sauce"
        },
        {
            "5": "1 (8 ounce) can tomato sauce"
        },
        {
            "6": "2 cups cooked rice"
        },
        {
            "7": "2 teaspoons dried basil, or more to taste"
        },
        {
            "8": "2 teaspoons dried oregano, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Put olive oil on the bottom of a medium-sized baking dish. Remove casings from sausage."
        },
        {
            "2": "Bring a large pot of water to a boil. Cook cabbage leaves until tender, about 12 minutes. Drain."
        },
        {
            "3": "While the cabbage is cooking, remove casings from sausage. Cook and stir sausage in a skillet over medium-high heat, breaking it into pieces as it cooks, until browned and crumbly, 5 to 7 minutes. Drain and discard grease."
        },
        {
            "4": "At the same time, combine marinara sauce and tomato sauce in a saucepan over medium-low heat. Cook until warm, about 3 minutes; set aside."
        },
        {
            "5": "Mix cooked rice, sausage, and 1/2 cup sauce with basil and oregano. Spread filling onto cabbage leaves and roll up like small burritos. The amount of filling in each will vary depending on how big your cabbage leaves are. Place cabbage rolls close together in the prepared dish and spoon remaining sauce over top."
        },
        {
            "6": "Bake in the preheated oven until cooked through, about 30 minutes. Garnish with more basil and oregano."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "423"
        },
        {
            "Fat": "22g"
        },
        {
            "Carbs": "40g"
        },
        {
            "Protein": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F998965.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}