{
    "title": "Stuffed Red Cabbage Rolls",
    "Category": "Cabbage Rolls",
    "Ingredients": [
        {
            "1": "1 tablespoon olive oil"
        },
        {
            "2": "1 medium onion, diced"
        },
        {
            "3": "1 pound ground beef"
        },
        {
            "4": "2 tablespoons minced garlic, divided"
        },
        {
            "5": "1 teaspoon salt"
        },
        {
            "6": "1 teaspoon ground black pepper"
        },
        {
            "7": "5 cups water"
        },
        {
            "8": "1.0 cups uncooked brown and wild rice blend"
        },
        {
            "9": "12 leaves red cabbage, or as needed"
        },
        {
            "10": "1 (10.5 ounce) can condensed cream of mushroom soup"
        },
        {
            "11": "1 (8 ounce) can sauerkraut, drained"
        }
    ],
    "Directions": [
        {
            "1": "Heat oil in a skillet over medium heat; stir in onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Add ground beef, 1/2 of the garlic, salt, and pepper; cook and stir until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Set aside to rest."
        },
        {
            "2": "At the same time, combine water and remaining minced garlic in a large pot; bring to a boil. Add rice and cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes."
        },
        {
            "3": "While rice is cooking, bring a separate pot of water to a boil. Blanch cabbage leaves in the boiling water until tender and pliable, 1 to 2 minutes. Shock leaves in cold water to prevent further cooking, and set aside to cool."
        },
        {
            "4": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet."
        },
        {
            "5": "Add condensed soup to cooked rice. Mix in hamburger mixture."
        },
        {
            "6": "Fill cabbage leaves with rice and hamburger mixture, wrapping around the filling to secure. Place each cabbage roll seam-side down on the prepared baking sheet and top with sauerkraut."
        },
        {
            "7": "Bake in the preheated oven until cabbage leaves are slightly wilted, 30 to 40 minutes. Remove from the oven and let rest for 5 to 10 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "12 stuffed cabbage rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "494"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "61g"
        },
        {
            "Protein": "25g"
        }
    ],
    "Images": [],
    "main category": "meat_&_chicken"
}