{
    "title": "Simple Deep Fried Turkey",
    "Category": "Quick and Easy Recipes",
    "Ingredients": [
        {
            "1": "1.5 gallons peanut oil for frying"
        },
        {
            "2": "1 (10 pound) whole turkey, neck and giblets removed"
        },
        {
            "3": "1 tablespoon salt, or to taste"
        },
        {
            "4": "1 tablespoon ground black pepper, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Heat oil in a large stockpot or turkey fryer to 350 degrees F (175 degrees C). Make sure the fryer is located outdoors in a safe area, preferably on dirt or pavement, and far away from buildings, wooden decks, or other objects. Keep a fire extinguisher handy, just in case."
        },
        {
            "2": "Ensure that the turkey is completely thawed. Cut any extra skin away from the neck area and make sure neck hole is at least 1 inch in diameter. Pat the bird completely dry with paper towels, then rub liberally with salt and pepper on both the outside and the inside. Place turkey into a drain basket, neck-side first."
        },
        {
            "3": "Working slowly and carefully, gently lower the basket into the hot oil to completely cover the turkey. Maintain the temperature of the oil at 350 degrees F (175 degrees C), and cook turkey for 3 1/2 minutes per pound, about 35 minutes."
        },
        {
            "4": "Carefully remove basket from oil, and drain turkey. Insert a meat thermometer into the thickest part of the thigh; the internal temperature must be 180 degrees F (80 degrees C). Allow to rest for 15 minutes before slicing."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "12 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "568"
        },
        {
            "Fat": "27g"
        },
        {
            "Carbs": "0g"
        },
        {
            "Protein": "77g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F925836.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "easy_recipies_&_leftovers"
}