{
    "title": "Gluten-Free Berry Rhubarb Pie",
    "Category": "Rhubarb Pie",
    "Ingredients": [
        {
            "1": "1 Gluten-Free Pie Crust-"
        },
        {
            "2": "3 cups gluten-free all-purpose baking flour (such as Cup4Cup™)"
        },
        {
            "3": "1 tablespoon white sugar"
        },
        {
            "4": "1 teaspoon fine salt"
        },
        {
            "5": "1 cup cold unsalted butter, cut into cubes"
        },
        {
            "6": "0.75 cup ice cold water"
        },
        {
            "7": "1 Filling-"
        },
        {
            "8": "4 cups hulled and halved strawberries"
        },
        {
            "9": "4 cups fresh blueberries"
        },
        {
            "10": "4 cups thinly sliced rhubarb"
        },
        {
            "11": "1  lemon, zested"
        },
        {
            "12": "1 teaspoon vanilla extract"
        },
        {
            "13": "1 cup white sugar"
        },
        {
            "14": "0.25 cup gluten-free cornstarch"
        },
        {
            "15": "0.25 teaspoon salt"
        },
        {
            "16": "1  egg"
        },
        {
            "17": "0.25 cup water"
        },
        {
            "18": "1 tablespoon raw sugar, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Whisk flour, sugar, and salt together in a bowl. Toss butter in the flour mixture until coated. Transfer mixture to a food processor and pulse in short bursts until butter is the size of hazelnuts. Drizzle ice water through the feed tube, pulsing in quick 4-second bursts until dough comes together in a ball."
        },
        {
            "2": "Divide dough into 2 equal balls. Flatten into disks and wrap each disk in parchment paper and plastic wrap. Refrigerate disks until firm, about 1 hour."
        },
        {
            "3": "Preheat the oven to 425 degrees F (220 degrees C)."
        },
        {
            "4": "Roll out 1 disk into an 11-inch circle. Transfer it to a 9-inch pie plate. Trim the overhang to 1 inch."
        },
        {
            "5": "Bake in the preheated oven until golden, 15 to 20 minutes. Let crust cool while you make the filling. Keep oven on."
        },
        {
            "6": "Toss strawberries, blueberries, rhubarb, lemon zest, and vanilla extract in a large bowl. Mix sugar, cornstarch, and salt in a separate bowl. Toss fruit mixture in the sugar mixture just before pouring over the crust."
        },
        {
            "7": "Beat egg and water together in a small bowl to make egg wash. Brush the rim of the bottom crust with the egg wash."
        },
        {
            "8": "Roll out second disk into an 11-inch circle. Carefully position over the filled pie. Trim the edges and tuck the top crust over the rim of the bottom crust to form a tight seal. Crimp the edge decoratively. Cut an X-shape into the top crust. Brush the top with egg wash and sprinkle with raw sugar."
        },
        {
            "9": "Place pie on a baking sheet and bake for 20 minutes, turning halfway through. Reduce temperature to 350 degrees F (175 degrees C). Continue baking until crust is golden and the juices have thickened and start bubbling out through the X on the top, 35 to 40 minutes."
        },
        {
            "10": "Place pie on a rack to cool completely, at least 1 hour."
        }
    ],
    "Details": [
        {
            "Prep Time": "35 mins"
        },
        {
            "Cook Time": " 1 hrs 10 mins"
        },
        {
            "Additional Time": " 2 hrs"
        },
        {
            "Total Time": " 3 hrs 45 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 double-crust pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "585"
        },
        {
            "Fat": "26g"
        },
        {
            "Carbs": "88g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [],
    "main category": "pies"
}