{
    "title": "Strawberry Raisin Rhubarb Pie",
    "Category": "Rhubarb Pie",
    "Ingredients": [
        {
            "1": "1 recipe pastry for a 9 inch double crust pie"
        },
        {
            "2": "2 cups fresh strawberries, halved lengthwise"
        },
        {
            "3": "4 cups rhubarb, stalks only, sliced 1/2 inch thick"
        },
        {
            "4": "0.5 cup raisins, or to taste"
        },
        {
            "5": "6 tablespoons all-purpose flour"
        },
        {
            "6": "0.25 cups white sugar"
        },
        {
            "7": "0.25 teaspoon ground ginger"
        },
        {
            "8": "1  egg white, beaten"
        },
        {
            "9": "0.5 tablespoons unsalted butter, diced"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oven to 425 degrees F (220 degrees C). Line a 9-inch pie dish with a pastry crust."
        },
        {
            "2": "Mix together the strawberries, rhubarb, raisins, flour, sugar, and ginger in a bowl; allow the mixture to stand for 15 minutes. Meanwhile, roll the remaining crust out into a 10-inch circle on a floured work surface. Brush the bottom crust with egg white, and pour in the filling. Dot the filling evenly with butter."
        },
        {
            "3": "Cut the remaining crust into 3/4-inch wide strips (use a scalloped edge pastry cutter for a prettier crust). Moisten the rim of the filled bottom crust with a bit of water, and lay the two longest strips in a cross in the middle of the pie. Working from the next longest down to the shortest strips, alternate horizontal and vertical strips, weaving the strips as you go. Press the lattice strips down onto the bottom crust edge to seal, and trim the top crust strips neatly. Place the pie into a rimmed baking sheet."
        },
        {
            "4": "Bake in the preheated oven for 20 minutes; lower oven heat to 400 degrees F (205 degrees C), and bake until golden brown, about 20 more minutes. Line the crust edges with aluminum foil if they brown too quickly."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 9-inch pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "447"
        },
        {
            "Fat": "17g"
        },
        {
            "Carbs": "70g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1042187.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pies"
}