{
    "title": "Air Fryer Mini Breakfast Burritos",
    "Category": "Breakfast Burritos",
    "Ingredients": [
        {
            "1": "0.25 cup Mexican-style chorizo"
        },
        {
            "2": "1 tablespoon bacon grease"
        },
        {
            "3": "0.5 cup diced potatoes"
        },
        {
            "4": "2 tablespoons chopped onion"
        },
        {
            "5": "1  serrano pepper, chopped"
        },
        {
            "6": "2 large eggs"
        },
        {
            "7": "1 salt and ground black pepper to taste"
        },
        {
            "8": "4 (8 inch) flour tortillas"
        },
        {
            "9": "1 avocado oil cooking spray"
        }
    ],
    "Directions": [
        {
            "1": "Cook chorizo in a large skillet over medium-high heat, stirring frequently, until sausage turns a dark red, 6 to 8 minutes. Remove from the skillet and set aside."
        },
        {
            "2": "Melt bacon grease in the same skillet over medium-high heat. Add diced potatoes and cook, stirring occasionally, 8 to 10 minutes. Add onion and serrano pepper and continue cooking and stirring until potatoes are fork-tender, onion is translucent, and serrano pepper is soft, 2 to 6 minutes. Add eggs and chorizo; stir until cooked and completely incorporated into potato mixture, about 5 minutes. Season with salt and pepper."
        },
        {
            "3": "Meanwhile, heat tortillas in a large skillet or directly on the grates of a gas stove until soft and pliable. Place 1/3 cup chorizo mixture down the center of each tortilla. Fold top and bottom of tortillas over the filling, then roll each into a burrito shape. Mist with cooking spray and place in the basket of an air fryer."
        },
        {
            "4": "Air fry at 400 degrees F (200 degrees C) for 4 to 6 minutes. Flip each burrito over, mist with cooking spray, and air fry until lightly browned, 2 to 4 minutes more."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "254"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "31g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8937987.jpg"
        }
    ],
    "main category": "breakfast"
}