{
    "title": "Cassava Flour Tortillas",
    "Category": "Tortillas",
    "Ingredients": [
        {
            "1": "0.5 cup lukewarm water"
        },
        {
            "2": "0.25 teaspoon salt"
        },
        {
            "3": "1 cup cassava flour"
        },
        {
            "4": "1.0 tablespoons vegetable oil"
        }
    ],
    "Directions": [
        {
            "1": "Prepare a tortilla press with 2 pieces of parchment paper. Set aside."
        },
        {
            "2": "Pour warm water into a bowl and stir in salt until it dissolves."
        },
        {
            "3": "Combine flour, salt water, and oil in a bowl and mix with your hands until a smooth dough forms. Move dough to a smooth surface and lightly knead until dough feels compact and does not crumble. Separate into 4 equal pieces and roll them into balls."
        },
        {
            "4": "Heat a griddle over medium-high heat. Press one dough ball between 2 pieces of parchment paper in the tortilla press. Press down. Open press and carefully peel off the top piece of parchment paper. Flip tortilla onto your hand and carefully peel off the 2nd piece of paper. Return paper back onto tortilla press. Immediately cook the pressed tortilla on the hot griddle. Cook until bubbles form, flip over, and cook on the other side until browned. Do not flip the tortilla before bubbles form or the tortilla will break. Repeat with remaining dough balls."
        },
        {
            "5": "Serve immediately or cover with a cloth and reheat in the microwave for 30 seconds at 600W."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Total Time": "30 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "221"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6439252.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6477169.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}