{
    "title": "Chef John's Corn Tortillas",
    "Category": "Tortillas",
    "Ingredients": [
        {
            "1": "1 For About 10 Corn Tortillas-"
        },
        {
            "2": "1 cup masa harina, or as needed"
        },
        {
            "3": "0.5 teaspoon kosher salt"
        },
        {
            "4": "0.75 cup hot tap water, about 130 degrees F (55 degrees C)"
        }
    ],
    "Directions": [
        {
            "1": "Add masa harina to a large bowl. Sprinkle in salt and add hot tap water. Stir mixture with your fingers until dough starts to pull together."
        },
        {
            "2": "Knead for a few minutes to smooth it out until texture resembles modeling clay or putty. Add more water if dough is too dry and more flour if too wet."
        },
        {
            "3": "Place a damp towel and over the dough to keep it from drying out. Let rest for 20 to 30 minutes."
        },
        {
            "4": "Cut a zip-top bag into 2 rounds the same size as your tortilla press. Place 1 round on the bottom of the press."
        },
        {
            "5": "Place a clean kitchen towel over a pie dish for holding the cooked tortillas later."
        },
        {
            "6": "Pull off a little piece of the dough, enough to roll into a 1 1/2-inch or 1-ounce ball. Remove the top round of plastic, place dough ball in the center of the bottom round, and press down lightly. Cover dough with the top piece of plastic."
        },
        {
            "7": "Fold the tortilla press over, apply pressure to the lever arm until tortilla flattens to your desired thinness."
        },
        {
            "8": "Peel off the top piece of plastic. Line up the index finger of your dominant hand with the edge of the tortilla; flip it over into your other hand. Carefully peel off the plastic."
        },
        {
            "9": "Gently slide tortilla, palm-up, into a hot, dry pan over medium- to medium-high heat. Cook first side for 30 to 45 seconds. Turn over and cook second side for 1 minute. Flip and press once or twice with a spatula until tortilla puffs up slightly. Cook for 30 seconds more. Flip one last time and cook for 5 to 10 seconds."
        },
        {
            "10": "Quickly transfer tortilla to the pie dish and fold the towel over to wrap it up. Repeat pressing and cooking the rest of the tortilla dough, stacking and wrapping as you go."
        },
        {
            "11": "Leave the stack of tortillas wrapped until soft and supple, at least 15 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": "35 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 tortillas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "42"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "9g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9261457.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8688787.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8546175.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8475527.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/56v4HeUb4KxXixC8_9t6XQrVZ3s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5262200-6a38a75b190f4478b6467c582d1f41f5.jpg"
        }
    ],
    "main category": "carbs"
}