{
    "title": "Instant Pot Creme Brulee",
    "Category": "Creme Brulee",
    "Ingredients": [
        {
            "1": "1 cup heavy cream"
        },
        {
            "2": "2  egg yolks"
        },
        {
            "3": "1.0 tablespoons white sugar"
        },
        {
            "4": "1 teaspoon vanilla extract"
        },
        {
            "5": "1 pinch salt"
        },
        {
            "6": "3 teaspoons white sugar, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Place a trivet in a multi-functional pressure cooker (such as Instant Pot); add 1 cup water."
        },
        {
            "2": "Heat heavy cream in the microwave until very hot, but not boiling, about 45 seconds."
        },
        {
            "3": "Whisk egg yolks, 2 1/2 tablespoons sugar, vanilla, and salt together in a mixing bowl. Add 2 tablespoons of the warm cream and whisk quickly. Slowly add in the remaining cream, stirring well. Pour the mixture into three 6-ounce ramekins."
        },
        {
            "4": "Cover ramekins with foil and place on the trivet, stacking if necessary. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 8 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "5": "Release pressure using the natural-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Check custard; it should jiggle around the edges but not be liquid; it will set up more as it cools. Let cool to room temperature, 15 to 30 minutes. Refrigerate for 4 hours."
        },
        {
            "6": "Top each custard with 1 teaspoon sugar. Heat sugar with a kitchen torch until caramelized, about 30 seconds. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 4 hrs 20 mins"
        },
        {
            "Total Time": " 4 hrs 50 mins"
        },
        {
            "Servings": "3 "
        },
        {
            "Yield": "3 6-ounce ramekins"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "369"
        },
        {
            "Fat": "32g"
        },
        {
            "Carbs": "17g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5769936.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}