{
    "title": "California Sushi Roll",
    "Category": "Sushi",
    "Ingredients": [
        {
            "1": "1 cup jasmine rice"
        },
        {
            "2": "0.5 cups water"
        },
        {
            "3": "0.5 cup rice vinegar"
        },
        {
            "4": "2 tablespoons white sugar"
        },
        {
            "5": "2 teaspoons salt"
        },
        {
            "6": "3 sheets nori (dry seaweed)"
        },
        {
            "7": "1  cucumber, sliced lengthwise"
        },
        {
            "8": "2 sticks imitation crab, sliced lengthwise"
        }
    ],
    "Directions": [
        {
            "1": "Rinse rice until water runs clear. Combine rice and 1 1/2 cups water in a saucepan and bring to a boil, about 5 minutes. Reduce heat to low, cover, and simmer until water is completely absorbed and rice is soft, 8 to 10 minutes."
        },
        {
            "2": "Use a wooden spoon to transfer cooked rice to a non-metal bowl and set aside to cool."
        },
        {
            "3": "Meanwhile, combine vinegar, sugar, and salt in a small saucepan and bring to a boil, about 5 minutes. Reduce heat and simmer 1 minute more. Combine vinegar mixture with the cooling rice a few tablespoons at a time until rice is coated; you may not need all of the vinegar mixture. Set aside to finish cooling completely, about 15 minutes."
        },
        {
            "4": "Place a sheet of nori on a sushi mat with the rough side facing up. Place a small bowl of water nearby. Use wet hands to evenly spread a handful of rice onto the nori. Arrange cucumber and crab across the nori, about 1/2 inch from the edge closest to you. Roll the wrap starting at the close edge and rolling away from yourself. Press and roll again to seal. Repeat with remaining nori, rice, cucumber, and crab."
        },
        {
            "5": "Dip a sharp knife into water and slice each roll into 8 pieces, rinsing the knife after each cut to prevent sticking."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "24 pieces of sushi"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "37"
        },
        {
            "Carbs": "8g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8821769.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F773388.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "fish_&_sushi"
}