{
    "title": "Deep-Fried California Roll Rice Balls",
    "Category": "Sushi",
    "Ingredients": [
        {
            "1": "10 ounces imitation crabmeat, chopped"
        },
        {
            "2": "1 medium avocado, diced"
        },
        {
            "3": "3 cups water"
        },
        {
            "4": "3 cups uncooked instant rice"
        },
        {
            "5": "1 (8 ounce) package cream cheese, softened"
        },
        {
            "6": "2 tablespoons soy sauce"
        },
        {
            "7": "1 teaspoon garlic salt"
        },
        {
            "8": "1 teaspoon ground black pepper"
        },
        {
            "9": "2 cups Italian-seasoned bread crumbs"
        },
        {
            "10": "1 cup canola oil for frying, or as needed"
        },
        {
            "11": "3 tablespoons mayonnaise"
        },
        {
            "12": "1 tablespoon Sriracha sauce"
        }
    ],
    "Directions": [
        {
            "1": "Prepare filling: Toss crabmeat and avocado together in a bowl and place in the refrigerator to chill until needed."
        },
        {
            "2": "Bring water to a boil on the stovetop. Add rice, stir, cover, and remove from heat. Set aside until water is absorbed, about 5 minutes, then fluff with a fork."
        },
        {
            "3": "When the rice is set up and still hot, blend in cream cheese, soy sauce, garlic salt, and pepper until the cream cheese is fully incorporated and no chunks remain."
        },
        {
            "4": "Scoop out a golf ball-sized handful of the rice mixture and flatten it into a patty. Add about a heaping teaspoon of the avocado-crab filling into the center. Cup your hand and close the rice around the filling. Roll between your hands if needed to seal and get a good round shape; patch any holes with more rice if needed. Roll in bread crumbs until well coated. Repeat to make remaining balls."
        },
        {
            "5": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C)."
        },
        {
            "6": "Add 1 to 2 balls to the hot oil at a time. If not fully submerged, let each side of the ball fry until golden brown, about 30 seconds per side. Remove to a paper towel-lined plate to drain. Continue to fry remaining rice balls."
        },
        {
            "7": "Combine mayonnaise and Sriracha for dipping sauce. Serve with rice balls."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "5 "
        },
        {
            "Yield": "10 to 15 balls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "771"
        },
        {
            "Fat": "36g"
        },
        {
            "Carbs": "93g"
        },
        {
            "Protein": "20g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9125171.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "fish_&_sushi"
}