{
    "title": "How to Make Japanese Rice Balls (Onigiri)",
    "Category": "Sushi",
    "Ingredients": [
        {
            "1": "0.75 cup short-grain rice"
        },
        {
            "2": "1 cup water"
        },
        {
            "3": "1 teaspoon salt"
        },
        {
            "4": "4 ounces cooked salmon, flaked"
        },
        {
            "5": "1 teaspoon soy sauce, or to taste"
        },
        {
            "6": "0.5 sheet nori (dry seaweed)"
        }
    ],
    "Directions": [
        {
            "1": "Pour rice into a bowl and rinse under running water. Give it a good scrubbing with your hands; rinse off the starch and drain."
        },
        {
            "2": "Place rice in a small pot with water and salt. Cover with a tight-fitting lid and turn the burner to high. Cook for 2 minutes, then reduce heat to low and cook for 20 minutes. Turn off the heat and let sit with the lid on to fully absorb the moisture for 10 minutes. Transfer rice to a cutting board to cool slightly."
        },
        {
            "3": "Season flaked salmon with soy sauce."
        },
        {
            "4": "Flatten cooled rice into a rectangle and divide into 6 portions. Place a portion of salmon on top of each section of rice. Wet your hands and pick up a section of rice. Gently cup the rice around the filling; keep cupping until filling is completely covered and you've formed a ball. Mold the rice ball into a triangle shape by placing the bottom on one palm and flattening the back with your fingers. Bend the other hand and press the rice into a triangle on your palm, flattening the front side if needed. Place a strip of nori on the bottom of the onigiri to make it easier to pick up."
        },
        {
            "5": "Repeat to make remaining rice balls, wetting your hands as necessary to prevent the rice from sticking."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "2 "
        },
        {
            "Yield": "6 rice balls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "337"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "60g"
        },
        {
            "Protein": "16g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1014839.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "fish_&_sushi"
}