{
    "title": "Sneaky Sushi Rolls",
    "Category": "Sushi",
    "Ingredients": [
        {
            "1": "3 cups uncooked instant rice"
        },
        {
            "2": "3 cups water"
        },
        {
            "3": "2 tablespoons rice vinegar"
        },
        {
            "4": "1  avocado, halved and pitted"
        },
        {
            "5": "1 (8 ounce) package cream cheese"
        },
        {
            "6": "1 (12 ounce) package imitation crab legs"
        },
        {
            "7": "10  nori seaweed sheets"
        },
        {
            "8": "1 tablespoon wasabi paste, or as desired"
        },
        {
            "9": "0.25 cup sushi ginger, or as desired"
        }
    ],
    "Directions": [
        {
            "1": "Combine rice and water in a large microwave-safe bowl. Cover and cook in the microwave for 8 minutes. Allow to cool slightly before removing bowl from the microwave. Uncover rice and stir in vinegar using a wooden spoon; rice will become sticky."
        },
        {
            "2": "Slice avocado into long sticks. Cut cream cheese into long sticks. Open crab legs and separate them. Cut 5 crab legs in half and pair each with a full leg to have 10 sets."
        },
        {
            "3": "Lay 1 nori sheet on a dry cutting board. Use wet hands to scoop a handful of cooled rice onto 1/2 the sheet closest to you. Place cream cheese, avocado, and crab on the center of the rice, extending all the way across the nori. roll nori up, starting at the rice end and ending on the plain end; use wet hands to seal, if necessary. Place roll seam-side down on a separate cutting board. Repeat with remaining nori, rice, and fillings."
        },
        {
            "4": "Use a large knife to cut 1 roll in half; line up halves, and cut each into 3 pieces. Repeat with remaining rolls for a total of 60 pieces. Wipe the knife on a towel in between slices. Serve with wasabi and ginger."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Total Time": "25 mins"
        },
        {
            "Servings": "60 "
        },
        {
            "Yield": "60 pieces of sushi"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "44"
        },
        {
            "Fat": "2g"
        },
        {
            "Carbs": "6g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "fish_&_sushi"
}