{
    "title": "Ezekiel Bread II",
    "Category": "Wheat Bread",
    "Ingredients": [
        {
            "1": "1 cup lentils"
        },
        {
            "2": "2 (.25 ounce) packages active dry yeast"
        },
        {
            "3": "5 cups warm water (110 degrees F/45 degrees C), divided"
        },
        {
            "4": "5 tablespoons olive oil"
        },
        {
            "5": "1 tablespoon salt"
        },
        {
            "6": "1 tablespoon honey"
        },
        {
            "7": "8 cups whole wheat flour"
        },
        {
            "8": "4 cups barley flour"
        },
        {
            "9": "2 cups soy flour"
        },
        {
            "10": "0.5 cup millet flour"
        },
        {
            "11": "0.25 cup rye flour"
        }
    ],
    "Directions": [
        {
            "1": "Place lentils in a small saucepan, cover with water and cook until soft. Drain and set aside to cool. In a small bowl, dissolve yeast in 1/2 cup warm water. Let stand until creamy, about 10 minutes."
        },
        {
            "2": "Place the cooled lentils in a bowl and mash. Mix in olive oil, honey, salt and remaining 4 1/2 cups warm water. In a large bowl, mix together whole wheat flour, barley flour, soy flour, millet flour and rye flour."
        },
        {
            "3": "Stir the yeast mixture into the lentil mixture. Beat in 2 cups of the flour mixture. Stir in the remaining flour mixture, 1 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour."
        },
        {
            "4": "Deflate the dough and turn it out onto a lightly floured surface. Briefly knead the dough and divide into four equal pieces and form into loaves. Place the loaves into four lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C)."
        },
        {
            "5": "Bake in preheated oven for about 1 hour, or until bottom of a loaf sounds hollow when tapped."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 1 hrs 20 mins"
        },
        {
            "Additional Time": " 1 hrs 55 mins"
        },
        {
            "Total Time": " 4 hrs"
        },
        {
            "Servings": "48 "
        },
        {
            "Yield": "4 9x5-inch loaves"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "162"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "29g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1005757.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F968893.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}