{
    "title": "Irresistible Whole Wheat Challah",
    "Category": "Wheat Bread",
    "Ingredients": [
        {
            "1": "4 cups whole wheat flour"
        },
        {
            "2": "1 teaspoon salt"
        },
        {
            "3": "0.5 teaspoons active dry yeast"
        },
        {
            "4": "2 tablespoons vital wheat gluten (Optional)"
        },
        {
            "5": "0.5 cup honey"
        },
        {
            "6": "0.5 cup olive oil"
        },
        {
            "7": "1 cup warm water"
        },
        {
            "8": "2  eggs"
        },
        {
            "9": "0.25 cup raisins, to taste (Optional)"
        }
    ],
    "Directions": [
        {
            "1": "In a large bowl, stir together the flour, salt, yeast, and vital wheat gluten until well mixed. In another bowl, stir together the honey, olive oil, water, eggs, and raisins. Pour the liquid mixture into the flour mixture, and stir until it forms a dough."
        },
        {
            "2": "Turn the dough out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Form the dough into a round shape. Lightly oil a bowl, place the dough in the bowl, and turn the dough over a few times to oil the surface. Cover the bowl with a cloth, and let rise in a warm, draft-free place until doubled, about 1 hour."
        },
        {
            "3": "Punch down the dough, knead it a few times to remove some of the bubbles, and cut it into 2 equal-sized pieces. Set 1 piece of dough aside under a cloth to prevent drying out while you shape or braid the first loaf as desired."
        },
        {
            "4": "Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Repeat for the other loaf, place the braided loaves on a baking sheet lined with parchment paper, and let rise in a warm place until doubled, about 30 minutes."
        },
        {
            "5": "Preheat oven to 350 degrees F (175 degrees C)."
        },
        {
            "6": "Bake in the preheated oven until golden brown, about 30 minutes. Serve warm for best flavor."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 1 hrs 40 mins"
        },
        {
            "Total Time": " 2 hrs 40 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "2 loaves"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "215"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "33g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8352495.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8067080.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Ff512ff62184e318fffbaee306fa42ce0%2F6610163.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4559721.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}