{
    "title": "Sourdough Discard Bread",
    "Category": "Wheat Bread",
    "Ingredients": [
        {
            "1": "1 Dough-"
        },
        {
            "2": "0.5 cups warm water (98 to 115 degrees F/37 to 46 degrees C)"
        },
        {
            "3": "7 tablespoons sourdough starter discard"
        },
        {
            "4": "0.5 teaspoons active dry yeast"
        },
        {
            "5": "2 cups whole wheat flour"
        },
        {
            "6": "4 teaspoons whole wheat flour"
        },
        {
            "7": "2 cups bread flour"
        },
        {
            "8": "4 teaspoons bread flour"
        },
        {
            "9": "0.75 teaspoons salt"
        },
        {
            "10": "1 For Kneading-"
        },
        {
            "11": "0.25 cup bread flour, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Mix water, starter discard, and yeast together in a large bowl; whisk or swish around with your fingers. Let mixture sit for 10 minutes."
        },
        {
            "2": "Combine 2 cups plus 4 teaspoons whole wheat flour and 2 cups plus 4 teaspoons bread flour in another bowl; sprinkle over the entire yeast mixture and sprinkle salt on top of the flour. Mix well by hand until you can form a ball. Let this dough ball sit covered with a kitchen towel for 30 minutes."
        },
        {
            "3": "Knead dough on a floured surface until you have a nice, tight ball; once you notice the surface of the dough start to tear, stop kneading. Be sure not to add too much flour while kneading, you should only need about 1 tablespoon or 2."
        },
        {
            "4": "Line a bread basket with a kitchen towel and liberally sprinkle 1/4 cup bread flour on the towel so the dough won't stick while rising. Place dough into the bread basket with the bottom of the loaf facing up. Let rise for 2 hours."
        },
        {
            "5": "Place a Dutch oven in the oven and preheat oven to 475 degrees F (245 degrees C)."
        },
        {
            "6": "Turn dough over onto a piece of parchment paper. Cut a shallow X across the surface of the dough using a very sharp knife."
        },
        {
            "7": "Using hot pads, carefully remove the Dutch oven from the oven. Place it on the stovetop and remove the lid. Hold the sides of the parchment paper to lift the loaf and carefully lower it into the Dutch oven. It's totally fine for the bread to bake with the parchment paper, it makes it easier to handle."
        },
        {
            "8": "Cover the Dutch oven and bake in the preheated oven for 40 minutes. Reduce oven temperature to 450 degrees F (230 degrees C) and continue to bake until golden, about 20 minutes more. Remove from the oven and place on a wire cooling rack. Let bread cool for at least 2 hours before cutting."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": " 4 hrs 40 mins"
        },
        {
            "Total Time": " 6 hrs 25 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "1 loaf"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "170"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8992747.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}