{
    "title": "Chicken and Chorizo Paella on the Grill",
    "Category": "Paella",
    "Ingredients": [
        {
            "1": "0.5 pounds chicken thighs"
        },
        {
            "2": "0.5 teaspoons hot paprika, divided, or to taste"
        },
        {
            "3": "1 salt and ground black pepper to taste"
        },
        {
            "4": "0.5 cup olive oil, divided"
        },
        {
            "5": "1 (28 ounce) can crushed fire-roasted tomatoes"
        },
        {
            "6": "2 cups diced sweet onion"
        },
        {
            "7": "8 ounces dry-cured chorizo, thinly sliced"
        },
        {
            "8": "5 cloves garlic, minced"
        },
        {
            "9": "1 teaspoon ground turmeric"
        },
        {
            "10": "0.5 teaspoon saffron"
        },
        {
            "11": "0.5 teaspoon dried oregano"
        },
        {
            "12": "1.0 cups uncooked Bomba rice"
        },
        {
            "13": "6 cups chicken stock, divided"
        },
        {
            "14": "1  red bell pepper, cut into matchsticks"
        },
        {
            "15": "2 cups string beans"
        },
        {
            "16": "0.5 cup Marcona almonds, halved"
        }
    ],
    "Directions": [
        {
            "1": "Place chicken on a plate and season with 1/2 teaspoon paprika, salt, and pepper. Refrigerate for 2 hours."
        },
        {
            "2": "Preheat a grill for medium heat. Place a large paella pan on the grate. Heat about 1 tablespoon olive oil in the pan. Add chicken; sear until browned, about 4 minutes per side. Remove chicken and wrap in aluminum foil."
        },
        {
            "3": "Heat remaining olive oil in the pan. Add tomatoes, onion, chorizo, and garlic. Cook until tomato juices are mostly reduced, 5 to 10 minutes. Stir in remaining paprika, turmeric, saffron, and oregano. Add rice and cook for 5 minutes. Pour in 4 cups chicken stock; increase heat to high. Stir once and close the grill lid. Cook until the rice on the bottom becomes crispy, about 8 minutes."
        },
        {
            "4": "Scrape the bottom of the pan and turn rice over 4 or 5 times until a crust forms at the bottom. Add bell pepper, string beans, and the chicken thighs. Pour in remaining chicken stock. Stir and flip rice until stock is absorbed and rice is tender, 10 to 15 minutes more. Garnish with almonds."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": " 2 hrs"
        },
        {
            "Total Time": " 3 hrs"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "739"
        },
        {
            "Fat": "39g"
        },
        {
            "Carbs": "68g"
        },
        {
            "Protein": "31g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}