{
    "title": "Hamentaschen",
    "Category": "Purim Recipes",
    "Ingredients": [
        {
            "1": "1 Cookie Dough-"
        },
        {
            "2": "4 cups all-purpose flour"
        },
        {
            "3": "2 teaspoons baking powder"
        },
        {
            "4": "0.5 teaspoon salt"
        },
        {
            "5": "3  eggs"
        },
        {
            "6": "1 cup white sugar"
        },
        {
            "7": "0.5 cup vegetable oil"
        },
        {
            "8": "1  orange, zested and juiced"
        },
        {
            "9": "1  lemon, zested and juiced"
        },
        {
            "10": "1 teaspoon vanilla extract"
        },
        {
            "11": "1 Glaze-"
        },
        {
            "12": "1  egg, beaten"
        },
        {
            "13": "1 tablespoon heavy cream"
        },
        {
            "14": "1 teaspoon water"
        },
        {
            "15": "0.75 cup apricot jam, or as needed"
        },
        {
            "16": "2 tablespoons white sugar, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Sift together all-purpose flour, baking powder, and salt in a bowl. Set aside."
        },
        {
            "2": "Beat eggs with an electric mixer in a second bowl until smooth. Set aside."
        },
        {
            "3": "Mix sugar, vegetable oil, orange and lemon zests and juices, and vanilla extract in a third bowl. Add to beaten eggs; mix well. Add the flour mixture and beat until the dough starts to pull away from the sides of the bowl and forms a ball."
        },
        {
            "4": "Place dough onto a floured work surface and knead until it no longer sticks to your fingers. Shape into a disk and wrap in plastic wrap. Refrigerate for 30 minutes."
        },
        {
            "5": "Preheat the oven to 375 degrees F (190 degrees C). Grease 2 cookie sheets."
        },
        {
            "6": "Whisk egg, cream, and water together to make glaze."
        },
        {
            "7": "Divide chilled dough into 4 sections. Roll out dough on floured work surface with a floured rolling pin until it is about 1/8-inch thick. Use a cookie cutter or jar lid to cut out circles about 4 inches in diameter."
        },
        {
            "8": "Place 1 teaspoon of apricot jam in the center of a dough circle. Pinch 2 sides together to create 2 sides of a triangle. Use some of the egg glaze as 'glue' if needed. Fold the bottom of the circle up to form the third side of the 'hat,' leaving a little of the filling visible in the center. Repeat with remaining dough circles and filling."
        },
        {
            "9": "Place cookies on the prepared cookie sheets. Brush tops with egg glaze mixture using a pastry brush. Sprinkle with sugar."
        },
        {
            "10": "Bake in the preheated oven until light golden brown, about 18 minutes. Cool for 10 minutes before transferring to a cooling rack with a spatula."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs 10 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "40 mins"
        },
        {
            "Total Time": " 2 hrs 10 mins"
        },
        {
            "Servings": "30 "
        },
        {
            "Yield": "30 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "153"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "26g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}