{
    "title": "Balsamic Braised Pork Tenderloins with Fresh Figs",
    "Category": "Pork Tenderloin",
    "Ingredients": [
        {
            "1": "2 (1 1/2 pound) pork tenderloins"
        },
        {
            "2": "1 teaspoon kosher salt, or to taste"
        },
        {
            "3": "0.5 teaspoon freshly ground black pepper, or to taste"
        },
        {
            "4": "2 tablespoons olive oil"
        },
        {
            "5": "2  shallots, thinly sliced lengthwise"
        },
        {
            "6": "12  fresh figs, stemmed and halved"
        },
        {
            "7": "1 cup chicken broth"
        },
        {
            "8": "0.25 cup good-quality balsamic vinegar"
        },
        {
            "9": "1 tablespoon minced fresh rosemary"
        },
        {
            "10": "1 fresh rosemary sprigs for garnish (optional)"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Pat tenderloins dry and remove silver skin, if present. Season with kosher salt and freshly ground pepper, to taste."
        },
        {
            "3": "Pour oil into a large, oven-proof skillet and heat over medium-heat until oil shimmers. Carefully place seasoned tenderloins into the hot oil and brown on all sides, 7 to 10 minutes total."
        },
        {
            "4": "Add sliced shallots around tenderloins and stir, about 1 minute. Add figs, chicken broth, and balsamic vinegar. When the mixture begins to bubble, sprinkle minced rosemary over everthing."
        },
        {
            "5": "Cover, place in the preheated oven and bake until pork is no longer pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C)."
        },
        {
            "6": "Using tongs, remove pork from the skillet and place on a serving platter. With a slotted spoon, remove figs from the skillet and place around the tenderloins. Cover loosely with foil."
        },
        {
            "7": "Place skillet back onto the stovetop over medium-high heat. Bring pan juices to a boil and allow to reduce to about 3/4 cup, 10 to 15 minutes."
        },
        {
            "8": "Slice tenderloins, drizzle reduced liquid over the meat, and garnish with fresh rosemary sprigs, if desired."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "2 pork tenderloins"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "307"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "18g"
        },
        {
            "Protein": "36g"
        }
    ],
    "Images": [],
    "main category": "pork"
}