{
    "title": "Pork Tenderloin with Peaches",
    "Category": "Pork Tenderloin",
    "Ingredients": [
        {
            "1": "3 slices bacon"
        },
        {
            "2": "1 (2 pound) package pork tenderloin"
        },
        {
            "3": "0.5 teaspoon salt"
        },
        {
            "4": "0.25 teaspoon freshly ground black pepper"
        },
        {
            "5": "0.75 teaspoon ground ginger, divided"
        },
        {
            "6": "0.5 cups vertically sliced onion"
        },
        {
            "7": "0.5 teaspoons minced garlic"
        },
        {
            "8": "2 cups peeled and sliced fresh peaches"
        },
        {
            "9": "1 cup low-sodium chicken broth"
        },
        {
            "10": "2 tablespoons frozen orange juice concentrate"
        },
        {
            "11": "1 teaspoon fish sauce"
        },
        {
            "12": "2 tablespoons water"
        },
        {
            "13": "2 tablespoons cornstarch"
        },
        {
            "14": "1 fresh parsley for garnish (optional)"
        }
    ],
    "Directions": [
        {
            "1": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Reserve drippings in the skillet."
        },
        {
            "2": "Dry pork tenderloin with paper towels and season both sides with salt, pepper, and 1/4 teaspoon ground ginger."
        },
        {
            "3": "Increase heat to medium-high and brown tenderloin in the bacon drippings on all sides, 5 to 7 minutes. Removed browned tenderloin from skillet, transfer to a plate, and keep warm."
        },
        {
            "4": "Reduce heat to medium. Add onion slices to the same skillet and stir until onions are soft and beginning to take on some color, 3 to 5 minutes. Stir in garlic and cook until fragrant, about 1 minute."
        },
        {
            "5": "Add sliced peaches, chicken broth, orange juice concentrate, and remaining ground ginger. Bring to a boil and return tenderloin to the skillet. Pile peaches on top of the meat, cover, reduce heat to simmer, and cook until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."
        },
        {
            "6": "Arrange pork and peaches on a serving platter."
        },
        {
            "7": "Meanwhile, combine fish sauce, water, and cornstarch in a small bowl and stir until there are no lumps. Increase heat to medium and bring skillet contents back to a boil. Add cornstarch mixture to the liquid in the skillet and stir quickly until sauce is bubbly and thickened, about 5 minutes."
        },
        {
            "8": "Pour sauce over pork and peaches. Crumble up cooked bacon and sprinkle over the peaches. Garnish with parsley, if desired, and serve warm."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "8 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "200"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "9g"
        },
        {
            "Protein": "26g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fb3fffde9f1b80d34b75dda3aebe4af9e%2F1664249868309157817_10228459085559111_1600022783330558932_n.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pork"
}