{
    "title": "Brown Butter-Maple Shortbread Bear Cookies",
    "Category": "Shortbread Cookies",
    "Ingredients": [
        {
            "1": "0.5 cup unsalted butter"
        },
        {
            "2": "0.25 cup pure maple syrup"
        },
        {
            "3": "2 tablespoons packed dark brown sugar"
        },
        {
            "4": "1 teaspoon vanilla extract"
        },
        {
            "5": "1 teaspoon maple extract"
        },
        {
            "6": "0.5 teaspoon ground cinnamon"
        },
        {
            "7": "0.25 teaspoon ground nutmeg"
        },
        {
            "8": "0.25 teaspoon salt"
        },
        {
            "9": "0.25 cups all-purpose flour"
        },
        {
            "10": "0.25 teaspoon baking powder"
        },
        {
            "11": "1 tablespoon chocolate chips, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Place butter into a small light-colored saucepan over medium heat. Cook, swirling often, until small brown bits begin to stick to the bottom of the pan and the butter smells nutty, 8 to 10 minutes. Pour butter into a mixing bowl and allow to cool for 5 minutes."
        },
        {
            "2": "Add maple syrup and brown sugar to butter and stir to combine. Mix in vanilla extract, maple extract, cinnamon, nutmeg, and salt until combined. Add in flour and baking powder and mix until a smooth dough forms. Cover and place into the fridge for at least 2 hours."
        },
        {
            "3": "Line a baking sheet with parchment paper."
        },
        {
            "4": "Remove dough from fridge. Scoop out 1 tablespoon of dough and roll into a ball; place onto cookie sheet and flatten slightly. Scoop out 1/4 teaspoon of dough and roll into a small ball, then flatten into a circle shape; place on top of the 1 tablespoon ball of dough to form the 'snout' of the bear. Scoop out two 1/8 teaspoons of dough and roll into tiny balls; place on each side of the top of the cookie to make the ears. Set bear cookie on the prepared baking sheet. Continue rolling out and forming bear shapes until dough is used up. Space bear cookies about 1 inch apart on the baking sheet. Chill baking sheet into fridge for 20 minutes to allow cookies to firm up."
        },
        {
            "5": "Preheat the oven to 325 degrees F (165 degrees C)."
        },
        {
            "6": "Remove baking sheet from fridge and place into the preheated oven. Bake until cookies are slightly browned on the bottom, 20 to 23 minutes. Allow cookies to cool on the sheet for a few minutes before removing to a wire rack to cool completely."
        },
        {
            "7": "Place chocolate chips into a small microwave-safe bowl or measuring cup and heat until melted, about 1 minute; stopping to stir every 30 seconds. Pour melted chocolate into a piping bag or a freezer bag, and snip a small hole on one of the corners. Pipe eyes and noses on the cookies. Allow chocolate to harden before serving. Keep extra cookies stored in an air-tight container."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Cool Time": " 2 hrs 25 mins"
        },
        {
            "Total Time": " 3 hrs 35 mins"
        },
        {
            "Servings": "18 "
        },
        {
            "Yield": "18 shortbread bears"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "103"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "12g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F24341928a9a76e5282e5cf20b337d58c%2F1669040113144IMG_20221110_203405.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F24341928a9a76e5282e5cf20b337d58c%2F1667850181466PXL_20221106_212704799.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}