{
    "title": "Mini Christmas Cakes",
    "Category": "Cupcakes",
    "Ingredients": [
        {
            "1": "1 Cake-"
        },
        {
            "2": "3 cups dried currants"
        },
        {
            "3": "0.25 cups raisins"
        },
        {
            "4": "1 cup sultana raisins"
        },
        {
            "5": "0.5 cup candied red cherries, chopped"
        },
        {
            "6": "8 fluid ounces brandy"
        },
        {
            "7": "1 grated zest of 1 large orange"
        },
        {
            "8": "1 grated zest of 1 large lemon"
        },
        {
            "9": "1 cup unsalted butter, softened"
        },
        {
            "10": "2 tablespoons unsalted butter, softened"
        },
        {
            "11": "1 cup brown sugar"
        },
        {
            "12": "2 tablespoons brown sugar"
        },
        {
            "13": "3 large eggs, beaten"
        },
        {
            "14": "1 tablespoon molasses, or more to taste"
        },
        {
            "15": "1 cup all-purpose flour"
        },
        {
            "16": "0.5 cup self-rising flour"
        },
        {
            "17": "0.25 cup ground almonds"
        },
        {
            "18": "2 teaspoons mixed spice"
        },
        {
            "19": "0.5 cup ground almonds"
        },
        {
            "20": "1 Decoration-"
        },
        {
            "21": "6 tablespoons apricot jam"
        },
        {
            "22": "1.0 (4 ounce) packages marzipan"
        },
        {
            "23": "0.5 (1 lb 8 oz) box white fondant"
        },
        {
            "24": "1 teaspoon blue food coloring"
        }
    ],
    "Directions": [
        {
            "1": "Combine currants, raisins, sultana raisins, and candied cherries in a plastic container with a lid. Pour brandy over dried fruit; stir in orange and lemon zest. Close container and set aside to soak for 2 to 3 days. Stir or shake container every few hours as you remember."
        },
        {
            "2": "Preheat oven to 275 degrees F (135 degrees C). Line a baking sheet with 24 cupcake cases or lightly grease 24 ramekins."
        },
        {
            "3": "Combine 1 cup plus 2 tablespoons butter and 1 cup plus 2 tablespoons brown sugar in a bowl and beat with an electric mixer until well combined. Add eggs and molasses and beat well. Stir in all-purpose flour, self-rising flour, almonds, and mixed spice until well combined. Fold in almonds and soaked fruit; mix well. Spoon mixture into the prepared cases or ramekins."
        },
        {
            "4": "Bake in the preheated oven on the center rack until a toothpick inserted in the middle of a cake comes out clean, about 90 minutes. Allow to cool in their cases."
        },
        {
            "5": "Store in airtight tins or wrap them tightly in greaseproof paper and aluminum foil for at least 10 days before decorating."
        },
        {
            "6": "Heat jam in the microwave for 10 seconds until warmed and brush onto each cake."
        },
        {
            "7": "Roll out marzipan between 2 sheets of plastic wrap. Cut out circles with a round cookie cutter or a glass with the same diameter as the cakes. Arrange marzipan circles on top of the jam on each mini fruitcake. Store fruitcakes in an airtight container before finishing the final decoration, 8 hours to overnight."
        },
        {
            "8": "Roll out white fondant between 2 sheets of plastic wrap and cut out circles with the same diameter as the cakes. Press a cookie stencil with a snowflake pattern onto the fondant circles. Color in the snowflake pattern with blue food coloring using a small brush and place on top of the marzipan layer. Repeat with remaining cakes."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": " 1 hrs 30 mins"
        },
        {
            "Additional Time": "12 days 8 hrs"
        },
        {
            "Total Time": "12 days 10 hrs 30 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "24 christmas cakes"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "422"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "67g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4774632.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "cakes"
}