{
    "title": "Tamales de Puerco (Red Pork Tamales)",
    "Category": "Pork Shoulder",
    "Ingredients": [
        {
            "1": "1 Filling-"
        },
        {
            "2": "0.5 pounds boneless pork shoulder, trimmed"
        },
        {
            "3": "0.5  onion"
        },
        {
            "4": "4 cloves garlic, minced"
        },
        {
            "5": "2  bay leaves"
        },
        {
            "6": "1 salt to taste"
        },
        {
            "7": "1 water to cover"
        },
        {
            "8": "1 corn husks"
        },
        {
            "9": "1 Sauce-"
        },
        {
            "10": "1 pound Roma tomatoes"
        },
        {
            "11": "4  dried chile de arbol peppers"
        },
        {
            "12": "4 small guajillo chile peppers, stemmed and seeded"
        },
        {
            "13": "1 tablespoon cornstarch"
        },
        {
            "14": "1 Tamales-"
        },
        {
            "15": "0.25 cups lard"
        },
        {
            "16": "2.0 cups fresh corn masa dough"
        },
        {
            "17": "1 tablespoon salt"
        },
        {
            "18": "1 tablespoon baking powder"
        }
    ],
    "Directions": [
        {
            "1": "Cut pork into 3 chunks and place in a large saucepan. Add onion, garlic, bay leaves, and salt and cover with water. Bring to a boil; skim foam from surface. Reduce heat, cover, and simmer for 1 hour. Remove pork and let cool. Strain broth and reserve."
        },
        {
            "2": "Bring a pot of water to a boil while pork is cooking. Add tomatoes, arbol chiles, and guajillo chiles, and boil until chiles are soft, about 5 minutes. Remove with a slotted spoon, reserving cooking water, and allow to cool."
        },
        {
            "3": "Place corn husks in a bowl, cover with boiling water, and soak for 30 to 60 minutes. Drain, place on a work surface, and cover with a clean, damp towel."
        },
        {
            "4": "Combine tomatoes, 1/2 cup cooking water, chiles de arbol, guajillo chiles, and cornstarch in a blender; blend until smooth. Strain tomato sauce through a fine-mesh sieve."
        },
        {
            "5": "Beat lard with an electric mixer in a large bowl until fluffy. Combine masa, 1 cup reserved pork broth, 1 tablespoon salt, and baking powder in a separate bowl and mix until smooth. Add masa mixture to lard and mix until it has a smooth cookie dough consistency. Test if the masa is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready, if not, keep beating for a little longer."
        },
        {
            "6": "Shred cooled pork with 2 forks."
        },
        {
            "7": "Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto the the corn husk, filling it up to 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon of the tomato sauce and pork down the center of the masa mixture. Fold sides of husk together, 1 over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks."
        },
        {
            "8": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the husk, about 1 hour. Let tamales rest for 15 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 2 hrs"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 2 hrs 45 mins"
        },
        {
            "Servings": "15 "
        },
        {
            "Yield": "15 tamales"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "344"
        },
        {
            "Fat": "20g"
        },
        {
            "Carbs": "30g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7412028.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4585137.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pork"
}