{
    "title": "Ultimate Creamy Chicken Enchiladas",
    "Category": "Enchiladas",
    "Ingredients": [
        {
            "1": "0.25 pounds skinless, boneless chicken breast halves"
        },
        {
            "2": "2 teaspoons kosher salt, divided"
        },
        {
            "3": "2 teaspoons chili powder, divided"
        },
        {
            "4": "0.5 teaspoons ground cumin, divided"
        },
        {
            "5": "12 (6 inch) flour tortillas"
        },
        {
            "6": "2 tablespoons butter"
        },
        {
            "7": "1 tablespoon olive oil"
        },
        {
            "8": "1 small onion, finely chopped"
        },
        {
            "9": "1 medium poblano pepper, seeded and chopped"
        },
        {
            "10": "1 small yellow bell pepper, finely chopped"
        },
        {
            "11": "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®)"
        },
        {
            "12": "0.5 (8 ounce) package cream cheese"
        },
        {
            "13": "4 ounces sour cream"
        },
        {
            "14": "4 cups shredded Cheddar-Monterey Jack cheese blend, divided"
        },
        {
            "15": "1 cup refried beans"
        },
        {
            "16": "1 (15 ounce) can red enchilada sauce"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 325 degrees F (165 degrees C)."
        },
        {
            "2": "Place chicken on a large sheet of foil and season with 1 teaspoon salt, 1/2 teaspoon chili powder, and 1/2 teaspoon cumin. Seal the foil around the chicken and place the packet on a rimmed baking sheet."
        },
        {
            "3": "Bake in the preheated oven until tender and no longer pink in the center, about 50 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Shred cooked chicken and set aside. Increase the oven temperature to 375 degrees F (190 degrees C)."
        },
        {
            "4": "While chicken cooks, prepare tortillas. Spread both sides of each tortilla lightly with butter."
        },
        {
            "5": "Heat a skillet over medium heat. Toast each tortilla, about 10 seconds on each side, and set aside."
        },
        {
            "6": "Heat oil in a large skillet over medium-high heat. Add onion, poblano pepper, and bell pepper and cook, stirring often, about 2 minutes. Add remaining salt, chili powder, and cumin and cook, stirring frequently, until veggies are very tender, about 5 minutes. Reduce heat to medium-low and stir in tomatoes and cream cheese. Cook, stirring constantly, until cheese has melted. Remove from heat and stir in sour cream and 2 cups Cheddar-Monterey Jack cheese blend. Fold in shredded chicken."
        },
        {
            "7": "Spread about 1 tablespoon refried beans, if using, in the center of a tortilla. Add about 1/4 cup chicken filling and roll up to seal. Repeat with remaining beans and filling. Pour 1/4 cup sauce in the bottom of 9x13-inch baking dish. Arrange enchiladas in a single layer over the sauce. Pour remaining enchilada sauce over the top and spread to evenly coat. Sprinkle with remaining cheese."
        },
        {
            "8": "Bake in the preheated oven until golden and bubbly, about 30 minutes. Let stand for 10 minutes before serving with desired toppings."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs 20 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "827"
        },
        {
            "Fat": "47g"
        },
        {
            "Carbs": "53g"
        },
        {
            "Protein": "47g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9325174.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://www.allrecipes.com/thmb/Weuh_7A6zDTxG5eRUcc5PnxvLSQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9325174-050c2d12161648b3b15aeee5b2d4e52d.jpg"
        }
    ],
    "main category": "holidays_and_traditional_food"
}