{
    "title": "Crab and Shrimp Gumbo with Okra",
    "Category": "Gumbo",
    "Ingredients": [
        {
            "1": "0.5 cup canola oil"
        },
        {
            "2": "0.5 cup all-purpose flour"
        },
        {
            "3": "1 pound chopped okra"
        },
        {
            "4": "1 large white onion, finely chopped"
        },
        {
            "5": "3 stalks celery, finely chopped"
        },
        {
            "6": "1 medium green bell pepper, finely chopped"
        },
        {
            "7": "1 clove garlic, minced"
        },
        {
            "8": "1 (14.5 ounce) can diced tomatoes"
        },
        {
            "9": "3 tablespoons canola oil"
        },
        {
            "10": "6 cups water, or more to taste"
        },
        {
            "11": "1 teaspoon gumbo file powder, or to taste"
        },
        {
            "12": "0.5 teaspoon Creole seasoning (such as Tony Chachere's®), or to taste"
        },
        {
            "13": "0.5 teaspoon salt, or to taste"
        },
        {
            "14": "0.25 teaspoon ground black pepper, or to taste"
        },
        {
            "15": "0.25 teaspoon cayenne pepper, or to taste"
        },
        {
            "16": "2  bay leaves, or more to taste"
        },
        {
            "17": "1 pound large shrimp, peeled and deveined"
        },
        {
            "18": "2 (6 ounce) cans lump crabmeat"
        },
        {
            "19": "4 cups hot cooked rice"
        }
    ],
    "Directions": [
        {
            "1": "Heat 1/2 cup oil in a large stockpot over medium-low heat until a pinch of flour sprinkled into the oil just begins to bubble. Whisk in the flour to form a thick paste the consistency of cake frosting. Continue cooking, whisking constantly, until the flour is very dark brown and the color of melted chocolate, about 45 minutes."
        },
        {
            "2": "Reduce heat to low and add okra, onion, celery, bell pepper, and garlic. Cook, stirring constantly, until onions are translucent and veggies are cooked, 6 to 8 minutes. Add diced tomatoes, cover, and bring to a simmer."
        },
        {
            "3": "Meanwhile, heat 3 tablespoons oil in a skillet over medium-high heat. Add okra and cook, stirring constantly, until tender and no longer stringy or slimy, about 10 minutes. Add to simmering roux mixture and simmer over low heat, stirring frequently, 3 to 5 minutes."
        },
        {
            "4": "Add 6 cups water plus file powder, Creole seasoning, salt, pepper, cayenne, and bay leaves. Cook, uncovered, tasting a few times as it cooks to adjust spices and adding more water if necessary, until gumbo is as thick as you would like, at least 2 to 3 hours. The longer it cooks, the better."
        },
        {
            "5": "Stir in shrimp and crabmeat; cook for 15 more minutes. Ladle gumbo over hot rice in serving bowls."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 3 hrs 15 mins"
        },
        {
            "Total Time": " 3 hrs 35 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "420"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "37g"
        },
        {
            "Protein": "21g"
        }
    ],
    "Images": [],
    "main category": "soups"
}