{
    "title": "Gumbo Z'Herbes",
    "Category": "Gumbo",
    "Ingredients": [
        {
            "1": "2 medium leeks"
        },
        {
            "2": "2 bunches collard greens"
        },
        {
            "3": "2 bunches turnip greens"
        },
        {
            "4": "2 bunches Lacinato kale"
        },
        {
            "5": "2 bunches rainbow chard"
        },
        {
            "6": "2 large stalks  celery with leaves"
        },
        {
            "7": "6 tablespoons unsalted butter, divided"
        },
        {
            "8": "2 tablespoons minced fresh thyme, divided"
        },
        {
            "9": "1 medium head green cabbage, cored and chopped"
        },
        {
            "10": "2 tablespoons kosher salt, divided"
        },
        {
            "11": "0.25 cup all-purpose flour"
        },
        {
            "12": "1 large red bell pepper, finely chopped"
        },
        {
            "13": "1 large yellow onion, finely chopped"
        },
        {
            "14": "4 cloves garlic, finely chopped"
        },
        {
            "15": "8 cups low-sodium vegetable broth"
        },
        {
            "16": "2  fresh bay leaves"
        },
        {
            "17": "0.5 teaspoons freshly ground black pepper"
        },
        {
            "18": "0.5 teaspoon file powder"
        },
        {
            "19": "0.25 teaspoon crushed red pepper"
        },
        {
            "20": "3 cups cooked white rice"
        }
    ],
    "Directions": [
        {
            "1": "Cut leeks in half lengthwise, then slice both white and green parts crosswise into 1/4-inch thick pieces. Remove and discard stems from collard greens, turnip greens, kale, and chard; chop all greens, keeping them separate. Dice celery stalks and reserve leaves for garnish."
        },
        {
            "2": "Melt 2 tablespoons butter in a large pot over medium heat. Add leeks and 1 tablespoon thyme; cook, stirring frequently, until leeks are tender and translucent, about 5 minutes. Add collard greens, turnip greens, and cabbage; cook, stirring frequently, until greens are wilted, about 5 minutes. Add kale, chard, and 1 tablespoon salt; cook, stirring frequently, until all greens are wilted, about 5 minutes. Reduce heat to low and continue cooking greens, stirring frequently, until tender and no longer bitter, about 10 minutes. Remove greens from the pot and transfer to a large bowl; set aside until ready to use."
        },
        {
            "3": "Wipe out the pot and melt remaining 4 tablespoons butter over medium heat. Whisk in flour and cook, stirring constantly, until flour mixture is dark brown in color and very aromatic (try to get this mixture as dark as possible without burning it), about 5 minutes. Add bell pepper, onion, and diced celery; cook, stirring frequently, until vegetables are tender, about 5 minutes. Add garlic and remaining 1 tablespoon thyme; cook, stirring constantly, until tender and fragrant, about 1 minute."
        },
        {
            "4": "Whisk in vegetable broth. Add reserved braised greens, add bay leaves, black pepper, file powder, and crushed red pepper. Bring mixture to a boil over medium heat, stirring occasionally. Reduce heat to low, and cook, stirring occasionally, until slightly thickened and vegetables are tender, about 30 minutes. Season with remaining 1 tablespoon salt."
        },
        {
            "5": "Serve over cooked rice and garnish with reserved celery leaves, if desired."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 1 hrs 15 mins"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 cups"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "232"
        },
        {
            "Fat": "7g"
        },
        {
            "Carbs": "39g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9129335.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8997138.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "soups"
}