{
    "title": "Chef John's Individual Beef Wellingtons",
    "Category": "Filet Mignon",
    "Ingredients": [
        {
            "1": "1 For the Mushroom Duxelles-"
        },
        {
            "2": "3 tablespoons unsalted butter"
        },
        {
            "3": "10 large brown mushrooms, finely chopped"
        },
        {
            "4": "0.25 teaspoon salt"
        },
        {
            "5": "2 tablespoons minced shallots"
        },
        {
            "6": "1 freshly ground black pepper to taste"
        },
        {
            "7": "1 pinch cayenne pepper, or to taste"
        },
        {
            "8": "3 tablespoons white wine"
        },
        {
            "9": "2 ounces pate"
        },
        {
            "10": "1 For the Wellingtons-"
        },
        {
            "11": "4 (8 ounce) filet mignon steaks"
        },
        {
            "12": "1 salt and freshly ground black pepper to taste"
        },
        {
            "13": "2 tablespoons salted butter"
        },
        {
            "14": "1 (17.25 ounce) package frozen puff pastry"
        },
        {
            "15": "2 tablespoons Dijon mustard"
        },
        {
            "16": "1 large egg, beaten"
        },
        {
            "17": "1 teaspoon water"
        }
    ],
    "Directions": [
        {
            "1": "Melt butter over medium-high heat. Add mushrooms and salt; cook and stir until well browned and caramelized, about 5 minutes. They will be wet and soggy at first but will dry out."
        },
        {
            "2": "Add shallots and cook until they soften up and turn translucent, about 3 minutes. Add black pepper, cayenne, and white wine. Stir until wine evaporates, about 1 minute. Turn off the heat and transfer to a bowl to cool to room temperature."
        },
        {
            "3": "Add pate to cooled mushroom mixture; toss and mash with a spoon until thoroughly combined. Set aside."
        },
        {
            "4": "Generously season filets with salt and pepper. Melt butter for Wellingtons in the same pan over high heat. Sear, one at a time, in the hot pan until the sides and edges are nicely browned, about 5 minutes per filet. Transfer to a plate and place in the refrigerator until needed."
        },
        {
            "5": "Cut each sheet of pastry into 4 squares. Place one square frozen puff pastry onto a lightly floured surface. Spoon about 3 tablespoons pate mixture into the center and press out to roughly the same size as a filet. Spread 1/2 tablespoon mustard on top of one filet and place mustard-side down on the pate."
        },
        {
            "6": "Gently stretch and fold the shorter sides of the pastry around the filet, then bring the longer sides up and over to seal. You can stretch the dough that will be on the bottom of the filet, but try not to stretch it on the sides and top. It's okay to have a couple of small holes at the bottom. Flip Wellington over and place seam-side down on a plate. Repeat to form remaining 3 Wellingtons, then transfer all to the refrigerator."
        },
        {
            "7": "Preheat the oven to 425 degrees F (220 degrees C). Line a sheet pan with parchment paper."
        },
        {
            "8": "Cut remaining 4 squares of puff pastry into circles that are roughly the size of the Wellingtons. Place on the prepared sheet pan and poke all over each circle with a fork."
        },
        {
            "9": "Bake in the center of the preheated oven for 15 minutes. Remove from the oven, flip, and press circles down with a spatula to flatten. Return to the oven and bake until cooked through and crispy, 5 to 10 minutes longer. Remove from the oven and lift off the sheet pan to cool. Increase the oven temperature to 450 degrees F (230 degrees C)."
        },
        {
            "10": "Transfer Wellingtons to the freezer for exactly 15 minutes. Line the same sheet pan with aluminum foil, then top with parchment paper. Beat egg with water in a small bowl."
        },
        {
            "11": "When Wellingtons have been in the freezer for 15 minutes, transfer to the prepared pan and generously brush with egg wash."
        },
        {
            "12": "Bake pastry in the center of the preheated oven until pastry is golden brown and puffed and filets are cooked through, 23 to 25 minutes. An instant-read thermometer inserted into the center should read 122 degrees F (50 degrees C)."
        },
        {
            "13": "Immediately remove from the hot pan and transfer onto a plate or cutting board for at least 5 minutes. Cut Wellingtons in half, then trim each end to create a flat surface."
        },
        {
            "14": "Place each rounded pastry base on a plate and stand 2 filet halves on top with center cut facing up."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 1 hrs 15 mins"
        },
        {
            "Additional Time": "20 mins"
        },
        {
            "Total Time": " 2 hrs 20 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "1330"
        },
        {
            "Fat": "100g"
        },
        {
            "Carbs": "59g"
        },
        {
            "Protein": "46g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9081629.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8967219.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8948110.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8922301.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/yNkx0nVxu2p2XOveWUOYVhG2yTo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-310-46915dae548c47b6910be206e914166a.jpg"
        },
        {
            "img6": "https://www.allrecipes.com/thmb/yNkx0nVxu2p2XOveWUOYVhG2yTo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-310-46915dae548c47b6910be206e914166a.jpg"
        }
    ],
    "main category": "meat_&_chicken"
}