{
    "title": "Apple Jelly",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "1.5 pounds apples, cored and diced"
        },
        {
            "2": "3 cups water, or as needed"
        },
        {
            "3": "3.5 cups white sugar"
        },
        {
            "4": "0.5 teaspoon butter"
        },
        {
            "5": "1 (2 ounce) package powdered fruit pectin"
        }
    ],
    "Directions": [
        {
            "1": "Place apples in a large pot; cover with water. Bring to a boil; reduce heat, cover, and simmer until apples are slightly tender, about 5 minutes. Crush cooked apples and simmer for 5 more minutes."
        },
        {
            "2": "Transfer crushed apples to a sieve or cheesecloth. Let drip into a bowl until all liquid has drained, pressing gently to release all the juice. Measure 5 cups apple juice, adding water if necessary to have the exact amount. Stir sugar into juice; add butter to reduce foaming."
        },
        {
            "3": "Bring juice mixture to a rolling boil, stirring constantly. Stir in pectin; boil for exactly 1 minute to dissolve pectin, stirring constantly. Remove from heat. Skim off excess foam with a metal spoon."
        },
        {
            "4": "Sterilize the jars and lids in boiling water for at least 5 minutes. Ladle apple jam into the hot, sterilized jars, filling the jars to within 1/8 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "5": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 5 minutes."
        },
        {
            "6": "Carefully remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lids do not move up or down at all). Let stand at room temperature for 24 hours. Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "1 day"
        },
        {
            "Total Time": "1 day 1 hrs"
        },
        {
            "Servings": "100 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "67"
        },
        {
            "Carbs": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7115784.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7060303.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6977631.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F9270957697c9a899dde91a10904e7a16%2F4565229.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}