{
    "title": "Apple Butter Recipe",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "2 pounds Honeycrisp apples - peeled, cored, and cut into 1-inch pieces"
        },
        {
            "2": "2 pounds Granny Smith apples - peeled, cored, and cut into small pieces"
        },
        {
            "3": "1 cup apple cider"
        },
        {
            "4": "2 cups white sugar"
        },
        {
            "5": "2 tablespoons lemon juice"
        },
        {
            "6": "1 canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Combine Honeycrisp apples, Granny Smith apples, and apple cider in a large stainless steel or enamel-coated saucepan; bring to a boil, stirring occasionally. Reduce heat to medium-low; simmer until mixture reduces by about half, about 20 minutes."
        },
        {
            "2": "Stir sugar and lemon juice into the apple mixture; bring to a boil. Reduce heat to medium-low, and continue cooking at a simmer until the mixture is very thick, about 25 minutes."
        },
        {
            "3": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack apple butter into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings."
        },
        {
            "4": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes."
        },
        {
            "5": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "15 "
        },
        {
            "Yield": "15 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "171"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "45g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9160379.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8817723.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8329480.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2004847.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}