{
    "title": "Apricot Jam",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "8 cups fresh apricots - peeled, pitted, and crushed"
        },
        {
            "2": "0.25 cup lemon juice"
        },
        {
            "3": "6 cups white sugar"
        }
    ],
    "Directions": [
        {
            "1": "Mix apricots and lemon juice in a large pot over medium heat; add sugar and slowly bring to a boil, stirring until sugar dissolves. Continue to cook and stir until apricot mixture thickens, about 25 minutes. Remove from heat and skim foam off the top if necessary."
        },
        {
            "2": "Meanwhile, prepare jars, lids, and rings by cleaning and sterilizing them in the dishwasher or a boiling water bath. Leave lids in simmering water until ready to seal jars."
        },
        {
            "3": "Ladle hot jam into hot sterilized jars, leaving about 1/4 inch of space on top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "4": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil, then carefully lower the jars into the pot using a holder, leaving a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 minutes."
        },
        {
            "5": "Remove the jars from the stockpot and place them onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight and the lid does not move up or down at all. Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "50 "
        },
        {
            "Yield": "5 pints"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "105"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "27g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8371311.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8353578.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8264108.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8263685.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}