{
    "title": "Dried Apricot Jam",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "2.0 cups dried apricots"
        },
        {
            "2": "2.0 cups boiling water"
        },
        {
            "3": "1 teaspoon vanilla extract"
        },
        {
            "4": "1 (1.75 ounce) package powdered fruit pectin"
        },
        {
            "5": "7 cups white sugar"
        },
        {
            "6": "0.25 cup lemon juice"
        }
    ],
    "Directions": [
        {
            "1": "Soak apricots in boiling water in a bowl until hydrated, about 30 minutes. Blend apricots, remaining water, and vanilla extract in a food processor, working in batches, until blended but still slightly chunky."
        },
        {
            "2": "Combine apricot mixture with pectin in a large pot over medium heat; cook until just boiling. Add sugar and lemon juice; boil until sugar has dissolved, 1 to 2 minutes."
        },
        {
            "3": "Sterilize jars and lids in boiling water for at least 5 minutes. Pack the apricot jam into the hot, sterilized jars, filling the jars to within 1/4-inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "4": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes."
        },
        {
            "5": "Remove jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, about 1 hour. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 1 hrs 30 mins"
        },
        {
            "Total Time": " 1 hrs 50 mins"
        },
        {
            "Servings": "144 "
        },
        {
            "Yield": "10 cups"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "48"
        },
        {
            "Carbs": "12g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5081634.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1044664.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F949434.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}