{
    "title": "Nectarine Jam",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "4 pounds nectarines - peeled, pitted, and chopped"
        },
        {
            "2": "2 tablespoons lemon juice"
        },
        {
            "3": "3 cups sugar"
        },
        {
            "4": "1 (1.75 ounce) package fruit pectin (such as Sure-Jell® Pectin Light for less or no sugar)"
        },
        {
            "5": "3 drops almond extract, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Inspect five (1/2-pint) jars for cracks and rings for rust; discard any defective ones. Immerse the jars and rings in simmering water until jam is ready. Wash new, unused lids and rings in warm soapy water."
        },
        {
            "2": "Measure finely chopped, peeled nectarines; you should have 4 1/2 cups. Add to a heavy pot and immediately mix with lemon juice so they don't turn brown."
        },
        {
            "3": "Combine 1/4 cup sugar and fruit pectin in a small bowl. Add to nectarines in the pot; stir well. Slowly bring mixture to a full rolling boil that does not stop bubbling when stirred. Add remaining 2 3/4 cups sugar and stir to dissolve, making sure to scrape over the bottom of the pot. Boil for exactly 1 minute, stirring constantly."
        },
        {
            "4": "Remove from heat and stir in almond extract."
        },
        {
            "5": "Pack jam into the prepared jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims with a moist paper towel to remove any spills. Top with the lids and tightly screw on the rings."
        },
        {
            "6": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes."
        },
        {
            "7": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart. Let rest for 24 hours without moving the jars."
        },
        {
            "8": "Gently press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "1 day"
        },
        {
            "Total Time": "1 day 40 mins"
        },
        {
            "Servings": "40 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "78"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F515e935e7d5ce2c42913817482b0043d%2F165387275820220529_153751.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}