{
    "title": "Pectin-Free Strawberry Rhubarb Jam",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "2.0 cups rhubarb, cut into 1/2-inch pieces"
        },
        {
            "2": "6 cups white sugar"
        },
        {
            "3": "0.25 cup lemon juice"
        },
        {
            "4": "2.0 cups fresh strawberries, halved"
        },
        {
            "5": "20  4-ounce canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Mix rhubarb and sugar in a large heavy pot and let stand for 2 hours; stir in lemon juice and strawberries. Bring the mixture to a boil, stirring to dissolve sugar. Set heat to medium-high and cook jam at a full rolling boil until thickened, stirring often to prevent scorching, 20 to 25 minutes. A candy thermometer inserted into the middle of the jam, not touching the pot, should read 220 degrees F (105 degrees C)."
        },
        {
            "2": "Remove jam from heat and stir for 2 to 3 more minutes; skim off any foam."
        },
        {
            "3": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the jam into the sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings."
        },
        {
            "4": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes."
        },
        {
            "5": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Let jars stand on wire racks for 24 hours to cool and seal. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all)."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "1 day"
        },
        {
            "Total Time": "1 day 45 mins"
        },
        {
            "Servings": "60 "
        },
        {
            "Yield": "20 4-ounce jars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "84"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "22g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8495995.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8184642.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F98fb775e624e73121f33c366aee34f5b%2F6786433.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F8a351907e4263a15fa0670d125eb67ff%2F6734353.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}