{
    "title": "Real Fig Preserves",
    "Category": "Jams and Jellies",
    "Ingredients": [
        {
            "1": "2 teaspoons baking soda"
        },
        {
            "2": "5 cups fresh figs, stems removed"
        },
        {
            "3": "1 cup water"
        },
        {
            "4": "0.5 cups white sugar"
        },
        {
            "5": "5 tablespoons butter"
        },
        {
            "6": "1 teaspoon vanilla extract"
        },
        {
            "7": "1  lemon, thinly sliced into rounds"
        },
        {
            "8": "1 tablespoon lemon juice"
        },
        {
            "9": "0.5 teaspoons ground cinnamon"
        },
        {
            "10": "1 teaspoon grated fresh ginger"
        },
        {
            "11": "0.5 teaspoon ground cloves"
        },
        {
            "12": "1 pinch salt, or to taste"
        },
        {
            "13": "8  half-pint canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Dissolve the baking soda in about 2 quarts of cool water, and immerse the figs in the treated water in a large bowl. Gently stir to wash the figs, then drain off the water and rinse the figs thoroughly with fresh cool water. Place the figs into a large pot. Add 1 cup water, sugar, butter, vanilla extract, lemon, lemon juice, cinnamon, ginger, and cloves. Very gently stir the mixture to dissolve the sugar, keeping the figs intact as much as possible."
        },
        {
            "2": "Bring the mixture to a boil over medium heat; reduce heat to a simmer, and cook until the figs are golden brown and coated in syrup, about 1 hour. Stir gently a couple of times to keep the figs from burning onto the bottom of the pot. Add a pinch of salt, if desired, to tame the sweetness."
        },
        {
            "3": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the figs into the hot, sterilized jars and top off with syrup, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "4": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 minutes."
        },
        {
            "5": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area, and wait at least 2 days before opening."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": "2 days"
        },
        {
            "Total Time": "2 days 1 hrs 30 mins"
        },
        {
            "Servings": "64 "
        },
        {
            "Yield": "8 half-pint jars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "36"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "7g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Ffd25b3b0cee93cb62b6ed440a786e109%2F1661481478DDF2A3C1-C56B-414A-970D-C6A173C33668.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8718980.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8555439.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8372347.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}