{
    "title": "Easy Breeze Sugar Cookies",
    "Category": "Sugar Cookies",
    "Ingredients": [
        {
            "1": "1 cup butter flavored shortening"
        },
        {
            "2": "0.5 cups granulated sugar"
        },
        {
            "3": "1  egg"
        },
        {
            "4": "1 teaspoon vanilla"
        },
        {
            "5": "1.5 cups all-purpose flour"
        },
        {
            "6": "1 teaspoon baking soda"
        },
        {
            "7": "0.5 teaspoon baking powder"
        },
        {
            "8": "0.25 teaspoon cream of tartar"
        },
        {
            "9": "3 tablespoons Almond Breeze Vanilla Almondmilk, or more as needed, divided"
        },
        {
            "10": "1 Cooking spray"
        },
        {
            "11": "3 tablespoons granulated sugar, or more to taste"
        },
        {
            "12": "1 pinch Decorator sugar"
        },
        {
            "13": "1 Frosting (if desired)-"
        },
        {
            "14": "4 cups powdered sugar"
        },
        {
            "15": "0.75 cup vegetable shortening"
        },
        {
            "16": "1 teaspoon vanilla"
        },
        {
            "17": "3 tablespoons Almond Breeze Vanilla Almondmilk, or more as needed"
        },
        {
            "18": "1 drop Food coloring"
        }
    ],
    "Directions": [
        {
            "1": "Heat oven to 375 degrees F. Line cookie sheets with parchment paper."
        },
        {
            "2": "In large bowl, beat 1 cup shortening, 1 1/2 cups granulated sugar, egg, and vanilla with electric mixer on medium speed until creamy, scraping sides of bowl if necessary. Add flour, baking soda, baking powder, and cream of tartar. Mix on low speed until well mixed. Add 2 tablespoons of the Almondmilk and beat until smooth."
        },
        {
            "3": "Form into 1 1/4-inch balls, using rounded tablespoonfuls of dough. Place 2 inches apart on cookie sheets. Place 3 to 4 tablespoons granulated sugar in small bowl. Spray flat bottom of measuring cup or drinking glass with cooking spray; dip in sugar. Press each cookie flat, dipping into sugar every other time."
        },
        {
            "4": "If desired, lightly brush tops of cookies with remaining Almondmilk and sprinkle with colored decorator sugar or sprinkles, or leave plain and frost when cooled."
        },
        {
            "5": "Bake 8 to 10 minutes or until edges start to brown. Cool on cookie sheets 2 minutes. Remove to cooling racks."
        },
        {
            "6": "In large bowl, beat powdered sugar, 3/4 cup shortening, vanilla, and 3 tablespoons of the Almondmilk with electric mixer on low speed until moistened. Beat on medium-high speed until smooth and creamy, adding Almondmilk for desired spreading consistency. Tint as desired with food coloring."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "48 "
        },
        {
            "Yield": "4 dozen cookies"
        }
    ],
    "Nutrition Facts": [],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5868036.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}