{
    "title": "Kentucky Bourbon Cake",
    "Category": "Fruitcake",
    "Ingredients": [
        {
            "1": "2 cups bourbon"
        },
        {
            "2": "8 ounces golden raisins"
        },
        {
            "3": "16 ounces red candied cherries, halved"
        },
        {
            "4": "0.75 pound butter"
        },
        {
            "5": "2 cups white sugar"
        },
        {
            "6": "6  egg yolks"
        },
        {
            "7": "6  egg whites"
        },
        {
            "8": "2 cups packed brown sugar"
        },
        {
            "9": "2 teaspoons ground nutmeg"
        },
        {
            "10": "1 teaspoon baking powder"
        },
        {
            "11": "5 cups all-purpose flour"
        },
        {
            "12": "1 pound chopped pecans"
        },
        {
            "13": "1 cup bourbon"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oven to 275 degrees F (135 degrees C). Grease a 10 inch tube pan and line bottom with parchment paper."
        },
        {
            "2": "Soak raisins and cherries in 2 cups of bourbon or whiskey for 48 hours. Before making cake, drain well and reserve the bourbon."
        },
        {
            "3": "In a separate bowl, mix flour, nutmeg and baking powder. Set aside."
        },
        {
            "4": "In a small bowl, cream butter with the white sugar. In a separate small bowl, cream yolks and brown sugar until very light."
        },
        {
            "5": "In a very large bowl, combine the two sugar mixtures and blend well."
        },
        {
            "6": "Alternately add flour mixture and reserved bourbon in three stages, mixing well with each addition."
        },
        {
            "7": "Add soaked fruit and fold in. Add nuts and fold in."
        },
        {
            "8": "In a clean medium bowl, whip egg whites until stiff but not dry. Fold into batter until evenly distributed."
        },
        {
            "9": "Pour into prepared 10 inch tube pan. Place a pan of water in the bottom of the oven and bake for 4 to 5 hours at 275 degrees F (135 degrees C). Ovens vary, so watch the baking time. Test cake with wooden pick. (May take longer than 5 hours)."
        },
        {
            "10": "Remove from oven and allow to cool for 15 minutes before turning out. When almost cool, brush sides and inside hole heavily with bourbon. Wrap cake with bourbon soaked cheesecloth, then with plastic wrap. Refrigerate overnight and saturate again with bourbon. Cover with plastic wrap and then with foil and store for at least 2 weeks in a cool dry place."
        }
    ],
    "Details": [
        {
            "Servings": "14 "
        },
        {
            "Yield": "1 to 10 - inch tube pan"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "1077"
        },
        {
            "Fat": "46g"
        },
        {
            "Carbs": "131g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fab51d7430bc74e17a33d9412ea3bd46e%2F928182.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F619012.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "cakes"
}