{
    "title": "Overnight Mexican Breakfast Strata",
    "Category": "Breakfast Strata",
    "Ingredients": [
        {
            "1": "8 ounces chorizo sausage"
        },
        {
            "2": "2 medium onions, thinly sliced"
        },
        {
            "3": "2 medium poblano peppers, seeded and thinly sliced"
        },
        {
            "4": "1 medium red bell pepper, chopped"
        },
        {
            "5": "8 cups cubed Mexican bolillo rolls"
        },
        {
            "6": "6 large eggs, lightly beaten"
        },
        {
            "7": "1.0 cups 2% milk"
        },
        {
            "8": "1 teaspoon dried oregano"
        },
        {
            "9": "0.5 teaspoon ground paprika"
        },
        {
            "10": "0.5 cup crumbled queso fresco"
        },
        {
            "11": "1 tablespoon snipped fresh cilantro (Optional)"
        }
    ],
    "Directions": [
        {
            "1": "Cook and stir chorizo in a large skillet over medium heat until browned and crumbly, 5 to 7 minutes. Transfer to a bowl using a slotted spoon, reserving 1 tablespoon of drippings in the pan. Add onions to the skillet and cook, stirring frequently, until tender, about 10 minutes. Stir in poblano peppers and bell pepper; cook until just tender, about 5 minutes. Remove from heat and return chorizo to the skillet."
        },
        {
            "2": "Lightly grease a 3-quart rectangle or oval casserole dish. Spread 1/2 of the bread into the prepared dish and top with 1/2 of the chorizo mixture. Repeat with remaining bread and chorizo."
        },
        {
            "3": "Whisk eggs, milk, oregano, and paprika together in a large bowl. Pour egg mixture evenly over bread and sausage. Cover and chill, 8 hours to overnight."
        },
        {
            "4": "Preheat the oven to 325 degrees F (165 degrees C)."
        },
        {
            "5": "Bake in the preheated oven, covered, for 30 minutes. Uncover and bake until an instant-read thermometer pressed into the center reads 170 degrees F (degrees C), 30 to 45 minutes more. Sprinkle with queso fresco during the last 5 minutes of baking. Let stand for 10 minutes and sprinkle with cilantro."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": " 8 hrs 10 mins"
        },
        {
            "Total Time": " 9 hrs 30 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "238"
        },
        {
            "Fat": "11g"
        },
        {
            "Carbs": "21g"
        },
        {
            "Protein": "12g"
        }
    ],
    "Images": [],
    "main category": "breakfast"
}