{
    "title": "Strawberry Malted Milk Meringues",
    "Category": "Cookies",
    "Ingredients": [
        {
            "1": "0.5 cups freeze-dried strawberries (or as needed)"
        },
        {
            "2": "5 large egg whites"
        },
        {
            "3": "0.5 cups sugar"
        },
        {
            "4": "1 dash cream of tartar"
        },
        {
            "5": "2 tablespoons malted milk powder"
        },
        {
            "6": "0.5 teaspoon vanilla extract"
        },
        {
            "7": "1 red gel food coloring (Optional)"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 200 degrees F (95 degrees C). Fit a large round pastry tip in a pastry bag. Set bag, tip side down, in a large, tall cup and fold edges over cup rim for easy filling."
        },
        {
            "2": "Pulverize freeze-dried strawberries in a food processor. Measure out 3 tablespoons strawberry powder. Use any leftovers for dusting the plate or another use."
        },
        {
            "3": "Whisk together egg whites and sugar in a bowl set over a pot of simmering water. Whisk until sugar has dissolved, about 4 minutes. Transfer to a large bowl. Add cream of tartar. Beat with an electric mixer at low speed until mixture starts to foam. Continue beating at high speed until glossy and stiff peaks form (tips stand straight). Fold in 3 tablespoons strawberry powder, milk powder, and vanilla."
        },
        {
            "4": "Paint stripes of red gel food coloring (if using) inside the pastry bag. Carefully fill pastry bag with meringue mixture. Dot corners of a baking sheet with meringue, then line with parchment paper. (The dots will keep the paper in place.)"
        },
        {
            "5": "Pipe quarter-size meringue dollops on the baking sheet, pulling bag straight up and spacing about 1 inch apart."
        },
        {
            "6": "Bake in the preheated oven until meringues are firm and easily peel off the parchment, 60 to 75 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "90 "
        },
        {
            "Yield": "90 meringues"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "16"
        },
        {
            "Carbs": "4g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}