{
    "title": "Autumn Apple Slab Pie",
    "Category": "Slab Pie",
    "Ingredients": [
        {
            "1": "1 Crust-"
        },
        {
            "2": "2.25 cups all-purpose flour"
        },
        {
            "3": "0.5 cups unsalted butter, cut into pieces and frozen"
        },
        {
            "4": "0.75 teaspoon salt"
        },
        {
            "5": "0.5 cup ice water"
        },
        {
            "6": "2 tablespoons ice water, or more if needed"
        },
        {
            "7": "1 tablespoon apple cider vinegar"
        },
        {
            "8": "0.5 teaspoons apple cider vinegar"
        },
        {
            "9": "1 Filling-"
        },
        {
            "10": "10  Paula Red apples - peeled, cored, and cut into 1/8-inch slices"
        },
        {
            "11": "2 small lemons, juiced"
        },
        {
            "12": "0.25 cup all-purpose flour"
        },
        {
            "13": "0.75 cup dark brown sugar"
        },
        {
            "14": "0.5 teaspoons ground cinnamon"
        },
        {
            "15": "1 teaspoon vanilla extract"
        },
        {
            "16": "0.5 teaspoon salt"
        },
        {
            "17": "0.5 teaspoon ground cloves"
        },
        {
            "18": "0.25 teaspoon ground nutmeg"
        },
        {
            "19": "0.25 teaspoon ground allspice"
        },
        {
            "20": "0.75 cup raisins"
        },
        {
            "21": "0.5 cup chopped walnuts"
        },
        {
            "22": "1 large egg"
        },
        {
            "23": "1 tablespoon water"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour, butter, and salt in a food processor. Pulse until mixture resembles coarse crumbs."
        },
        {
            "2": "Stir water and vinegar together in a bowl."
        },
        {
            "3": "Pour 1/2 the water mixture into the flour mixture in the food processor. Pulse to combine. Pour in remaining water mixture and pulse until dough just starts to come together but is still crumbly."
        },
        {
            "4": "Turn dough out onto a wooden surface. Pat into a round shape and cut into 3 equal pieces. Form each into a disc about 5 inches wide, wrap each in plastic wrap, and refrigerate until ready to use."
        },
        {
            "5": "Toss apples and lemon juice together in a bowl. Sprinkle flour over apples and toss to coat. Gently mix in brown sugar, cinnamon, vanilla extract, salt, cloves, nutmeg, and allspice until apples are thoroughly coated. Fold in raisins and walnuts."
        },
        {
            "6": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "7": "Flour a work surface and roll out 2 of the 3 dough pieces into a rectangle about 12x18 inches in size and about 1/4-inch thick. Gently place crust into a 10x15-inch jelly roll pan and press dough into corners. Trim excess dough so there is only 1 inch of overhang on all sides. Gently fold overhanging dough underneath itself and crimp along all edges of the pan. Use a fork to poke indentations sporadically in the bottom of the crust to prevent bubbling."
        },
        {
            "8": "Pour filling into the crust and spread out evenly."
        },
        {
            "9": "Roll out remaining dough piece on a floured surface to 1/4-inch thickness. Use decorative cookie cutters to cut out several pieces of pie dough and place cut-outs on top of filling in a pattern."
        },
        {
            "10": "Beat egg and water together in a bowl. Gently brush egg wash over the edges of the pie crust and on the pie crust cut-outs."
        },
        {
            "11": "Bake in the preheated oven until crust is golden brown and apples are soft when gently pierced with a knife, 55 to 65 minutes. Allow to cool completely before cutting and serving, about 30 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 2 hrs 10 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "403"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "53g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5710079.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pies"
}