{
    "title": "Soft Pretzel Sticks with Honey Mustard Dipping Sauce",
    "Category": "Pretzels",
    "Ingredients": [
        {
            "1": "1 Honey Mustard Dipping Sauce-"
        },
        {
            "2": "0.25 cup mayonnaise"
        },
        {
            "3": "0.25 cup Dijon mustard"
        },
        {
            "4": "0.25 cup honey"
        },
        {
            "5": "1 tablespoon yellow mustard"
        },
        {
            "6": "1 (.25 ounce) package active dry yeast"
        },
        {
            "7": "2 teaspoons brown sugar"
        },
        {
            "8": "1 cup warm water (100 to 110 degrees F)"
        },
        {
            "9": "3 cups all-purpose flour"
        },
        {
            "10": "1 teaspoon salt"
        },
        {
            "11": "2 tablespoons canola oil"
        },
        {
            "12": "5 quarts water"
        },
        {
            "13": "0.25 cup baking soda"
        },
        {
            "14": "2 tablespoons unsalted butter, melted"
        },
        {
            "15": "1 coarse sea salt to taste"
        }
    ],
    "Directions": [
        {
            "1": "Whisk together mayonnaise, Dijon mustard, honey, and yellow mustard in a small bowl, and store in the refrigerator while preparing pretzel sticks."
        },
        {
            "2": "Mix yeast and brown sugar in a small bowl; add warm water, and whisk until sugar dissolves. Let stand until foamy, about 5 minutes."
        },
        {
            "3": "Mix flour and salt together in a bowl of a stand mixer fitted with a dough hook attachment. Add canola oil and gradually pour in the yeast mixture, kneading until smooth and silky, 4 to 5 minutes. If the dough is very sticky, knead in more flour."
        },
        {
            "4": "Shape dough into a ball and transfer to a large greased bowl. Cover with plastic wrap and let rise until doubled in volume, about 45 minutes."
        },
        {
            "5": "Punch down the dough and turn out onto a lightly floured surface. Flatten into a rectangle and cut into 12 equal pieces. Roll each piece into a stick about 7 inches long. Place sticks on a baking sheet lined with parchment paper; let rest uncovered for about 25 minutes."
        },
        {
            "6": "Preheat the oven to 450 degrees F (230 degrees C)."
        },
        {
            "7": "Pour about 5 quarts of water in a large, deep pot; stir in baking soda. Bring to a boil, then reduce heat to medium. Carefully place pretzel sticks in the simmering water in batches for 30 seconds, flipping after 15 seconds. Remove from water and let drain on paper towels."
        },
        {
            "8": "Transfer the sticks back to the baking sheet. Brush lightly with butter and sprinkle with coarse sea salt."
        },
        {
            "9": "Bake in the preheated oven until golden brown, 7 to 10 minutes. Serve warm or at room temperature with the honey mustard dipping sauce."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 1 hrs 15 mins"
        },
        {
            "Total Time": " 1 hrs 50 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 pretzel sticks"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "216"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "32g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F775f5225d2651b5bb1b483c392860ddf%2F6858246.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6761611.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}