{
    "title": "Two-Ingredient Dough Soft Pretzels",
    "Category": "Pretzels",
    "Ingredients": [
        {
            "1": "2 tablespoons baking soda"
        },
        {
            "2": "1 Two-Ingredient Dough-"
        },
        {
            "3": "1 cup self-rising flour, plus more for kneading"
        },
        {
            "4": "1 cup plain Greek yogurt"
        },
        {
            "5": "1 Topping-"
        },
        {
            "6": "3 tablespoons butter, melted"
        },
        {
            "7": "1 teaspoon coarse salt, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Bring 6 cups of water to a low boil in a large pot. Add baking soda."
        },
        {
            "2": "Preheat the oven to 350 degrees F (175 degrees C). Grease a baking sheet."
        },
        {
            "3": "Mix 1 cup flour and Greek yogurt together in a medium bowl until a shaggy dough forms. Transfer to a surface dusted with more self-rising flour, and knead for 8 to 10 minutes. Continue adding flour as needed if the dough is too sticky."
        },
        {
            "4": "Cut the dough into 4 equal pieces. Roll each segment into a long, thin rope, 22 to 24 inches in length. Twist the rope into a pretzel shape by taking the two ends, twisting them around each other, then securing both ends side-by-side onto the center portion of the rope."
        },
        {
            "5": "One by one, carefully drop each pretzel into the water and boil until the pretzel floats to the top, 2 to 3 minutes. Drain on paper towels or a cooling rack."
        },
        {
            "6": "Transfer to the prepared baking sheet."
        },
        {
            "7": "Bake in the preheated oven for 20 minutes. Remove from the oven and increase the oven's temperature to 425 degrees F (220 degrees C). Brush the pretzels with some of the melted butter; continue to bake until golden brown, 4 to 5 minutes more. Brush with remaining butter and top with coarse salt."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 pretzels"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "252"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "25g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fd3918b260f22b655a0666d08f63d600f%2F1655151038Two%2520Ingredient%2520Dough%2520Soft%2520Pretzels%2520RRP.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}