{
    "title": "Lazy Perogies",
    "Category": "Pierogi",
    "Ingredients": [
        {
            "1": "9  uncooked lasagna noodles"
        },
        {
            "2": "4 large baking potatoes, peeled and cut into 1-inch chunks"
        },
        {
            "3": "0.5 cup milk"
        },
        {
            "4": "1 tablespoon butter"
        },
        {
            "5": "1 teaspoon onion salt, or to taste"
        },
        {
            "6": "1 salt and black pepper to taste"
        },
        {
            "7": "1 cup shredded Cheddar cheese"
        },
        {
            "8": "1 pound bacon"
        },
        {
            "9": "1  onion, chopped"
        },
        {
            "10": "2 cups dry cottage cheese"
        },
        {
            "11": "1  egg"
        },
        {
            "12": "1 teaspoon onion salt, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in lasagna noodles 3 or 4 at a time, and return to a boil. Cook noodles, uncovered and stirring occasionally, until cooked through but still firm to the bite, about 10 minutes per batch. Drain well in a colander set in the sink. Lay cooked noodles flat on waxed paper or aluminum foil while you finish cooking remaining noodles."
        },
        {
            "2": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x11-inch baking dish."
        },
        {
            "3": "Place potatoes in a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Using a potato masher, mash potatoes with milk and butter until smooth. Stir in 1 teaspoon onion salt, and season with salt and pepper. Set the mashed potatoes aside to cool. When cooled, mix with shredded Cheddar cheese."
        },
        {
            "4": "Place bacon in a large, deep skillet. Cook over medium-high heat, turning occasionally, until evenly browned and almost crisp, about 10 minutes. Place onion into the hot bacon fat, and cook and stir until onion is translucent, about 8 minutes. Break bacon into pieces with a spoon or spatula. Set bacon and onion aside. Mix cottage cheese, egg, and 1 teaspoon onion salt in a bowl."
        },
        {
            "5": "To make the casserole, place 3 lasagna noodles into the prepared baking dish, and spread with cottage cheese mixture evenly. Top cottage cheese with 3 more lasagna noodles, then spread potato-cheese mixture in a layer. Top potato layer with 3 more noodles, then spread bacon and onion in an even layer on top of the casserole."
        },
        {
            "6": "Cover the casserole with aluminum foil, and bake in the preheated oven until cheese is melted and the casserole is hot, about 30 minutes. Allow to set for about 10 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "1 9x11-inch casserole"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "271"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "28g"
        },
        {
            "Protein": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6636380.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4578547.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1088441.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}