{
    "title": "Gluten-Free Homemade Orecchiette with Rice Semolina",
    "Category": "Homemade Pasta",
    "Ingredients": [
        {
            "1": "0.25 teaspoon salt"
        },
        {
            "2": "0.5 cup warm water, or more as needed"
        },
        {
            "3": "7 ounces rice semolina, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Dissolve salt in warm water in a bowl. Place semolina flour into a separate bowl and add salted water. Mix together until dough becomes a ball you can work with, adding more flour or warm water as needed; mixture should be slightly wet, barely sticking to your hands."
        },
        {
            "2": "Knead dough until slightly more stiff. Wrap in plastic wrap and refrigerate for 30 minutes."
        },
        {
            "3": "Remove dough from the refrigerator and separate into 4 pieces. Use a small amount of semolina flour to dust your work table and work each piece of dough into a cylinder or snake shape. Dust your hands lightly with flour and pinch off a 1-inch piece of dough; make a dent using your thumb while rolling it away from you. Repeat with remaining dough."
        },
        {
            "4": "Let pasta sit for 7 to 8 minutes."
        },
        {
            "5": "Bring a pot of lightly salted water to a boil; place pasta into the boiling water and cook until pasta floats to the top, making sure not to stir, about 8 minutes. Scoop out cooked pasta using a slotted spoon from the water and transfer to a plate."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": "40 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "175"
        },
        {
            "Fat": "2g"
        },
        {
            "Carbs": "38g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2211450.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}