{
    "title": "Homemade Farfalle Pasta",
    "Category": "Homemade Pasta",
    "Ingredients": [
        {
            "1": "1.0 cups durum wheat semolina flour (such as Bob's Red Mill®)"
        },
        {
            "2": "1 pinch salt"
        },
        {
            "3": "1 cup water, or as needed, at room temperature"
        }
    ],
    "Directions": [
        {
            "1": "Mix flour and salt in a large bowl or on a marble work surface. Make a well in the center."
        },
        {
            "2": "Pour water into the well a little at a time, mixing it with the flour. Add as much water as needed to make a sticky but compact dough."
        },
        {
            "3": "Knead dough with your hands by flattening the ball, stretching it, and folding the top towards the center. Turn 45 degrees and repeat until dough is elastic and smooth, but not too soft, about 10 minutes."
        },
        {
            "4": "Shape dough into a ball. Place in a bowl and cover with plastic wrap. Let rest at room temperature for about 30 minutes before using."
        },
        {
            "5": "Cut off 1/3 of the dough. Wrap the remaining dough in plastic wrap to keep it from drying out. Flatten dough with your hands and pass through the largest setting of your pasta machine. Fold in half, rub with more flour, and pass through the pasta machine again."
        },
        {
            "6": "Keep passing though the machine until you reach an even rectangular sheet of smooth, not sticky, consistency."
        },
        {
            "7": "Pass the dough through the middle setting of your machine and then through the second-to-last to make a long and thin sheet. Trim the sheet into an even rectangle and rub with more flour."
        },
        {
            "8": "Trim off the short edge of the rectangle with a decorative ravioli wheel cutter. Trim the rectangle into strips, about 3/4 inch wide, with a flat ravioli wheel cutter. Section the strips into 1 1/3-inch large pieces with the decorative cutter."
        },
        {
            "9": "Push the sides of each piece towards the centre to form a bow tie and secure with a little dab of water."
        },
        {
            "10": "Proceed the same way with the rest of the dough. Transfer the farfalle to a floured surface and sprinkle with more semolina flour. Do not overlap or they will stick. Let dry for about 30 minutes before cooking."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "1 pound farfalle pasta"
        }
    ],
    "Nutrition Facts": [],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8246677.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8155831.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://www.allrecipes.com/thmb/Cad1bULIYPTMeDPKcYta_T7aE8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-63-7faa915a8a804c8d9ed1279ed75192a5.jpg"
        }
    ],
    "main category": "carbs"
}