{
    "title": "Homemade Cavatelli Pasta",
    "Category": "Homemade Pasta",
    "Ingredients": [
        {
            "1": "0.5 cups durum wheat semolina flour (such as Bob's Red Mill®)"
        },
        {
            "2": "1 pinch salt"
        },
        {
            "3": "1 cup water, or as needed, at room temperature"
        }
    ],
    "Directions": [
        {
            "1": "Mix semolina flour and salt in a large bowl or on a marble work surface. Make a well in the center."
        },
        {
            "2": "Pour water into the well a little at a time, mixing it with flour. Add as much water as needed to make a sticky but compact dough."
        },
        {
            "3": "Knead dough with your hands by flattening the ball, stretching it, and folding top toward center. Turn 45 degrees and repeat until dough is elastic and smooth, but not too soft, about 10 minutes."
        },
        {
            "4": "Shape dough into a ball. Place in a bowl and cover with plastic wrap. Let rest at room temperature for about 30 minutes before using. If you are using cavatelli within a few hours or the following day, wrap in plastic wrap and chill in the refrigerator."
        },
        {
            "5": "Work with one portion of dough at a time, keeping remaining dough covered to keep it from drying out. Dust a work surface with semolina flour; roll out dough to make a rope, about 1/3 inch thick."
        },
        {
            "6": "Cut off little 1/3-inch-thick pieces. Press and gently drag a small piece of dough toward you with your index and middle finger. The two sides will curl inwards, leaving hollow spaces."
        },
        {
            "7": "Proceed the same way with rest of dough. Transfer cavatelli to a floured surface and sprinkle with more semolina flour. Do not overlap cavatelli or they will stick together. Let dry for about 30 minutes before cooking."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "338"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "68g"
        },
        {
            "Protein": "12g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9109736.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8266263.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}