{
    "title": "Spinach and Ricotta Tortellini",
    "Category": "Homemade Pasta",
    "Ingredients": [
        {
            "1": "10 cups fresh spinach, trimmed"
        },
        {
            "2": "2 tablespoons water"
        },
        {
            "3": "1 salt and ground black pepper to taste"
        },
        {
            "4": "0.25 cups ricotta cheese"
        },
        {
            "5": "0.25 cups grated Parmesan cheese"
        },
        {
            "6": "1  egg"
        },
        {
            "7": "1 pinch nutmeg"
        },
        {
            "8": "2 pounds fresh spinach pasta dough"
        },
        {
            "9": "2 tablespoons all-purpose flour, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Place spinach, water, and a pinch of salt in a pot over medium-high heat; cover pot and cook until spinach is completely wilted, 2 to 3 minutes. Drain and squeeze out all the water; let spinach cool to room temperature in a colander."
        },
        {
            "2": "Soften ricotta cheese in a large bowl using a fork until creamy."
        },
        {
            "3": "Squeeze out any excess water from the cooled spinach. Finely chop spinach with a knife or process in a blender. Transfer to the bowl with ricotta. Add Parmesan cheese, egg, nutmeg, salt, and pepper; mix well."
        },
        {
            "4": "Divide pasta dough into 6 equal pieces. Take 1 piece and cover the rest with plastic wrap. Flatten the piece between your palms and press through the widest setting of your pasta machine. Sprinkle flour over flattened pasta dough, fold in half lengthwise, and run through the pasta machine again. Repeat this process 3 or 4 times, always flouring, folding, and passing through the widest setting until dough is smooth and even in size."
        },
        {
            "5": "Change pasta machine to the middle setting and pass dough through. Move pasta machine setting to the next to the last setting and pass dough through. Cut the sheet in half, widthwise. Pass each half through the pasta machine in the thinnest and last setting, creating 2 long and very thin sheets; gently transfer to a floured work surface, trimming edges. Cut into 2 even rectangles."
        },
        {
            "6": "Cut dough into 1 1/2-inch squares. Drop a teaspoon of ricotta filling in the middle of each square. Brush the edges with water and fold over diagonally into a triangle shape. Press well to squeeze out any air. Stretch the 2 ends of the triangle and a fold them together, wrapping them around your finger; seal. Gently fold back the top corner."
        },
        {
            "7": "Transfer the tortellini to a floured plate or work surface. Proceed the same way with remaining dough and filling. Let tortellini stand for 30 minutes."
        },
        {
            "8": "Bring a pot of generously salted water to a boil; cook tortellini, working in batches, until they float, 6 to 7 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "13 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 43 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "167"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "26g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8905972.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8909985.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5264612.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4500997.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/Muu1n90jTtnVAmp0ANj190y_4hc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/5264612-0a0b6180ec37452d91107b7a9a06f3af.jpg"
        }
    ],
    "main category": "carbs"
}