{
    "title": "Air Fryer Chicken Kiev",
    "Category": "Air Fryer Recipes",
    "Ingredients": [
        {
            "1": "4 tablespoons butter, softened"
        },
        {
            "2": "2 tablespoons chopped fresh flat-leaf parsley"
        },
        {
            "3": "1 clove garlic, minced"
        },
        {
            "4": "1 teaspoon salt"
        },
        {
            "5": "2 (8 ounce) skinless, boneless chicken breast halves, pounded to 1/4-inch thickness"
        },
        {
            "6": "1 salt and ground black pepper to taste"
        },
        {
            "7": "0.5 cup all-purpose flour"
        },
        {
            "8": "1 large egg, beaten"
        },
        {
            "9": "1 cup panko bread crumbs"
        },
        {
            "10": "1 teaspoon paprika"
        },
        {
            "11": "1 nonstick cooking spray"
        }
    ],
    "Directions": [
        {
            "1": "Mix butter, parsley, garlic, and 1 teaspoon salt together in a bowl until thoroughly blended. Shape herbed butter into two equal balls. Place balls onto a baking sheet and freeze for 10 minutes."
        },
        {
            "2": "Place chicken onto a clean work surface; season both sides with salt and pepper. Place one chilled butter ball in the center of each chicken breast. Pull chicken sides up around butter mixture into a ball; cover each ball with plastic wrap and twist to secure. Place onto the baking sheet and freeze for 30 minutes."
        },
        {
            "3": "Preheat an air fryer to 400 degrees F (200 degrees C)."
        },
        {
            "4": "Set out three shallow bowls for breading. Place flour into the first bowl and egg into the second bowl. Mix panko and paprika together in the third bowl. Dredge each chicken breast in flour, then in beaten egg, and finally in panko mixture."
        },
        {
            "5": "Place breaded chicken into the air fryer basket. Spray each breast with nonstick spray."
        },
        {
            "6": "Air-fry for 5 minutes. Spray with nonstick spray again and cook until chicken is no longer pink in the center and the juices run clear, about 5 more minutes. An instant-read thermometer inserted into the chicken should read at least 165 degrees F (74 degrees C)."
        },
        {
            "7": "Transfer chicken to a cutting board and let rest for 5 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "2 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "783"
        },
        {
            "Fat": "35g"
        },
        {
            "Carbs": "64g"
        },
        {
            "Protein": "64g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7737441.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}