{
    "title": "Corned Beef and Cabbage Shepherd's Pie",
    "Category": "St. Patrick's Day Recipes",
    "Ingredients": [
        {
            "1": "1 (4 pound) corned beef brisket with spice packet"
        },
        {
            "2": "1 medium yellow onion, thickly sliced"
        },
        {
            "3": "2 stalks celery, cut into 1-inch pieces"
        },
        {
            "4": "3 quarts cold water, or as needed to cover"
        },
        {
            "5": "1 kosher salt to taste"
        },
        {
            "6": "2 small heads Savoy cabbage, cored and cut into 2-inch pieces"
        },
        {
            "7": "3 medium carrots, thickly sliced"
        },
        {
            "8": "5 large russet potatoes, quartered"
        },
        {
            "9": "0.5 cup unsalted butter, cut into slices"
        },
        {
            "10": "1 freshly ground black pepper to taste"
        },
        {
            "11": "1 pinch cayenne pepper, or to taste"
        },
        {
            "12": "1 cup milk"
        },
        {
            "13": "0.75 cup grated Irish Cheddar cheese, plus more to taste"
        },
        {
            "14": "1 tablespoon chopped scallions, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Put corned beef in a pot with onion and celery and sprinkle spice packet over top. Pour in cold water to cover. Turn heat to high and bring to a boil. Skim off and discard any foam if desired. Once boiling, reduce heat to low, cover, and simmer gently until tender, about 3 1/2 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."
        },
        {
            "2": "Carefully remove corned beef to a bowl and let cool. Taste broth and add salt if needed."
        },
        {
            "3": "Bring broth to a boil over high heat. Add cabbage to the boiling broth. Cook until cabbage just starts to soften and sweeten up, about 5 minutes. Use a slotted spoon and remove cabbage to a bowl."
        },
        {
            "4": "Add carrots to the boiling broth. Cook until carrots start to soften, about 5 minutes. Use a slotted spoon and remove carrots to a bowl."
        },
        {
            "5": "Add potatoes to the boiling broth and reduce heat to medium. Cook until tender, 15 to 20 minutes."
        },
        {
            "6": "While the potatoes are cooking, slice the cooled corned beef along the fatty seam to separate into 2 pieces. Identify the direction of the meat fibers and cut across them (against the grain) to slice into 1/4-inch thick slices, trimming off and discarding any giant pieces of fat. Set aside."
        },
        {
            "7": "Preheat the oven to 400 degrees F (200 degrees C). Butter a 9x15-inch casserole dish."
        },
        {
            "8": "Use a slotted spoon and remove cooked potatoes to a bowl. Reserve broth. Add butter, salt, pepper, cayenne, and milk to the potatoes. Mix and mash until very smooth. Toss in 3/4 cup Cheddar cheese and mix until incorporated."
        },
        {
            "9": "Pour cabbage into the prepared casserole dish and press on it until nicely compacted. Evenly distribute and press carrots over the cabbage. Place a nice, even layer of corned beef on top, overlapping a bit and distributing the nice fatty pieces evenly until fully covered. Pour in 1 cup of the reserved broth. Dollop mashed potatoes over top, then spread into a uniform layer with the back of a spatula. Switch to a fork and push potatoes to the edge of the dish. Then drag the fork sideways back and forth over the potatoes to create a texture. Repeat this texture going top to bottom over the potatoes. Sprinkle with a little more Cheddar."
        },
        {
            "10": "Bake in the center of the preheated oven until beautifully browned and piping hot, 45 minutes to 1 hour."
        },
        {
            "11": "Remove from the oven and let rest for 10 minutes."
        },
        {
            "12": "Meanwhile, warm any remaining broth over medium-low heat."
        },
        {
            "13": "Cut Shepherd's pie into squares and garnish with scallions. Serve with warmed broth."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": " 4 hrs 50 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 5 hrs 40 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "664"
        },
        {
            "Fat": "35g"
        },
        {
            "Carbs": "59g"
        },
        {
            "Protein": "31g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fffa77d6a80258e6fc7aa53e0582cd229%2F1655248685IMG_20220614_173925085.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fffa77d6a80258e6fc7aa53e0582cd229%2F1648984961St%2520Pat.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fffa77d6a80258e6fc7aa53e0582cd229%2F164756508235FEAD62-ACA2-4334-B489-70A49931A1A9.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9112280.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/m_A5MIU7IfMbdUr3QmMiYElNrM0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9088901_corned-beef-and-cabbage-shepherds-pie_chef-john-2000-ea62e12a905c403b83fb2ee49e63deef.jpg"
        },
        {
            "img6": "https://www.allrecipes.com/thmb/wwThZYpCyv-SFiSFKJDgxlFQ3DY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-280-f6bee5f98af74c6f9b4d93275af58a90.jpg"
        }
    ],
    "main category": "holidays_and_traditional_food"
}