{
    "title": "Pumpkin Pie with Maple Mascarpone Swirl",
    "Category": "Desserts",
    "Ingredients": [
        {
            "1": "1 Pumpkin Pie Base-"
        },
        {
            "2": "1 (9 inch) unbaked pie crust"
        },
        {
            "3": "1 (15 ounce) can pumpkin puree"
        },
        {
            "4": "1 (14 ounce) can sweetened condensed milk"
        },
        {
            "5": "2 large eggs"
        },
        {
            "6": "1 teaspoon pumpkin pie spice"
        },
        {
            "7": "1 Cheesecake Swirl-"
        },
        {
            "8": "6 ounces mascarpone cheese"
        },
        {
            "9": "3 tablespoons whole milk"
        },
        {
            "10": "2 tablespoons maple syrup"
        },
        {
            "11": "1 tablespoon all-purpose flour"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 425 degrees F (220 degrees C). Fit pie crust into a 9-inch pie dish and place it on a baking sheet."
        },
        {
            "2": "Combine pumpkin puree, condensed milk, eggs, and pumpkin pie spice in a large bowl. Mix until combined and set aside."
        },
        {
            "3": "Make the cheesecake swirl: In a medium, microwave-safe bowl stir together mascarpone, milk, maple syrup, and flour. Microwave on high power until the cheese is completely melted, 20 to 30 seconds. Stir the mixture until completely smooth. (This will make swirling easier.)"
        },
        {
            "4": "Add about two-thirds of the cheese mixture into the pumpkin filling and stir to combine. Pour the pumpkin filling into the pie shell. Spoon the remaining mascarpone mixture on top in about 10 or so dollops. Use a thin knife or toothpick to swirl the cheesecake dollops into the pumpkin pie filling to create a swirl pattern."
        },
        {
            "5": "Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and continue to bake until filling is set around the sides but jiggles like jello in the center, erring on the side of undercooking as the pie continues to cook as it cools, 30 to 35 minutes. Turn the oven off, open the oven door, and let cool for one hour in the oven before transferring into the fridge to cool completely."
        },
        {
            "6": "Remove from the oven, set on a wire rack, and cool completely before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Bake Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 pumpkin pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "261"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/44LCBUGu1Ry-fEgfb25lHZB0Rsw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Maple-Mascarpone-4x3-02-13922529a0eb4fbc85493d70416a7b4f.jpg"
        }
    ],
    "main category": "snacks_&_sweets"
}