{
    "title": "Sable Cookies",
    "Category": "Desserts",
    "Ingredients": [
        {
            "1": "2 cups all-purpose flour, plus more for work surface"
        },
        {
            "2": "0.75 cup powdered sugar"
        },
        {
            "3": "0.5 teaspoon fine sea salt"
        },
        {
            "4": "0.75 cup cold unsalted butter, cubed"
        },
        {
            "5": "2 large egg yolks"
        },
        {
            "6": "1 teaspoon vanilla extract"
        },
        {
            "7": "1 teaspoon water"
        },
        {
            "8": "1 large egg white"
        },
        {
            "9": "1 sanding sugar"
        }
    ],
    "Directions": [
        {
            "1": "Pulse flour, powdered sugar, and salt together in a food processor until just combined, about 5 times. Add butter to processor, and pulse until mixture is crumbly, about 12 times. Add egg yolks and vanilla, and process until dough begins to clump together, about 30 seconds. Shape dough into a disc about 1 inch thick; wrap in plastic wrap, and refrigerate until firm, at least 30 minutes or up to 2 days."
        },
        {
            "2": "Preheat oven to 350 degrees F (175 degrees C). Position racks in the upper and lower thirds of oven. Line 2 baking sheets with parchment paper."
        },
        {
            "3": "Roll out dough on a floured surface to 1/4-inch thickness. Using a 2 1/2-inch fluted, round cookie cutter, cut as many cookies as you can from dough. Re-roll dough as needed. Place cookies 1 1/2 inches apart on the prepared pans."
        },
        {
            "4": "Stir 1 teaspoon water and egg white together in a small bowl until combined. Lightly brush over cookies, and sprinkle generously with sanding sugar."
        },
        {
            "5": "Bake in the preheated oven in upper and lower thirds, 2 baking sheets at a time, rotating top to bottom and bottom to top, halfway through, until set and lightly golden around edges, 12 to 14 minutes. Let cool completely on baking sheets, about 15 minutes. Can be stored for up to one week in an airtight resealable container."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Bake Time": "12 mins"
        },
        {
            "Cool Time": "15 mins"
        },
        {
            "Total Time": "47 mins"
        },
        {
            "Servings": "18 "
        },
        {
            "Yield": "18 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "145"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "16g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}