{
    "title": "Simple and Creamy Spanish Flan",
    "Category": "Flan",
    "Ingredients": [
        {
            "1": "1 cup boiling water, or as needed"
        },
        {
            "2": "0.75 cup white sugar, divided"
        },
        {
            "3": "1 teaspoon water"
        },
        {
            "4": "6 large egg yolks"
        },
        {
            "5": "1 (14 ounce) can sweetened condensed milk"
        },
        {
            "6": "1 (13 ounce) can evaporated milk"
        },
        {
            "7": "1 teaspoon vanilla extract"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 325 degrees F (165 degrees C). Place a 9-inch metal pie dish into a deep baking pan; pour boiling water into the baking pan to reach about halfway up the sides of the pie dish to make a water bath."
        },
        {
            "2": "Pour 1/2 cup sugar and 1 teaspoon water into a heavy saucepan over medium heat. Gently swirl mixture in the pan until sugar dissolves, melts, and turns into a golden-brown caramel syrup, about 10 minutes. Watch carefully, as sugar burns easily. Pour melted caramel into the warmed pie dish; gently tilt the dish to coat the bottom with caramel."
        },
        {
            "3": "Whisk egg yolks, condensed milk, evaporated milk, remaining 1/4 cup sugar, and vanilla in a bowl until creamy and thoroughly combined. If mixture is foamy, skim foam off with a folded paper towel. Gently pour custard over caramel in the pie dish. Cover the baking pan with aluminum foil."
        },
        {
            "4": "Bake in the preheated oven until custard is set but jiggles slightly when nudged, 45 minutes to 1 hour. Remove foil and place flan with the water bath in the refrigerator until chilled, about 2 hours."
        },
        {
            "5": "Remove the pie dish from the water bath; run a knife around the edges of flan. Invert flan onto a rimmed serving platter to release custard; let caramel sauce flow over flan."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Additional Time": " 2 hrs"
        },
        {
            "Total Time": " 3 hrs 10 mins"
        },
        {
            "Servings": "8 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "332"
        },
        {
            "Fat": "11g"
        },
        {
            "Carbs": "51g"
        },
        {
            "Protein": "9g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6535233.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3371246.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}