{
    "title": "Instant Pot® Harissa Hummus",
    "Category": "Hummus",
    "Ingredients": [
        {
            "1": "1 cup dry chickpeas (garbanzo beans)"
        },
        {
            "2": "2 cups water"
        },
        {
            "3": "1 cup low-sodium vegetable broth"
        },
        {
            "4": "3 tablespoons extra-virgin olive oil , divided"
        },
        {
            "5": "2 tablespoons tahini"
        },
        {
            "6": "1 tablespoon lemon juice"
        },
        {
            "7": "1 large clove garlic"
        },
        {
            "8": "6 teaspoons harissa paste, divided"
        },
        {
            "9": "0.5 teaspoon salt, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Soak chickpeas in water for about 2 hours, rubbing occasionally while soaking to help remove the outer skin. Discard any skins that come loose. Drain chickpeas."
        },
        {
            "2": "Combine chickpeas, water, and vegetable broth in a multi-functional pressure cooker (such as Instant Pot®). Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "3": "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid."
        },
        {
            "4": "Strain chickpeas, reserving 3/4 cup of cooking liquid. Set aside 1/4 cup cooked chickpeas for garnish and transfer remaining chickpeas into the bowl of a food processor fitted with a blade. Add 2 tablespoons olive oil, tahini, lemon juice, and garlic. Blend until smooth, about 3 minutes, scraping down the sides. Add 1/2 cup of the reserved cooking liquid. Blend until creamy adding more liquid if necessary. Mix in 5 teaspoons harissa paste and salt."
        },
        {
            "5": "Scrape hummus into a bowl. Drizzle remaining 1 tablespoon olive oil and 1 teaspoon harissa paste and swirl with a knife, but do not mix in completely. Sprinkle with the reserved, whole chickpeas. Serve at room temperature."
        }
    ],
    "Details": [
        {
            "Prep Time": "5 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 2 hrs"
        },
        {
            "Total Time": " 2 hrs 35 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "165"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "17g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7186595.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "side_dishes"
}