{
    "title": "Air Fryer Calzones With Two-Ingredient Dough",
    "Category": "Calzones",
    "Ingredients": [
        {
            "1": "1 Two Ingredient Dough-"
        },
        {
            "2": "0.5 cups all-purpose flour"
        },
        {
            "3": "1 cup whole-milk plain Greek yogurt"
        },
        {
            "4": "1 Filling-"
        },
        {
            "5": "0.25 cup pizza sauce, or as needed"
        },
        {
            "6": "1 cup shredded mozzarella cheese"
        },
        {
            "7": "16 slices pepperoni"
        },
        {
            "8": "1 tablespoon grated Parmesan cheese, or to taste"
        },
        {
            "9": "1 nonstick cooking spray"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour and yogurt together in a bowl to form a soft dough."
        },
        {
            "2": "Transfer to a lightly floured work surface. Roll out into a large circle, about 1/4 to 1/8 inch thick. Use a cereal bowl (or any other smaller bowl), coat the rim with flour, and press down into the dough to cut out 4 circles."
        },
        {
            "3": "Spread pizza sauce on the bottom half of each circle, leaving about 1/16th inch of rim space. Sprinkle sauce with mozzarella cheese, then top cheese with 4 slices of pepperoni."
        },
        {
            "4": "Fold the top half of the circle over, forming a half circle. Press the edges together to seal. Using the tines of a fork, crimp all the way around the sealed edges of each half circle."
        },
        {
            "5": "Spray each calzone with cooking spray and sprinkle Parmesan cheese on top."
        },
        {
            "6": "Set an air fryer to 350 degrees F (175 degrees C). Spray air fryer basket with cooking spray. Set calzones into the air fryer basket."
        },
        {
            "7": "Air-fry for 5 minutes, flip calzones, and cook until lightly browned, 4 to 5 minutes. Depending on the size of your air fryer you might need to work in batches."
        },
        {
            "8": "Check calzones for color and air-fry them for few more minutes if necessary. Remove and allow to cool a few minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Total Time": "25 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 calzones"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "354"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "40g"
        },
        {
            "Protein": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F53cfa9cecf556749fcbd4d4aa8d9b974%2F1655337406Air%2520Fryer%2520Calzones%2520With%2520Two-Ingredient%2520Dough.jpg"
        }
    ],
    "main category": "carbs"
}