{
    "title": "Instant Pot® Chicken Tinga Tostadas",
    "Category": "Tostadas",
    "Ingredients": [
        {
            "1": "2  dried ancho chile peppers"
        },
        {
            "2": "2 large tomatoes, cored"
        },
        {
            "3": "4 teaspoons olive oil, divided"
        },
        {
            "4": "1 medium roasted red pepper"
        },
        {
            "5": "1 medium onion, finely chopped, divided"
        },
        {
            "6": "4 cloves garlic, whole"
        },
        {
            "7": "1 teaspoon dried oregano"
        },
        {
            "8": "0.5 teaspoon ground cumin"
        },
        {
            "9": "2 cloves garlic, minced"
        },
        {
            "10": "3 (5 ounce) skinless, boneless chicken breast halves"
        },
        {
            "11": "1 salt and ground black pepper to taste"
        },
        {
            "12": "4  crispy tostada shells"
        }
    ],
    "Directions": [
        {
            "1": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler to low."
        },
        {
            "2": "Stem and seed chile peppers. Place peppers in a bowl and cover with boiling water. Soak for 10 minutes. Drain, reserving 1/2 cup soaking water."
        },
        {
            "3": "Rub tomatoes with 1 teaspoon oil and place in a baking dish."
        },
        {
            "4": "Broil tomatoes in the preheated oven until they are starting to split and sizzle, 5 to 7 minutes. Remove from the oven."
        },
        {
            "5": "Place chile peppers, reserved soaking water, tomatoes, roasted red pepper, 1/2 of the onion, whole garlic cloves, oregano, and cumin in a blender. Blend on medium or high speed until very smooth."
        },
        {
            "6": "Turn on a multi-functional pressure cooker (such as Instant Pot®), add remaining 3 teaspoons oil, and select Saute function. Add remaining onion and saute until tender and starting to turn brown, 2 to 3 minutes. Add minced garlic and saute for 1 minute. Pour in blended sauce. Add chicken, ensuring it is covered by the sauce. Cancel Saute function."
        },
        {
            "7": "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 18 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "8": "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid."
        },
        {
            "9": "Select Saute function. Shred chicken and cook until sauce is thick and combined with meat, about 10 minutes. Season with salt and pepper."
        },
        {
            "10": "Serve on tostada shells."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 tostadas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "267"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "24g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}