{
    "title": "Air Fryer Chicken Piccata with Lemon-Caper Sauce",
    "Category": "Chicken Piccata",
    "Ingredients": [
        {
            "1": "1 Lemon-Caper Sauce-"
        },
        {
            "2": "4 tablespoons unsalted butter"
        },
        {
            "3": "4 cloves garlic, minced"
        },
        {
            "4": "2 tablespoons all-purpose flour"
        },
        {
            "5": "0.5 cup chicken broth"
        },
        {
            "6": "0.5 cup dry white wine"
        },
        {
            "7": "0.25 cup fresh lemon juice"
        },
        {
            "8": "2 tablespoons capers, drained"
        },
        {
            "9": "1 tablespoon finely chopped fresh parsley"
        },
        {
            "10": "1 teaspoon lemon zest"
        },
        {
            "11": "0.5 teaspoon kosher salt"
        },
        {
            "12": "0.25 teaspoon black pepper"
        },
        {
            "13": "1 Chicken Piccata-"
        },
        {
            "14": "1 nonstick cooking spray"
        },
        {
            "15": "2 (8 ounce) skinless, boneless chicken breast halves"
        },
        {
            "16": "0.5 cup all-purpose flour"
        },
        {
            "17": "1 large egg"
        },
        {
            "18": "1 tablespoon fresh lemon juice"
        },
        {
            "19": "1 tablespoon freshly grated Parmesan cheese"
        },
        {
            "20": "1 tablespoon freshly grated Asiago cheese"
        },
        {
            "21": "1 tablespoon freshly grated Pecorino Romano cheese"
        },
        {
            "22": "1 cup seasoned bread crumbs"
        },
        {
            "23": "0.5 teaspoons ground black pepper"
        },
        {
            "24": "1 teaspoon kosher salt"
        }
    ],
    "Directions": [
        {
            "1": "Prepare the lemon-caper sauce: Melt butter in a small saucepan over medium heat. Add garlic and cook, stirring occasionally, until aromatic, about 1 minute. Whisk in flour and cook, whisking constantly, until slightly thickened, about 2 minutes."
        },
        {
            "2": "Whisk in chicken broth, white wine, and lemon juice and bring to a boil. Remove saucepan from heat and whisk in capers, parsley, lemon zest, salt, and pepper. Cover to keep warm until ready to use and gently whisk before serving."
        },
        {
            "3": "Prepare chicken: Preheat an air fryer to 400 degrees F (200 degrees C) according to manufacturer's instructions for 10 minutes. Lightly coat the air fryer basket with nonstick spray."
        },
        {
            "4": "Cut each chicken breast in half crosswise. Line a large cutting board with plastic wrap and place chicken breast halves on the cutting board; cover chicken breasts with plastic wrap. Pound each chicken breast half until 1/2-inch thick."
        },
        {
            "5": "Place flour in a medium bowl. Whisk together egg and lemon juice in a second medium bowl. Stir together bread crumbs and cheeses in a third medium bowl. Sprinkle chicken breast halves evenly with pepper and salt."
        },
        {
            "6": "Working in batches, dredge a piece of chicken in flour until well coated. Transfer to the egg mixture and gently toss to coat, then place in the bread crumb mixture and toss again to coat. Transfer to a sheet pan. Repeat process until all chicken has been breaded."
        },
        {
            "7": "Place 2 pieces of breaded chicken in the prepared fryer basket. Spray the top side with nonstick spray, and cook until golden brown, crispy, and a thermometer inserted into thickest portion registers 165 degrees F (74 degrees C), 8 to 10 minutes. Halfway through cook time, flip chicken pieces and spray the top again. Transfer to a platter and repeat to cook remaining chicken."
        },
        {
            "8": "Drizzle with lemon-caper sauce and serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "491"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "40g"
        },
        {
            "Protein": "34g"
        }
    ],
    "Images": [],
    "main category": "meat_&_chicken"
}