{
    "title": "Baked Chicken Piccata",
    "Category": "Chicken Piccata",
    "Ingredients": [
        {
            "1": "1 gallon lukewarm water"
        },
        {
            "2": "0.25 cup kosher salt"
        },
        {
            "3": "8  chicken cutlets"
        },
        {
            "4": "1 salt and pepper to taste"
        },
        {
            "5": "1 cup all-purpose flour"
        },
        {
            "6": "8 tablespoons unsalted butter, divided"
        },
        {
            "7": "4 tablespoons extra virgin olive oil"
        },
        {
            "8": "1 cup chicken stock"
        },
        {
            "9": "2 large lemons, juiced"
        },
        {
            "10": "1.5 ounces capers, drained"
        },
        {
            "11": "1 clove garlic, minced"
        },
        {
            "12": "1 tablespoon chopped fresh parsley"
        }
    ],
    "Directions": [
        {
            "1": "For the brine: Combine lukewarm water and salt in a large bowl, stirring until the salt dissolves. Add chicken cutlets and let stand at room temperature for 15 minutes. Remove chicken and pat dry, discarding brine."
        },
        {
            "2": "Season each cutlet with salt and pepper, then dredge in flour; shake off any excess flour. Place seasoned and floured cutlets on a plate."
        },
        {
            "3": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 9 x 13-inch baking dish."
        },
        {
            "4": "Heat half the butter and olive oil in a large skillet over medium high-heat until butter is melted and oil is shimmering. Add 4 floured cutlets and cook until browned, about 3 minutes per side. Transfer to the prepared baking dish. Repeat with the remaining cutlets."
        },
        {
            "5": "Bake chicken cutlets in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        },
        {
            "6": "While chicken bakes, heat the original skillet over medium-high heat for the sauce. Stir in chicken stock, lemon juice, and capers, scraping up any browned bits from the bottom of the skillet. Season with garlic, salt, and pepper. Stir in remaining 4 tablespoons butter, 1 tablespoon at a time, and cook, stirring constantly, until a spoonable consistency is reached, about 4 minutes."
        },
        {
            "7": "Drizzle sauce over the baked chicken to serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "433"
        },
        {
            "Fat": "28g"
        },
        {
            "Carbs": "21g"
        },
        {
            "Protein": "27g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6635624.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}