{
    "title": "Oven-Baked Chicken Piccata",
    "Category": "Chicken Piccata",
    "Ingredients": [
        {
            "1": "0.25 cup butter"
        },
        {
            "2": "0.5 cup all-purpose flour"
        },
        {
            "3": "0.25 cup grated Parmesan cheese"
        },
        {
            "4": "1 teaspoon cantanzaro herbs (such as Savory Spice Shop®)"
        },
        {
            "5": "1 teaspoon garlic salt, divided"
        },
        {
            "6": "1 pound boneless, skinless chicken breasts, sliced horizontally"
        },
        {
            "7": "0.5 teaspoon black pepper"
        },
        {
            "8": "0.5 cup chicken bone broth"
        },
        {
            "9": "0.25 cup lemon juice, or to taste"
        },
        {
            "10": "2 tablespoons capers"
        },
        {
            "11": "0.25 cup dry white wine, such as Pinot Grigio"
        },
        {
            "12": "1  lemon, sliced (Optional)"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 400 degrees F (200 degrees C). Add butter to a large cast iron skillet and place into the oven to allow butter to melt - careful not to burn the butter."
        },
        {
            "2": "In a shallow dish combine flour, Parmesan cheese, cantanzaro herbs, and 1/2 teaspoon garlic salt. Mix to combine."
        },
        {
            "3": "Season chicken with remaining 1/2 teaspoon garlic salt and black pepper. Dredge in the flour mixture to coat evenly."
        },
        {
            "4": "Carefully remove the skillet from the oven using oven mitts and mix bone broth and lemon juice into the melted butter. Place the flour-seasoned chicken breasts in the skillet and sprinkle with capers. Spoon some of the melted mutter mixture over the chicken."
        },
        {
            "5": "Return skillet to the oven and bake until chicken is no longer pink in the center and the juices run clear, 25 to 30 minutes. If the skillet liquid evaporates too quickly, add additional bone broth and lemon juice."
        },
        {
            "6": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Carefully pour wine into the bottom of the skillet. Broil chicken until lightly browned on top. Spoon the sauce over the chicken. Garnish with lemon slices."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "334"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "18g"
        },
        {
            "Protein": "28g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6640312.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}