{
    "title": "Baked Gnocchi with Sage and Cheese",
    "Category": "Gnocchi",
    "Ingredients": [
        {
            "1": "1 Gnocchi-"
        },
        {
            "2": "2 pounds Yukon Gold potatoes, cut into large pieces"
        },
        {
            "3": "2 teaspoons salt, divided"
        },
        {
            "4": "0.5 cups all-purpose flour, or more as needed"
        },
        {
            "5": "1 Cheese Sauce-"
        },
        {
            "6": "4 tablespoons unsalted butter"
        },
        {
            "7": "4 tablespoons all-purpose flour"
        },
        {
            "8": "2 cups chicken stock, warmed"
        },
        {
            "9": "1 cup grated Fontina cheese"
        },
        {
            "10": "1 cup grated Parmesan cheese"
        },
        {
            "11": "6  fresh sage leaves, finely chopped"
        },
        {
            "12": "1 pinch freshly ground nutmeg"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Fill a large saucepan with water. Add potatoes and 1 teaspoon salt; bring to a boil. Continue to boil until potatoes are very soft, about 15 minutes. Drain and run through a food mill or a ricer for a nice, smooth consistency. Place potatoes in a bowl and refrigerate until they are cool, 15 to 20 minutes; this will help keep them fluffy."
        },
        {
            "3": "Dust 2 sheet pans with flour and set aside."
        },
        {
            "4": "Mix cooled potatoes and 1 1/2 cups flour together on a clean work surface. Knead until dough is soft and smooth, 4 to 5 minutes, adding only enough flour so dough comes together and is not tacky."
        },
        {
            "5": "Cut dough into 4 equal parts. Roll 1/4 of the dough into a 3/4-inch log. Cut the log into 3/4-inch pieces. Roll the pieces over a gnocchi board or the back of a fork to create ridges and place onto a floured sheet pan in a single layer. Repeat with the rest of the dough. Let rolled gnocchi dry for 1 hour before cooking."
        },
        {
            "6": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "7": "Bring a large pot of lightly salted water to a boil. Cook gnocchi in the boiling water until they float to the top, 2 to 4 minutes. Drain and set aside."
        },
        {
            "8": "Melt butter for cheese sauce in a medium saucepan over medium heat. Whisk in flour until golden brown, about 3 minutes. Add chicken stock and continue to whisk until it thickens, about 3 minutes. Add Fontina cheese and Parmesan cheese; stir using a spoon until melted. Stir in sage and nutmeg. Stir in cooked gnocchi and transfer to a casserole or baking dish."
        },
        {
            "9": "Bake in the preheated oven until top is golden brown and bubbly, 15 to 20 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": " 1 hrs 15 mins"
        },
        {
            "Total Time": " 2 hrs 35 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "468"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "56g"
        },
        {
            "Protein": "18g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8646140.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}