{
    "title": "Beef Teriyaki Noodles",
    "Category": "Chicken Teriyaki",
    "Ingredients": [
        {
            "1": "1 (8 ounce) package vermicelli pasta"
        },
        {
            "2": "2 tablespoons vegetable oil, divided"
        },
        {
            "3": "2 medium zucchini, diced"
        },
        {
            "4": "1 medium yellow onion, thinly sliced"
        },
        {
            "5": "1 large bell pepper, diced"
        },
        {
            "6": "1 salt and freshly ground black pepper to taste"
        },
        {
            "7": "1 tablespoon minced garlic"
        },
        {
            "8": "1 pound boneless rib-eye steak, fat trimmed, cut crosswise into thin strips"
        },
        {
            "9": "0.5 cup soy sauce"
        },
        {
            "10": "0.25 cup water"
        },
        {
            "11": "0.25 cup light brown sugar"
        },
        {
            "12": "2 tablespoons white vinegar"
        },
        {
            "13": "1 tablespoon cornstarch"
        },
        {
            "14": "0.5 teaspoon ground ginger"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with lightly salted water and bring to a rolling boil; stir in vermicelli pasta and return to a boil. Cook pasta uncovered, stirring occasionally, until the pasta is tender yet firm to the bite, 4 to 5 minutes. Drain and keep warm."
        },
        {
            "2": "Meanwhile, heat 1 tablespoon oil in a large nonstick skillet over medium-high heat. Add zucchini, onion, and bell pepper, season lightly with salt and pepper, and saute, stirring occasionally, until lightly caramelized and tender, about 8 minutes. Add minced garlic and cook until garlic is fragrant, about 1 minute. Transfer vegetables into a bowl and set aside."
        },
        {
            "3": "Heat remaining oil in the skillet until hot. Add steak strips and sear until nicely browned on each side and steak is cooked to medium (or cook longer to your tastes). Season steak lightly with salt and pepper while it cooks."
        },
        {
            "4": "Meanwhile, combine soy sauce, water, brown sugar, vinegar, cornstarch, and ginger in a bowl to make the teriyaki sauce. Whisk until sauce is well blended."
        },
        {
            "5": "Add vegetables back into the skillet once steak is cooked and pour teriyaki sauce over everything. Bring mixture to a simmer, and cook until the sauce thickens up, about 2 minutes. Add cooked noodles and gently stir to evenly coat noodles with the sauce and distribute meat and vegetables evenly. Taste, and adjust the seasonings if desired."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Total Time": "30 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "515"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "64g"
        },
        {
            "Protein": "24g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9224222.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}