{
    "title": "Air-Fried Pizza Egg Rolls",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "1 (8 ounce) package mozzarella cheese"
        },
        {
            "2": "1 (10 ounce) package egg roll wrappers"
        },
        {
            "3": "1 cup marinara sauce, divided"
        },
        {
            "4": "10 ounces mini pepperoni"
        },
        {
            "5": "2 tablespoons olive oil, or as needed"
        },
        {
            "6": "2 teaspoons Italian seasoning"
        },
        {
            "7": "1 teaspoon garlic salt"
        }
    ],
    "Directions": [
        {
            "1": "Preheat an air fryer to 400 degrees F (200 degrees C) according to manufacturer's instructions."
        },
        {
            "2": "Cut mozzarella cheese into 6-inch sticks."
        },
        {
            "3": "Place 1 egg roll wrapper on a flat surface, positioned to look like a diamond. Add 1 teaspoon marinara sauce, 1 mozzarella stick, and 2 tablespoons mini pepperoni to the bottom third of the egg roll wrapper."
        },
        {
            "4": "Roll up the bottom point over the filling, towards the center of the wrapper. Fold in the left side of the wrapper to cover the center. Fold in the right side of the wrapper to cover the left fold, like an envelope. Roll up the egg roll until just the top point is exposed. Brush some water on the top point and fold down. You may need to brush a bit more water over the edges to create a seal."
        },
        {
            "5": "Repeat for the remaining egg rolls. Brush olive oil over the tops. Sprinkle Italian seasoning and garlic salt over the tops."
        },
        {
            "6": "Brush some olive oil over the air fryer basket. Add egg rolls to the basket seam side-down, without letting them touch each other. Reduce the temperature to 360 degrees F (180 degrees C) and air fry for 8 minutes, flipping at the halfway point. Serve with remaining marinara sauce."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "8 mins"
        },
        {
            "Total Time": "28 mins"
        },
        {
            "Servings": "14 "
        },
        {
            "Yield": "14 egg rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "231"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "15g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8588279.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}