{
    "title": "Air Fryer Apple Pie Egg Rolls",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "2 medium Granny Smith apples, peeled, cored, and cut into 1-inch chunks"
        },
        {
            "2": "2 tablespoons lemon juice"
        },
        {
            "3": "0.5 cup water"
        },
        {
            "4": "2 tablespoons brown sugar"
        },
        {
            "5": "0.25 teaspoons ground cinnamon, divided"
        },
        {
            "6": "0.5 tablespoon white sugar"
        },
        {
            "7": "6  egg roll wrappers"
        },
        {
            "8": "0.25 cup white sugar"
        }
    ],
    "Directions": [
        {
            "1": "Preheat an air fryer to 400 degrees F (200 degrees C)."
        },
        {
            "2": "Place prepared apples in a medium saucepan. Drizzle lemon juice over top, then add water and stir. Sprinkle brown sugar and 1/4 teaspoon cinnamon over the apples; stir again. Cook over medium-low heat, stirring occasionally, until apples reach your preferred softness, about 40 minutes."
        },
        {
            "3": "Sprinkle apples with white sugar, then stir again. Cook for 5 more minutes. Remove saucepan from heat. Let mixture cool for about 10 minutes."
        },
        {
            "4": "Set a small bowl of water by work area. Lay an egg roll wrapper in front of you so the point is top and bottom. Scoop 1 to 2 tablespoons of the apple mixture along the middle of the wrapper."
        },
        {
            "5": "Fold the bottom point of the wrapper up and over the filling, tucking the end around it. Gently roll up one time. Wet the sides of the roll and fold over edges (so it makes a little purse)."
        },
        {
            "6": "Roll up the wrapper the rest of the way and brush with water to seal. Lightly brush completed roll with water. Mix 1/4 cup white sugar and remaining 1 teaspoon cinnamon together in a bowl. Gently roll egg roll in cinnamon-sugar mixture. Repeat with remaining filling and wrappers."
        },
        {
            "7": "Line the air fryer basket with parchment paper and carefully lay completed egg rolls on it. Air-fry for 7 minutes, then turn over. Continue to air-fry until light golden brown, about 7 minutes more."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 30 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 apple pie egg rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "103"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "26g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}