{
    "title": "Bekki's Mexican Egg Rolls",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "2 tablespoons vegetable oil"
        },
        {
            "2": "1 pound ground beef"
        },
        {
            "3": "1 large onion, chopped"
        },
        {
            "4": "5 cloves garlic, minced"
        },
        {
            "5": "1  red bell pepper, chopped"
        },
        {
            "6": "1 (1 ounce) package taco seasoning"
        },
        {
            "7": "1 (8 ounce) jar taco sauce"
        },
        {
            "8": "4 (16 ounce) packages egg roll wrappers"
        },
        {
            "9": "1 (1 pound) loaf processed cheese food (i.e. Velveeta®), cut into 1/4 inch thick slices"
        },
        {
            "10": "2  egg whites, lightly beaten"
        },
        {
            "11": "2 quarts canola oil"
        }
    ],
    "Directions": [
        {
            "1": "Place the vegetable oil and ground beef into a large skillet; cook over medium-high heat until the meat is evenly browned and no longer pink. Reduce the heat to medium. Mix in the onion, garlic, and bell pepper; cook until the vegetables are softened, about 5 minutes. Stir in the taco seasoning and taco sauce. Continue to cook and stir the mixture until the sauce begins to bubble, about 5 minutes more."
        },
        {
            "2": "Working on a clean, flat surface, place 1 egg roll wrapper with a corner facing you. Place 1 tablespoon of the meat mixture in the center of the wrapper and top with a slice of cheese. Fold the corner closest to you over the meat mixture and roll the wrapper over the mixture 1-1/2 times. Fold in the two opposite side corners and continue rolling the wrapper so it covers these corners, tucking them in. Dip two fingers in the egg whites and brush the remaining corner, pressing it to seal. Repeat these steps with a second egg roll wrapper. Let the egg roll rest briefly so the egg white dries and holds the last corner in place."
        },
        {
            "3": "If the egg rolls will not be served right away, preheat oven to 325 degrees F (165 degrees C). Line a heat-proof dish with paper towels."
        },
        {
            "4": "Pour the canola oil into a large wok set over medium-high heat. When the oil begins to shimmer, carefully slip two to three egg rolls into the wok. Cook until the wrappers turn golden brown and bubble slightly, 30 seconds to 1 minute. Use a slotted spoon or strainer to remove from the wok. Place the egg rolls in the prepared dish and put the dish in the heated oven, making sure to remove it after 15 minute or lower the temperature. Continue cooking the remaining egg rolls."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "20 egg rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "980"
        },
        {
            "Fat": "42g"
        },
        {
            "Carbs": "113g"
        },
        {
            "Protein": "34g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1236778.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}