{
    "title": "Cheeseburger Egg Rolls",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "1 pound ground beef"
        },
        {
            "2": "1  onion, chopped"
        },
        {
            "3": "1 cup chopped dill pickles or sweet pickles"
        },
        {
            "4": "1 cup shredded Cheddar cheese"
        },
        {
            "5": "1 tablespoon prepared yellow mustard, or to taste"
        },
        {
            "6": "1 (16 ounce) package egg roll wrappers"
        },
        {
            "7": "1 cup vegetable oil for frying"
        }
    ],
    "Directions": [
        {
            "1": "Place the ground beef and onion in a skillet over medium heat, and cook and stir for about 10 minutes, breaking up the beef into crumbles as it cooks. Drain the meat and transfer to a bowl. Stir in the chopped pickles, shredded cheese, and mustard, and mix together well."
        },
        {
            "2": "Line a baking sheet with parchment paper. Place a bowl of water next to your work surface. Remove an egg roll wrapper from the stack, and cover the remaining wrappers with a damp paper towel to prevent them from drying out."
        },
        {
            "3": "Place the wrapper on the work surface with a corner facing towards you. Place about 1/4 cup of filling on the wrapper, and fold the top corner down over the filling. Tightly roll the wrapper into a cylinder, tucking in the corners as you roll, until the wrapper completely encloses the filling. Moisten the last corner with a little water, and finish wrapping so the moistened corner tightly seals to the egg roll, and there are no gaps to let the filling leak out. Place filled egg rolls on the parchment-lined baking sheet, covered with a slightly damp paper towel, while you finish making the egg rolls."
        },
        {
            "4": "Heat the oil in a deep saucepan or deep fryer until a thermometer registers 365 degrees F (185 degrees C). Carefully place 2 or 3 egg rolls at a time into the hot oil, and fry for about 4 or 5 minutes, turning the egg rolls over once, until golden brown. Remove the egg rolls with a tongs, and drain on paper towels."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "15 "
        },
        {
            "Yield": "15 egg rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "189"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fc9b57153533c9c1336f33f14d5a0829a%2F164820114520220324_182942.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8908890.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8504651.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8267396.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}