{
    "title": "Corned Beef and Cabbage Egg Rolls",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "1 (2 pound) corned beef brisket with spice packet"
        },
        {
            "2": "0.5 cups water, divided"
        },
        {
            "3": "1 medium head cabbage, cut into chunks"
        },
        {
            "4": "1 salt and ground black pepper to taste"
        },
        {
            "5": "2 tablespoons grapeseed oil"
        },
        {
            "6": "10 slices Asiago cheese"
        },
        {
            "7": "1 (16 ounce) package wonton wrappers"
        },
        {
            "8": "2 cups peanut oil for frying, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Place corned beef in a large roasting pan with the fat facing up. Add 1 cup water and the seasoning packet. Cover with aluminum foil."
        },
        {
            "3": "Cook in the preheated oven for 1 1/2 hours. Remove from the oven and increase heat to 400 degrees F (200 degrees C)."
        },
        {
            "4": "Season cabbage with grapeseed oil, salt, and pepper; scatter around the brisket. Return to the oven and roast, uncovered, until cabbage is tender, about 20 minutes."
        },
        {
            "5": "Remove from the oven and let cool completely, 30 to 45 minutes. Dice corned beef and cut cabbage into smaller strips; mix together in a mixing bowl."
        },
        {
            "6": "Cut Asiago cheese slices in half. Place an egg roll wrapper in front of you with one corner facing you, like a diamond. Put a piece of cheese in the center and top with 1/4 cup cabbage mixture. Wet the top 2 edges of the wrapper (furthest from you). Fold the left corner in and over the filling, then do the same with the right corner, overlapping a bit. Take the bottom corner and fold it 2/3 in towards the top corner, then wrap to seal. Repeat to fill and form remaining egg rolls."
        },
        {
            "7": "Heat 2 inches oil in a deep saucepan over medium heat to 375 degrees F (190 degrees C). Working in batches, lower a few egg rolls carefully into the hot oil. Fry until golden brown, 2 to 3 minutes. Drain on a paper towel-lined plate and repeat to fry remaining egg rolls."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 2 hrs"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 3 hrs"
        },
        {
            "Servings": "20 "
        },
        {
            "Yield": "20 egg rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "208"
        },
        {
            "Fat": "12g"
        },
        {
            "Carbs": "16g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}