{
    "title": "Crab-Filled Egg Rolls With Ginger-Lime Dipping Sauce",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "15  egg roll wrappers"
        },
        {
            "2": "1 pound pasteurized lump crabmeat"
        },
        {
            "3": "1 quart vegetable oil"
        },
        {
            "4": "1 Dipping sauce-"
        },
        {
            "5": "2 tablespoons lime juice"
        },
        {
            "6": "1 tablespoon white sugar"
        },
        {
            "7": "2 tablespoons Asian fish sauce"
        },
        {
            "8": "1 tablespoon water"
        },
        {
            "9": "0.5 teaspoon ground ginger"
        },
        {
            "10": "0.5 teaspoon hot red pepper flakes"
        },
        {
            "11": "0.25 cup chopped fresh cilantro, for garnish"
        }
    ],
    "Directions": [
        {
            "1": "Place an egg-roll wrapper on a work surface. Center 3 Tbs. crabmeat on the wrapper, forming it into a log. Fold the corner closest to you tightly over the filling, then overlap right and left corners. Then, as if forming a cigarette, roll wrapper tightly, moistening the end with wet fingertips. Press to seal. Repeat with remaining wrappers and crab."
        },
        {
            "2": "Heat oil in a Dutch oven to 300 degrees. Cook rolls, 5 at a time, turning once, until blond, about 2 minutes. Drain, cool and refrigerate in a zipper-lock bag. (Can be prepared to this point up to 3 days ahead.) Reserve oil."
        },
        {
            "3": "Several hours before serving, mix dipping sauce ingredients together. Heat oven to 200 degrees. Reheat oil to 375 degrees in Dutch oven. Cook rolls again, 5 at a time, turning once, until crisp and golden brown, about 2 minutes. Drain on a rack set over a lipped cookie sheet and place in warm oven; can be held up to 20 minutes."
        },
        {
            "4": "Cut each roll into thirds, sprinkle with cilantro and serve with dipping sauce."
        }
    ],
    "Details": [
        {
            "Servings": "45 "
        },
        {
            "Yield": "45 hors d'oeuvres"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "37"
        },
        {
            "Fat": "2g"
        },
        {
            "Carbs": "2g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3589205.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}