{
    "title": "Po Piah (Thai Spring Rolls)",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "1 (2 ounce) package mung bean noodles"
        },
        {
            "2": "0.5 cup ground pork"
        },
        {
            "3": "0.25 cups bean sprouts"
        },
        {
            "4": "1 cup finely chopped cabbage"
        },
        {
            "5": "1  egg"
        },
        {
            "6": "2 tablespoons light soy sauce, or to taste"
        },
        {
            "7": "1 teaspoon white sugar, or more to taste"
        },
        {
            "8": "0.25 teaspoon ground white pepper, or to taste"
        },
        {
            "9": "1 tablespoon vegetable oil"
        },
        {
            "10": "4 cloves garlic, minced"
        },
        {
            "11": "1 (16 ounce) package small spring roll wrappers"
        },
        {
            "12": "1 tablespoon all-purpose flour"
        },
        {
            "13": "2 tablespoons water, or as needed"
        },
        {
            "14": "2 cups vegetable oil for frying"
        }
    ],
    "Directions": [
        {
            "1": "Cover mung bean noodles with warm water and soak until soft, about 30 minutes. Cut into 1/2-inch pieces."
        },
        {
            "2": "Combine pork, bean sprouts, cabbage, mung bean noodles, egg, light soy sauce, sugar, and white pepper in a bowl. Mix well."
        },
        {
            "3": "Heat 1 tablespoon oil in a skillet over medium-high heat and cook garlic until fragrant, about 1 minute. Add pork mixture and stir-fry until pork is cooked through and looks somewhat dry, about 3 minutes. Add more soy sauce, sugar, or pepper to taste. Set aside to cool."
        },
        {
            "4": "Stir 1 tablespoon flour with some water to make a sticky paste for sealing the spring rolls."
        },
        {
            "5": "Lay 1 spring roll wrapper on a flat work surface with one of the corners facing you. Place a scant teaspoon of the cooled filling right below the middle of the wrap. Fold the corner facing you over the filling. Roll the filling up about a half turn. Fold the left and right sides in to create an envelope shape. Finish rolling up the spring roll tightly, sealing the top corner with a dab of the flour paste. Store unused wrappers and finished spring rolls under a moistened kitchen towel, to prevent them from drying out."
        },
        {
            "6": "Heat oil in a heavy pot over medium-low heat. Fry spring rolls in batches until cooked through and golden brown, about 5 minutes. Drain on paper towels and serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "310"
        },
        {
            "Fat": "11g"
        },
        {
            "Carbs": "42g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5353816.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}