{
    "title": "Thanksgiving Egg Rolls",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "2 cups canola oil for frying, or as needed"
        },
        {
            "2": "0.5 cups cubed cooked turkey"
        },
        {
            "3": "0.5 cup turkey gravy"
        },
        {
            "4": "1 (12 ounce) package egg roll wrappers"
        },
        {
            "5": "0.5 cups mashed cooked potatoes"
        },
        {
            "6": "0.5 cups prepared stuffing"
        },
        {
            "7": "0.5 cup prepared whole-berry cranberry sauce"
        }
    ],
    "Directions": [
        {
            "1": "Heat oil in a pan on the stovetop until it reaches 375 degrees F (190 degrees C)."
        },
        {
            "2": "Toss turkey and 1/2 cup gravy in a bowl until well combined."
        },
        {
            "3": "Lay an egg roll wrapper on a plate or a clean cutting board with one of the corners pointing up, so it is positioned like a diamond. Pour some water into a small bowl next to the plate. Layer 2 tablespoons mashed potatoes, 2 tablespoons of the turkey-gravy mixture, 2 tablespoons stuffing, and 1/2 tablespoon of cranberry sauce in a vertical line in the center of the wrapper."
        },
        {
            "4": "Dip your fingertips in the bowl of water and swipe some water around the edges of the egg roll wrapper. Fold the top and bottom corners of the egg roll wrapper over the filling. Next, fold in the left corner, then roll from left to right until the egg roll is completely wrapped. Wet your fingers with additional water and trace the parts of the egg roll wrapper that connect to each other and pinch lightly to seal. Repeat with the remaining wrappers and filling."
        },
        {
            "5": "Fry egg rolls in batches in the hot oil, turning often, until golden brown and heated through, 3 to 4 minutes. Transfer to a paper towel-lined plate to drain and cool."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 egg rolls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "231"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "31g"
        },
        {
            "Protein": "9g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8784277.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}