{
    "title": "Uncle Rey's Lumpia",
    "Category": "Egg Rolls",
    "Ingredients": [
        {
            "1": "1  whole chicken"
        },
        {
            "2": "2  carrots, peeled and cut into 1-inch pieces"
        },
        {
            "3": "2 stalks celery, cut into 1-inch pieces"
        },
        {
            "4": "1 medium yellow onion, cut into 1-inch pieces"
        },
        {
            "5": "1 Salt and pepper"
        },
        {
            "6": "2 (16 ounce) packages frozen French-cut green beans"
        },
        {
            "7": "1 pound bean sprouts"
        },
        {
            "8": "2 (16 ounce) packages lumpia wrappers"
        },
        {
            "9": "1  egg, beaten"
        },
        {
            "10": "1 vegetable oil for frying"
        },
        {
            "11": "1 Dipping Sauce-"
        },
        {
            "12": "0.75 cup soy sauce"
        },
        {
            "13": "0.5 cup unseasoned rice vinegar"
        },
        {
            "14": "3 cloves garlic, minced"
        }
    ],
    "Directions": [
        {
            "1": "Put the chicken in a small stockpot, cover with water and add the carrots, celery, and onion. Bring to a boil, then reduce to a simmer. Cook for about 1 hour and 15 minutes or until the chicken is cooked and starting to fall from the bone."
        },
        {
            "2": "Remove the chicken from the pot; set aside to cool. When the chicken is cool enough to handle, pull the meat from the bones. Put bones and skin back into the stockpot. Turn the heat up and bring the liquid back to a boil. Cook until the liquid is reduced by half, 10 to 15 minutes."
        },
        {
            "3": "Strain out the bones and vegetables, and put the liquid back into the pot and season with salt and pepper."
        },
        {
            "4": "Add the beans and bean sprouts to the stock and simmer until beans are tender, about 8 minutes. Add the pulled chicken meat to the stock and mix well. Remove from heat and strain the chicken and vegetable filling until dry. Let cool completely before making the lumpia, at least 15 minutes."
        },
        {
            "5": "Place 1 wrapper on the table or cutting board and put 1/4 cup of the chicken filling in the lower quarter of the wrapper. Fold the wrapper over the filling, then roll over once. Fold in the ends to seal in the filling, then continue folding over until almost to the top. Brush the edge of the wrapper with egg, fold over, and seal. Continue making the lumpia until the filling is used up."
        },
        {
            "6": "Heat about 1 1/2 inches of vegetable or canola oil to 350 degrees F in a medium-sized, deep-sided sauce pan. Place the lumpia in the hot oil a few at a time, turning each one until they are golden brown. Remove from the oil and place onto paper towels to remove excess oil."
        },
        {
            "7": "Mix soy sauce, vinegar, and garlic together. Serve lumpia with the dipping sauce."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": " 1 hrs 45 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 3 hrs 15 mins"
        },
        {
            "Servings": "50 "
        },
        {
            "Yield": "50 lumpia"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "101"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "13g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6530368.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}