{
    "title": "Air-Fried Breaded Chicken Thighs",
    "Category": "Fried Chicken",
    "Ingredients": [
        {
            "1": "4 medium bone-in, skin-on chicken thighs"
        },
        {
            "2": "1 cup buttermilk"
        },
        {
            "3": "0.25 cup all-purpose flour"
        },
        {
            "4": "0.25 cup plain bread crumbs"
        },
        {
            "5": "2 tablespoons grated Parmesan cheese"
        },
        {
            "6": "0.5 teaspoon ground paprika"
        },
        {
            "7": "1 teaspoon garlic powder"
        },
        {
            "8": "1 teaspoon salt"
        },
        {
            "9": "0.5 teaspoon onion powder"
        },
        {
            "10": "0.5 teaspoon black pepper"
        },
        {
            "11": "1 nonstick cooking spray"
        }
    ],
    "Directions": [
        {
            "1": "Place chicken thighs and buttermilk in a non-reactive container with a lid or a resealable plastic bag. Marinate in the refrigerator for at least 1 hour or overnight."
        },
        {
            "2": "Remove chicken from the refrigerator. Pour off buttermilk and let chicken rest on the counter while preparing the breading mixture."
        },
        {
            "3": "Combine flour, bread crumbs, Parmesan cheese, paprika, garlic powder, salt, onion powder, and black pepper in a large, shallow bowl or pie plate; whisk or stir with a fork until evenly combined."
        },
        {
            "4": "Preheat the air fryer to 375 to 380 degrees F (190 to 195 degrees C). Spray air fryer basket lightly with nonstick spray."
        },
        {
            "5": "Once air fryer is hot, press chicken thighs, 1 at a time, into the breading mixture and make sure breading sticks onto all sides as much as possible. Gently set into the air fryer basket. Repeat until all thighs are breaded and in the basket. Do not stack them on top of each other."
        },
        {
            "6": "Set air fryer for 25 minutes. When the time is up check temperature with an instant-read thermometer. Internal temperature should be 180 degrees F (82 degrees C). If they aren't quite done but the breading is getting dark, just close the basket again and let them rest, or you can turn the air fryer on again for a few minutes and check again. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "850"
        },
        {
            "Fat": "49g"
        },
        {
            "Carbs": "15g"
        },
        {
            "Protein": "82g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9050811.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}