{
    "title": "Chicken Tempura",
    "Category": "Fried Chicken",
    "Ingredients": [
        {
            "1": "1 pound skinless, boneless chicken breasts"
        },
        {
            "2": "1 large egg, beaten"
        },
        {
            "3": "0.5 cup all-purpose flour"
        },
        {
            "4": "0.5 cup cornstarch"
        },
        {
            "5": "1 tablespoon lemon juice"
        },
        {
            "6": "0.5 teaspoon paprika"
        },
        {
            "7": "0.5 teaspoon baking soda"
        },
        {
            "8": "1 pinch salt"
        },
        {
            "9": "0.5 cup chilled club soda"
        },
        {
            "10": "0.5 cup oil for frying, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Place chicken on a flat work surface. Slice horizontally through the middle, being careful not to cut all the way through to the other side. Open the 2 sides and spread them out like an open book. Pound out the butterflied chicken breasts until thin, and slice them in half lengthwise."
        },
        {
            "2": "Prepare a large bowl with some ice water. Place a shallow bowl, for the batter, inside the large bowl; this is to keep the batter cold while cooking the chicken."
        },
        {
            "3": "Prepare batter: place beaten egg into a large mixing bowl. Sift flour and cornstarch into beaten egg. Add lemon juice, paprika, baking soda, and salt. Add club soda and mix until ingredients are fully incorporated; a few lumps in the batter will aid in creating an airy texture, so be careful not to overmix."
        },
        {
            "4": "Transfer the batter into the shallow bowl sitting on ice water."
        },
        {
            "5": "Fill a pan with 1 inch of vegetable oil and heat over medium heat until glossy, or until the temperature of the oil hits 350 degrees F (175 degrees C)."
        },
        {
            "6": "Take the strips of chicken and fully coat them in the batter, adding them to the hot oil in sets of 2 or 3 at a time."
        },
        {
            "7": "Cook chicken until golden brown and crispy and no longer pink in the centers, about 2 minutes per side, and transfer to a serving tray."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "287"
        },
        {
            "Fat": "7g"
        },
        {
            "Carbs": "27g"
        },
        {
            "Protein": "27g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fdebb52b152c3c2e9ebd8be2dc2776a9a%2F1663797805image.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F683773.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}