{
    "title": "Mushroom-Thyme White Pizza",
    "Category": "Pizza",
    "Ingredients": [
        {
            "1": "1 pound fresh pizza dough"
        },
        {
            "2": "1 flour for dusting"
        },
        {
            "3": "4 tablespoons olive oil, divided"
        },
        {
            "4": "0.5 pound cremini mushrooms, thinly sliced"
        },
        {
            "5": "0.5 pound maitake mushrooms, broken into small clusters"
        },
        {
            "6": "2 tablespoons chopped fresh oregano"
        },
        {
            "7": "2 tablespoons fresh thyme leaves, plus more for garnish"
        },
        {
            "8": "0.5 teaspoon kosher salt, divided"
        },
        {
            "9": "0.75 teaspoon freshly ground black pepper, divided, or more to taste"
        },
        {
            "10": "1 (5 ounce) package fresh baby spinach"
        },
        {
            "11": "1 cup whole milk ricotta cheese"
        },
        {
            "12": "0.5 cup finely grated Pecorino Romano cheese"
        },
        {
            "13": "2 cloves garlic, grated"
        },
        {
            "14": "1 cup shredded part-skim mozzarella cheese"
        },
        {
            "15": "1 shaved Pecorino Romano cheese, for garnish"
        }
    ],
    "Directions": [
        {
            "1": "Put a pizza stone or baking sheet on the middle oven rack. Preheat the oven to 450 degrees F (230 degrees C)."
        },
        {
            "2": "Turn dough out onto a lightly floured work surface and roll out into a 14-inch circle. Transfer to a piece of parchment paper or a cookie sheet lightly dusted with flour or cornmeal. Cover with a kitchen towel; let stand at room temperature until ready to use."
        },
        {
            "3": "Meanwhile, heat 2 tablespoons oil in a large skillet over medium heat. Add cremini and maitake mushrooms; cook, stirring occasionally, until well browned and tender, 6 to 8 minutes. Stir in oregano, thyme, 1/4 teaspoon salt, and 1/4 teaspoon pepper. Transfer mushroom mixture to a bowl. (Do not wipe skillet clean.)"
        },
        {
            "4": "Add 1 tablespoon oil to skillet. Add spinach and 1/4 teaspoon pepper; cook, stirring frequently, until spinach is wilted, about 2 minutes. Transfer to a paper towel-lined plate to drain."
        },
        {
            "5": "Stir together ricotta, Pecorino-Romano, garlic, and remaining 1/4 teaspoon each salt and pepper in a bowl until well combined. Brush dough with remaining 1 tablespoon oil. Spread ricotta mixture in an even layer over the dough, leaving a 1-inch border. Sprinkle mozzarella evenly over ricotta mixture. Top with cooked mushrooms and spinach."
        },
        {
            "6": "Carefully transfer pizza on parchment to hot pizza stone or baking sheet in the oven. Bake until cheese is bubbly and crust is deeply golden brown, 15 to 18 minutes."
        },
        {
            "7": "Transfer pizza and parchment to a cutting board; let stand 5 minutes. Remove parchment. Garnish with additional thyme, a few grinds of pepper, and shaved Pecorino-Romano cheese."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "1 pizza"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "714"
        },
        {
            "Fat": "35g"
        },
        {
            "Carbs": "64g"
        },
        {
            "Protein": "35g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F16105e8b6b292c62bbb7ead31ed757da%2F1668706452156IMG_6905.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F16105e8b6b292c62bbb7ead31ed757da%2F166835620728520221113_101631.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pizza"
}