{
    "title": "Fresh Peach Empanadas",
    "Category": "Empanada Recipes",
    "Ingredients": [
        {
            "1": "1 Pastry-"
        },
        {
            "2": "2 cups all-purpose flour"
        },
        {
            "3": "1 tablespoon white sugar"
        },
        {
            "4": "0.5 teaspoon salt"
        },
        {
            "5": "1 cup cold butter, cut into 1/2-inch pieces"
        },
        {
            "6": "0.25 cup cream cheese"
        },
        {
            "7": "0.25 cup sour cream"
        },
        {
            "8": "1 Filling-"
        },
        {
            "9": "2  ripe peaches, peeled and cut into 1-inch pieces"
        },
        {
            "10": "1.5 tablespoons white sugar, divided, or more to taste"
        },
        {
            "11": "1 teaspoon ground cinnamon"
        },
        {
            "12": "0.5 teaspoon vanilla extract"
        },
        {
            "13": "1 pinch salt"
        },
        {
            "14": "0.5  egg, beaten, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Place flour in a medium bowl. Whisk in sugar and salt. Cut in butter using 2 knives or a pastry cutter. Gently work in cream cheese and sour cream until dough is combined."
        },
        {
            "2": "Turn dough out onto your working surface. Quickly gather crumbs together into a square; fold square in half. Flatten dough out into a larger square using a rolling pin; fold in half again. Roll out one more time and fold into thirds, like a letter. Wrap dough in plastic wrap. Chill until firm, about 1 hour."
        },
        {
            "3": "Mix peaches, 3 tablespoons sugar, and cinnamon in a small bowl. Let sit for about 15 minutes. Transfer filling mixture into a strainer over a bowl to drain the excess juices for 15 minutes, stirring occasionally."
        },
        {
            "4": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper."
        },
        {
            "5": "Roll pastry dough onto a floured surface to about 3/8-inch thickness. Cut out 15 to 20 circles about 4- to 6-inches in diameter. Place 2 teaspoons of filling into the middle of each circle. Fold dough in half over the filling and seal edges together with your fingers. Press edges together with the tines of a fork to make a decorative seal, if desired."
        },
        {
            "6": "Place empanadas on the prepared baking sheet; brush with egg and sprinkle with remaining sugar."
        },
        {
            "7": "Bake in the preheated oven until golden brown, 12 to 15 minutes. Remove from oven and let cool for 5 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 1 hrs 35 mins"
        },
        {
            "Total Time": " 2 hrs 20 mins"
        },
        {
            "Servings": "15 "
        },
        {
            "Yield": "15 empanadas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "212"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "18g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}