{
    "title": "Fried Beef Empanadas",
    "Category": "Empanada Recipes",
    "Ingredients": [
        {
            "1": "0.25 cup olive oil"
        },
        {
            "2": "1 medium yellow onion, finely chopped"
        },
        {
            "3": "1 medium green bell pepper, finely chopped"
        },
        {
            "4": "0.5 pounds ground beef"
        },
        {
            "5": "1 clove garlic, minced"
        },
        {
            "6": "2 teaspoons adobo seasoning (such as Goya®)"
        },
        {
            "7": "1 cup raisins"
        },
        {
            "8": "1 (6 ounce) can tomato paste"
        },
        {
            "9": "3 large hard-cooked eggs, chopped"
        },
        {
            "10": "20 small pimento-stuffed green olives, chopped"
        },
        {
            "11": "1 teaspoon white wine vinegar"
        },
        {
            "12": "1 salt and ground black pepper to taste"
        },
        {
            "13": "0.25 cup all-purpose flour, or as needed"
        },
        {
            "14": "3 (14 ounce) packages frozen empanada shells (such as Goya® discos), thawed"
        },
        {
            "15": "1 cup vegetable oil for frying, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Heat olive oil in a large frying pan over medium-high heat; add onion and bell pepper. Cook and stir, 3 to 4 minutes. Add beef, garlic, and adobo; continue to cook and stir until meat is browned, crumbly, and no longer pink, 5 to 7 minutes. Drain mixture in a colander to remove most of the liquid and allow to cool for 10 minutes."
        },
        {
            "2": "Transfer cooled mixture to a mixing bowl with raisins, tomato paste, eggs, olives, and vinegar. Mix to combine and season with salt and pepper."
        },
        {
            "3": "Lightly dust a work surface with flour and lay out empanada discs on top. Place a spoonful of stuffing on the bottom half of a disc and moisten the edges with water. Fold disc in half over the stuffing and press with a fork to seal the edges. Dust with flour and transfer to a plate. Repeat to form remaining empanadas, stacking on the plate between layers of waxed paper."
        },
        {
            "4": "Heat vegetable oil (3/4 inch deep) in a large frying pan over medium heat. Place empanadas in the hot oil, working in batches, and fry until browned and crisp, 2 to 4 minutes; flip. Continue frying on opposite side until browned, 3 to 5 minutes more."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 50 mins"
        },
        {
            "Servings": "30 "
        },
        {
            "Yield": "30 empanadas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "211"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "27g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}