{
    "title": "Quince Empanadas",
    "Category": "Empanada Recipes",
    "Ingredients": [
        {
            "1": "1 Pastry-"
        },
        {
            "2": "6 tablespoons warm water"
        },
        {
            "3": "1 teaspoon salt"
        },
        {
            "4": "2 cups all-purpose flour, sifted"
        },
        {
            "5": "0.25 cup unsalted butter, melted"
        },
        {
            "6": "1 large egg, beaten"
        },
        {
            "7": "1 teaspoon sunflower oil, or as needed"
        },
        {
            "8": "1 Filling-"
        },
        {
            "9": "0.5 pound quince paste (dulce de membrillo), cubed"
        },
        {
            "10": "1 large egg, beaten"
        },
        {
            "11": "1 tablespoon white sugar, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine water and salt in a small saucepan over medium heat and warm through, stirring until salt is dissolved. Remove from heat and let cool for 2 to 3 minutes."
        },
        {
            "2": "Combine sifted flour and butter in the bowl of a food processor; pulse until crumbly. Add egg and pulse until just combined. Add salt water gradually to the food processor and pulse until a soft dough ball forms that easily separates from the edge of the bowl. Add more water, 1 teaspoon at a time, only if needed. Press dough into a ball and wrap tightly with plastic wrap. Refrigerate for at least 30 minutes."
        },
        {
            "3": "Preheat the oven to 400 degrees F (200 degrees C). Cover a baking tray with aluminum foil and grease with sunflower oil. Set aside."
        },
        {
            "4": "Dust a work surface with flour and knead dough for 1 minute. Divide dough into 2 pieces. Roll 1 piece out thinly and cut into 3-inch discs. Repeat with the second piece."
        },
        {
            "5": "Put a couple of cubes of quince paste in the center of each circle. Fold over and seal borders together by pressing between your fingers. Working from one end to the other, gently fold the edge over on itself to create a fanned look. Alternatively, you can press the edges together with a fork. Transfer empanadas to the baking sheet, brush with beaten, egg and sprinkle with sugar."
        },
        {
            "6": "Bake in the preheated oven until golden, about 10 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 empanadas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "188"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "31g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8792352.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8792356.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}