{
    "title": "Watermelon Cake",
    "Category": "Cake Recipes",
    "Ingredients": [
        {
            "1": "1 Cake-"
        },
        {
            "2": "1 nonstick baking spray"
        },
        {
            "3": "1.0 cups all-purpose flour"
        },
        {
            "4": "1 tablespoon all-purpose flour"
        },
        {
            "5": "3 tablespoons watermelon-flavored gelatin mix (such as Jell-O®)"
        },
        {
            "6": "1 teaspoon baking powder"
        },
        {
            "7": "1 teaspoon kosher salt"
        },
        {
            "8": "0.5 teaspoon baking soda"
        },
        {
            "9": "1 cup unsalted butter, softened"
        },
        {
            "10": "2 cups white sugar"
        },
        {
            "11": "3 large eggs"
        },
        {
            "12": "0.5 cups whole buttermilk"
        },
        {
            "13": "2 teaspoons vanilla extract"
        },
        {
            "14": "1 teaspoon red gel food coloring"
        },
        {
            "15": "1 cup miniature semisweet chocolate chips"
        },
        {
            "16": "1 Frosting-"
        },
        {
            "17": "0.5 cups unsalted butter, softened"
        },
        {
            "18": "0.25 teaspoon kosher salt"
        },
        {
            "19": "2 teaspoons vanilla extract"
        },
        {
            "20": "6 cups powdered sugar"
        },
        {
            "21": "6 tablespoons heavy whipping cream"
        },
        {
            "22": "1 red food coloring gel"
        },
        {
            "23": "1 green food coloring gel"
        },
        {
            "24": "1 miniature semisweet chocolate chips for decoration"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oven to 350 degrees F (175 degrees C). Coat three 8-inch round cake pans with baking spray; set aside."
        },
        {
            "2": "Whisk together 2 1/2 cups flour, gelatin, baking powder, salt, and baking soda in a medium bowl. Beat butter at medium speed with a stand mixer, fitted with the paddle attachment, until creamy, about 3 minutes. Gradually add sugar, beating until light and fluffy, 3 to 4 minutes. Add eggs, 1 at a time, beating just until blended and stopping to scrape down sides of bowl after each addition."
        },
        {
            "3": "Add flour mixture to butter mixture alternately with buttermilk, beginning and ending with flour mixture, beating at low speed until just blended after each addition. Beat in vanilla and red food coloring gel until blended. Toss chocolate chips with remaining 1 tablespoon flour in a small bowl. Gently fold into batter."
        },
        {
            "4": "Divide batter evenly among prepared cake pans."
        },
        {
            "5": "Bake in the preheated oven until a wooden pick inserted in the center comes out clean, 28 to 32 minutes. Cool in pans on a wire rack for 10 minutes. Remove cakes from pans and cool completely on wire rack about 1 hour."
        },
        {
            "6": "Prepare Frosting: Beat butter and salt with a stand mixer fitted with a paddle attachment on medium speed until creamy, about 3 minutes; beat in vanilla. Gradually add powdered sugar alternately with 6 tablespoons cream, beating on low speed, until completely incorporated and smooth, about 2 minutes. Increase mixer speed to medium-high and beat until mixture is smooth and fluffy, about 2 to 3 minutes. Remove 1/3 cup of the frosting to a small bowl. Remove 2 cups of the frosting to a medium bowl; stir in enough red food coloring until desired shade of red. Tint remaining frosting with green food coloring gel until desired shade of green."
        },
        {
            "7": "Assemble Cake: Place 1 cake layer on a serving platter or cake stand. Spread top with 2/3 cup red frosting. Top with a second cake layer; spread top with 2/3 cup red frosting. Top with remaining cake layer; spread top with remaining red frosting, leaving a 1/2-inch border around edge. Frost sides of cake with green frosting. Place reserved 1/3 cup plain frosting into a piping bag or zip-lock bag with a 1/4-inch hole cut in the corner. Pipe plain frosting around top edge of cake, filling in the 1/4-inch border. Sprinkle top with miniature chocolate chips to resemble seeds."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 1 hrs 10 mins"
        },
        {
            "Total Time": " 2 hrs 25 mins"
        },
        {
            "Servings": "12 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "938"
        },
        {
            "Fat": "47g"
        },
        {
            "Carbs": "127g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [],
    "main category": "cakes"
}