{
    "title": "Chocolate-Covered Caramel Corn",
    "Category": "Popcorn",
    "Ingredients": [
        {
            "1": "4 (3.25 ounce) packages butter-flavored microwave popcorn"
        },
        {
            "2": "2 cups dry-roasted peanuts (Optional)"
        },
        {
            "3": "2 cups brown sugar"
        },
        {
            "4": "1 cup margarine"
        },
        {
            "5": "0.5 cup light corn syrup"
        },
        {
            "6": "1 teaspoon salt"
        },
        {
            "7": "1 teaspoon vanilla extract"
        },
        {
            "8": "0.5 teaspoon baking soda"
        },
        {
            "9": "1 (14 ounce) bag chocolate almond bark, broken into pieces"
        }
    ],
    "Directions": [
        {
            "1": "Place 1 bag popcorn in the microwave; cook on high until popping begins to slow down, about 2 1/2 minutes. Repeat with remaining bags. Open bags carefully; divide popcorn between 2 shallow baking dishes. Mix in peanuts."
        },
        {
            "2": "Preheat oven to 250 degrees F (120 degrees C)."
        },
        {
            "3": "Combine brown sugar, margarine, corn syrup, and salt in a saucepan over medium heat. Bring to a boil, stirring enough to blend. Simmer, stirring constantly, for 5 minutes. Remove from heat; mix in vanilla extract and baking soda until mixture is light and foamy."
        },
        {
            "4": "Pour brown sugar mixture over the popcorn-peanut mixture; stir to coat."
        },
        {
            "5": "Bake in the preheated oven, stirring every 25 minutes, until a cooled piece of popcorn is crunchy, about 1 hour."
        },
        {
            "6": "Line a flat work surface with waxed paper. Pour popcorn onto the waxed paper. Break up any large clusters."
        },
        {
            "7": "Melt chocolate almond bark in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes. Pour into a resealable plastic bag; snip off 1 corner. Drizzle melted chocolate over popcorn. Let popcorn cool completely."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs 21 mins"
        },
        {
            "Total Time": " 1 hrs 41 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "544"
        },
        {
            "Fat": "37g"
        },
        {
            "Carbs": "55g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F8fe9b3150b8b68913274dac3a99f41ab%2F5236356.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}