{
    "title": "Pop's Molasses Popcorn Balls and Taffy",
    "Category": "Popcorn",
    "Ingredients": [
        {
            "1": "6 cups popped popcorn, or as needed"
        },
        {
            "2": "1 ice water"
        },
        {
            "3": "2 cups white sugar"
        },
        {
            "4": "1 cup light corn syrup (such as Karo®)"
        },
        {
            "5": "0.5 cup dark molasses"
        },
        {
            "6": "0.5 cup water"
        },
        {
            "7": "0.25 cup butter"
        },
        {
            "8": "0.5 teaspoon salt"
        }
    ],
    "Directions": [
        {
            "1": "Place popcorn in a large bowl, with room for mixing. Fill another bowl with ice water. Butter several plates, one per each person who will be pulling taffy."
        },
        {
            "2": "Combine sugar, corn syrup, molasses, water, butter, and salt in a large 6-quart saucepan over medium heat; attach a candy thermometer. Bring to a boil, stirring frequently. Tip the pan slightly to melt the sugar crystals on the sides, scraping down with a wooden spoon. Heat until the mixture registers 300 to 310 degrees F (149 to 155 degrees C) on the thermometer or until a small amount of syrup drizzled into cold water turns hard, 7 to 10 minutes."
        },
        {
            "3": "Pour about 1 cup syrup onto each buttered plate. Let cool until safe to handle like a hot potato, 3 to 5 minutes. Pull syrup between your hands until a light golden brown color is achieved; the longer you pull it, the lighter it becomes. Twist into a long rope about 3/4-inch thick and place on back on a buttered plate to let taffy harden and cool. Break the hardened taffy apart."
        },
        {
            "4": "Pour the remaining hot syrup carefully over popcorn, while someone else quickly stirs the batch. Butter your hands and dip them in the ice water; working quickly to avoid burns and before taffy hardens, grab some of the popcorn mixture and form into a 3-inch ball. Repeat with the remaining popcorn."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "7 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 2 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 popcorn balls"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "312"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "67g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F896325.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}