{
    "title": "Reindeer Poop Popcorn",
    "Category": "Popcorn",
    "Ingredients": [
        {
            "1": "1 cup butter"
        },
        {
            "2": "2 cups brown sugar"
        },
        {
            "3": "0.5 cup corn syrup"
        },
        {
            "4": "0.5 teaspoons salt"
        },
        {
            "5": "1 cup shredded coconut, divided"
        },
        {
            "6": "0.25 cup chopped peanuts"
        },
        {
            "7": "0.25 cup sliced almonds, divided"
        },
        {
            "8": "2 teaspoons vanilla extract"
        },
        {
            "9": "1 teaspoon baking soda"
        },
        {
            "10": "0.25 teaspoon ground cinnamon (Optional)"
        },
        {
            "11": "1 pinch ground nutmeg (Optional)"
        },
        {
            "12": "1 pinch ground allspice (Optional)"
        },
        {
            "13": "2 tablespoons virgin coconut oil"
        },
        {
            "14": "1 tablespoon butter"
        },
        {
            "15": "1 tablespoon vegetable oil"
        },
        {
            "16": "0.5 cup unpopped popcorn"
        },
        {
            "17": "0.75 cup chocolate chips"
        },
        {
            "18": "1 tablespoon virgin coconut oil"
        },
        {
            "19": "1 tablespoon shortening"
        },
        {
            "20": "1 tablespoon confectioners' sugar, sifted"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oven to 250 degrees F (120 degrees C). Line 2 baking sheets with parchment paper."
        },
        {
            "2": "Melt 1 cup butter in a saucepan over medium heat. Stir brown sugar, corn syrup, and salt into melted butter; bring to a boil, stirring constantly, reduce heat to low, and simmer caramel sauce without stirring until slightly thickened, about 4 minutes. Remove from heat and stir 1/3 cup coconut, peanuts, 2 tablespoons almonds, vanilla extract, baking soda, cinnamon, nutmeg, and allspice into caramel."
        },
        {
            "3": "Heat 2 tablespoons coconut oil, 1 tablespoon butter, and vegetable oil together in a large pot over high heat. Pour popcorn into hot oil, cover the pot with a lid, and shake pot constantly over heat until all popcorn is popped, 1 to 3 minutes."
        },
        {
            "4": "Pour caramel sauce over hot popcorn and quickly stir to coat. Turn popcorn out onto prepared baking sheets. Sprinkle 1/3 cup coconut and remaining 2 tablespoons almonds over popcorn."
        },
        {
            "5": "Bake in the preheated oven for 45 minutes. Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Broil popcorn until coconut and popcorn are lightly toasted, about 30 seconds."
        },
        {
            "6": "Melt chocolate chips, 1 tablespoon coconut oil, and shortening together in a saucepan until all are melted and the chocolate sauce is thin and pourable. Drizzle chocolate sauce and sprinkle remaining 1/3 cup coconut over popcorn; dust with confectioners' sugar. Lift parchment paper off of the baking sheets and transfer popcorn to the refrigerator to cool completely, about 45 minutes. Break into palm-sized chunks and store in airtight containers."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 50 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "789"
        },
        {
            "Fat": "46g"
        },
        {
            "Carbs": "97g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1232968.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}