{
    "title": "Trofie al Pesto",
    "Category": "Pesto Sauce",
    "Ingredients": [
        {
            "1": "1 Pasta-"
        },
        {
            "2": "2 cups all-purpose flour"
        },
        {
            "3": "0.25 cup water, or more to taste"
        },
        {
            "4": "2 large eggs"
        },
        {
            "5": "1 splash olive oil"
        },
        {
            "6": "2 pinches salt"
        },
        {
            "7": "1 Pesto-"
        },
        {
            "8": "2 cloves garlic, roughly chopped"
        },
        {
            "9": "1.0 tablespoons pine nuts"
        },
        {
            "10": "1.0 cups lightly packed fresh basil"
        },
        {
            "11": "0.5 cup extra-virgin olive oil"
        },
        {
            "12": "0.5 cup grated Parmesan cheese"
        },
        {
            "13": "1 pinch salt"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour, 1/4 cup water, eggs, olive oil, and salt for pasta in the bowl of a food processor; pulse a few times until just combined. Pinch dough to see if it sticks together and forms a small clump. If it's dry or crumbly, add more water, 1 to 2 tablespoons at a time, just until the dough forms a ball."
        },
        {
            "2": "Dump dough onto a floured surface. Knead until dough is smooth and bounces back when you poke it. Wrap in plastic and chill in the refrigerator for at least 30 minutes."
        },
        {
            "3": "Remove dough from the refrigerator and pull off a small chunk, about 1/2 teaspoon or smaller. Place dough at the bottom of a wooden cutting board and starting with the tips or your fingers, firmly roll up the board, like you are rolling the dough into a tube. Once the dough is at the base of your palm, keep pressure on it and pull it back and down the board, diagonally at a 45-degree angle to create a spiral shape. Repeat until all dough has been shaped."
        },
        {
            "4": "Combine garlic and pine nuts in the bowl of a food processor; process until sandy in texture. Add basil and oil and process until smooth. Stir in grated Parmesan cheese until combined. Taste and add salt if needed."
        },
        {
            "5": "Bring a large pot of lightly salted water to a boil. Add trofie and cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain."
        },
        {
            "6": "Toss cooked trofie with pesto and serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 35 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "405"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "34g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4570372.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "dips"
}