{
    "title": "Brown Sugar and Rye Shortbread",
    "Category": "Christmas Cookies",
    "Ingredients": [
        {
            "1": "1 cup butter, softened"
        },
        {
            "2": "0.5 cup packed light brown sugar"
        },
        {
            "3": "1 teaspoon vanilla extract"
        },
        {
            "4": "0.75 teaspoon cinnamon"
        },
        {
            "5": "0.5 teaspoon kosher salt"
        },
        {
            "6": "0.25 teaspoon nutmeg"
        },
        {
            "7": "0.25 teaspoon black pepper"
        },
        {
            "8": "0.5 cup all-purpose flour"
        },
        {
            "9": "2 cups dark rye flour"
        },
        {
            "10": "0.25 cup white sugar"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 325 degrees F (165 degrees C). Line 2 baking sheets with parchment paper."
        },
        {
            "2": "Stir together butter, brown sugar, vanilla, cinnamon, salt, nutmeg, and pepper in a bowl. Starting at low speed and increasing to medium, beat with an electric mixer for 30 seconds. Continue beating at medium to high speed until mixture is fluffy. Scrape down the sides of the bowl and add all-purpose flour; mix on low speed until combined. Add rye flour, 1/2 cup at a time, mixing on low, until combined."
        },
        {
            "3": "Put white sugar in a small bowl. Scoop out 1 1/2-tablespoon portions of the dough and roll into balls; roll balls in sugar."
        },
        {
            "4": "Arrange dough balls on the prepared baking sheets, spacing them about 1 inch apart. Use the bottom of a glass or other kitchen tool to flatten each dough ball a bit to press in designs."
        },
        {
            "5": "Bake until cookies are lightly browned around the edges, 22 to 24 minutes. Cool on baking sheets for 5 minutes. Transfer to a wire rack to cool completely. Store in an airtight container up to 3 days at room temperature or freeze up to 3 months."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "22 mins"
        },
        {
            "Stand Time": "5 mins"
        },
        {
            "Total Time": "42 mins"
        },
        {
            "Servings": "21 "
        },
        {
            "Yield": "21 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "157"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "18g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}