{
    "title": "Swirled Citrus Butter Cookies",
    "Category": "Christmas Cookies",
    "Ingredients": [
        {
            "1": "0.5 cup butter, softened"
        },
        {
            "2": "0.5 cup sugar"
        },
        {
            "3": "0.5 teaspoon vanilla extract"
        },
        {
            "4": "0.5 teaspoon kosher salt"
        },
        {
            "5": "1 large egg white"
        },
        {
            "6": "0.5 cups flour"
        },
        {
            "7": "1 teaspoon lime zest"
        },
        {
            "8": "0.25 teaspoon matcha powder"
        },
        {
            "9": "1 teaspoon lemon zest"
        },
        {
            "10": "0.25 teaspoon turmeric"
        },
        {
            "11": "1 coarse sugar for decorating"
        }
    ],
    "Directions": [
        {
            "1": "Stir together butter, sugar, vanilla, and salt in a large bowl. Mix with an electric mixer at low speed until ingredients start to combine, about 30 seconds. Continue beating at medium speed until mixture is fluffy, light in color, and clings to sides of the bowl. Scrape down sides of bowl."
        },
        {
            "2": "Add egg white and mix until well incorporated. Add flour and continue mixing at low speed until most of the flour is incorporated, about 30 seconds. Increase speed to medium until dough comes together."
        },
        {
            "3": "Divide dough into 2 bowls. Mix lime zest and matcha powder into 1 dough portion for the green dough, and lemon zest and turmeric to other dough portion for yellow dough."
        },
        {
            "4": "Gather dough portions into individual balls and wrap in plastic wrap. Chill until easy to handle, about 1 hour."
        },
        {
            "5": "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper."
        },
        {
            "6": "Divide each dough portion into 16 pieces. Roll each piece into a 5-inch rope. Twist a green and yellow rope together, then coil into a spiral, tucking ends under and pressing to seal. Transfer to the prepared baking sheet. Repeat rolling, twisting, and spiraling with remaining dough. Arrange cookies on the baking sheet, spacing them about 1 inch apart. Sprinkle cookies with sparkling sugar."
        },
        {
            "7": "Bake until cookies are lightly browned around the edges, about 10 minutes. Cool on the baking sheets 5 minutes. Transfer to a wire rack to cool completely. Store in an airtight container up to 3 days at room temperature or freeze up to 3 months."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Chill Time": " 1 hrs"
        },
        {
            "Cool Time": "30 mins"
        },
        {
            "Total Time": " 2 hrs 5 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "118"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "15g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}