{
    "title": "Banh Tet",
    "Category": "Lunar New Year Recipes",
    "Ingredients": [
        {
            "1": "5 cups uncooked glutinous white rice"
        },
        {
            "2": "1 tablespoon fine sea salt, divided"
        },
        {
            "3": "1 pound pork belly, skin removed"
        },
        {
            "4": "3 tablespoons fish sauce"
        },
        {
            "5": "2 large shallot, minced"
        },
        {
            "6": "1 tablespoon white sugar"
        },
        {
            "7": "1 teaspoon black pepper"
        },
        {
            "8": "1 cup dried mung beans"
        },
        {
            "9": "3 cups water"
        },
        {
            "10": "2 (16-ounce packages) frozen banana leaves, thawed"
        },
        {
            "11": "1 kitchen twine"
        }
    ],
    "Directions": [
        {
            "1": "Place rice in a colander; rinse under cold water, stirring rice with your fingers, until water runs clear, about 2 minutes. Transfer rice to a large bowl or container; add water to cover by 2 inches. Cover and refrigerate for 12 hours."
        },
        {
            "2": "While rice refrigerates, cut pork into four 1 1/4x5-inch strips. Place pork strips, fish sauce, shallot, sugar, pepper, and 1/4 teaspoon salt in a large zip-top plastic freezer bag. Seal bag, removing as much air as you can. Gently massage pork to distribute marinade. Refrigerate for 12 hours."
        },
        {
            "3": "Place mung beans in a colander; rinse under cold water, stirring with your fingers, until water runs clear, 1 to 2 minutes. Transfer mung beans to a small saucepan; add remaining 1/2 teaspoon salt and 3 cups water. Bring to a boil over high heat, stirring occasionally. Reduce heat to medium-low, and simmer, stirring occasionally, until mung beans are creamy, no longer hold their shape, and begin to stick to bottom of pot, 16 to 18 minutes."
        },
        {
            "4": "Scrape beans into the bowl of a food processor. Process until smooth, about 10 seconds. Spread pureed mung beans onto a baking sheet. Chill until cold, about 45 minutes. You'll have about 2 cups mung bean puree."
        },
        {
            "5": "While mung beans cool, gently rub banana leaves with a damp cloth to remove dirt. Using kitchen shears, cut fibrous strings off each banana leaf. You only need 12 banana leaves, but you cannot use torn leaves, and you'll want to set aside wider banana leaves for wrapping, so you'll need extras."
        },
        {
            "6": "Remove pork from marinade; discard marinade. Moisten a work surface with a damp paper towel. Lay a 14-inch long piece of plastic wrap on moistened work surface, with the long edge facing you. Using a small offset spatula, spread 1/4 cup mung bean puree in center of plastic wrap to form a 6x4-inch rectangle. Center 1 pork strip on top of the mung bean rectangle. Spoon 1/4 cup mung bean puree over the pork, and using moistened hands, spread puree all over pork to mostly enclose. Lift bottom edge of plastic wrap to begin wrapping pork mixture; continue to roll into a log. Once roll is complete, hold the ends of the plastic wrap and roll pork mixture on counter towards you to form a tight cylinder, about 5 inches long; set pork roll aside. Repeat wrapping procedure with remaining 1 1/2 cups mung bean puree and remaining 3 pork strips."
        },
        {
            "7": "Drain and transfer to a large bowl. Stir in 2 1/4 teaspoons salt. You'll have about 9 cups drained rice."
        },
        {
            "8": "Cut 36 (14-inch) lengths and 8 (28-inch) lengths of kitchen twine; set aside."
        },
        {
            "9": "Stack 3 wide banana leaves (dull-side down with lines on the leaf running running parallel to edge of work surface) on top of each other to cover an 11-inch wide area. You will probably need to overlap some of the smaller leaves in order to form the desired shape. Using kitchen shears, cut banana leaf stack to form a 11x14-inch rectangle, with the 11-inch side facing you; discard trimmed leaves and restack leaves if needed. Spoon 3/4 cup of rice onto center of banana leaf stack and spread into a 6x4-inch rectangle."
        },
        {
            "10": "Unwrap 1 of the pork rolls and center on top of rice rectangle. Spoon 3/4 cup rice over pork roll. Slowly wrap short edge of banana stack closest to you over pork roll, stopping to redistribute rice enclosing the pork, until it is snug and completely wrapped. Tie banana leaf cylinder in center with 1 (14-inch) piece of kitchen twine to secure. Working with 1 end of cylinder only, fold banana leaf ends over cylinder. Hold ends in place and then stand cylinder up on the folded end. Spoon 1/4 cup of rice into open end, and gently tap sides of banana cylinder and tap back and forth to settle rice. Seal open end of banana cylinder by tucking sides of banana leaves against rice mixture like you are wrapping a present and folding flaps down. Center 1 (28-inch) string over folded end and hold sides of string snuggly against cylinder. Hold folded end in place and flip cylinder. Open folded end."
        },
        {
            "11": "Spoon 1/4 cup of rice into open end, and gently tap sides of banana cylinder and tap back and forth to settle rice. Seal open end of banana cylinder, tucks sides of banana leaves against rice mixture like you are wrapping a present, then fold flaps down. Bring edges of string up together and tie against folded flaps; don't tie too tightly. Center 1 (28-inch) string on 1 folded end perpendicular to first string, and hold sides of string snuggly against cylinder. With your other hand, hold bottom end in place and flip cylinder. Bring edges of string up together and tie against folded flaps; don't tie too tightly. Lay banana cylinder on work surface and cut off center string (the first string we tied) with kitchen shears; discard. Using 5 (14-inch) pieces of kitchen twine, tie banana cylinder working from center out at 1 1/2-inch intervals until you reach the ends. Wrap banana cylinder tightly in a 18-inch long piece of aluminum foil. Secure center and folded ends of foil with 3 (14-inch) pieces of kitchen twine. Repeat wrapping procedure with remaining banana leaves, rice, pork rolls, and kitchen twine."
        },
        {
            "12": "Place cylinders in a large stockpot (you may need to stand cylinders on their ends.) Fill pot with water to 2 inches below the rim. Place a heat-proof lid on top of cylinders to keep submerged. Cover, and bring to boil over high heat. Uncover and continue to gently boil at medium heat, turning every 2 hours, until the internal temperature is at least 200 degrees F (92 degrees C), about 6 hours. Add additional boiling water as needed throughout cook time to keep water level 2 inches below the pot rim. Using tongs, transfer cooked banh tet to a baking sheet and let cool for at least 3 hours, or chill overnight. Remove and discard foil and banana leaves. Slice into rounds and serve. For clean slices, dip knife into warm water, and wipe clean often."
        }
    ],
    "Details": [
        {
            "Prep Time": " 2 hrs"
        },
        {
            "Cook Time": " 6 hrs 30 mins"
        },
        {
            "Additional Time": " 15 hrs 45 mins"
        },
        {
            "Total Time": "1 day 15 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "424"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "76g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9231848.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}