{
    "title": "Steamed Pork Buns",
    "Category": "Lunar New Year Recipes",
    "Ingredients": [
        {
            "1": "1 Dough-"
        },
        {
            "2": "1.0 teaspoons active dry yeast"
        },
        {
            "3": "0.25 cup warm water"
        },
        {
            "4": "0.75 cup warm milk"
        },
        {
            "5": "3 tablespoons salted butter, melted"
        },
        {
            "6": "2 teaspoons white sugar"
        },
        {
            "7": "3 cups all-purpose flour"
        },
        {
            "8": "1 Filling-"
        },
        {
            "9": "1 pound ground pork"
        },
        {
            "10": "2 cloves garlic, minced, or more to taste"
        },
        {
            "11": "0.5 teaspoon ginger paste, or more to taste"
        },
        {
            "12": "1 salt and ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Dissolve yeast in water water in a bowl. Add milk, followed by butter and sugar; mix to combine. Add flour and mix to form a dough."
        },
        {
            "2": "Knead dough until a uniform ball emerges. Cover and allow to rise in a warm place until doubled in size, about 30 minutes."
        },
        {
            "3": "Heat a large skillet over medium-high heat. Cook and stir ground pork with garlic, ginger, paste, salt, and pepper in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Set aside."
        },
        {
            "4": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Do not allow boiling water to boil through steamer surface."
        },
        {
            "5": "While water comes to a boil, divide dough into 16 equal pieces. Roll each piece into a ball and flatten into a thin, wide circle with your hands and fingers."
        },
        {
            "6": "Place 1 tablespoon of prepared filling in the center of each circle of dough. Pull the sides of the dough together around the filling, gently pinching the top of the dough together to make a flower blossom gather at the top."
        },
        {
            "7": "Place about 8 buns onto the steamer surface and cover with lid. Cook until buns rise and expand, and are spongy to the touch, about 12 minutes. Repeat with remaining buns. Watch the hot steam! Remove buns from steamer surface with tongs carefully to avoid ripping; allow to cool slightly before eating."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "16 buns"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "693"
        },
        {
            "Fat": "27g"
        },
        {
            "Carbs": "78g"
        },
        {
            "Protein": "33g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6345020.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}