{
    "title": "Thai-Inspired Steamed Chicken Thighs",
    "Category": "Lunar New Year Recipes",
    "Ingredients": [
        {
            "1": "4  bone-in chicken thighs, with skin"
        },
        {
            "2": "1 teaspoon sea salt, or to taste"
        },
        {
            "3": "1 (2 inch) piece fresh ginger, thinly sliced, or to taste"
        },
        {
            "4": "3  sliced green onions, white and green parts separated, divided"
        },
        {
            "5": "1 cup coconut juice"
        },
        {
            "6": "4 tablespoons water"
        },
        {
            "7": "4  Thai chiles, chopped"
        },
        {
            "8": "5 sprigs fresh cilantro, stems and leaves separated, divided"
        },
        {
            "9": "2 cloves garlic, chopped"
        },
        {
            "10": "1 (1 inch) piece fresh ginger, coarsely chopped"
        },
        {
            "11": "0.5 tablespoons fish sauce"
        },
        {
            "12": "1 tablespoon rice vinegar"
        },
        {
            "13": "1 tablespoon fresh lime juice"
        },
        {
            "14": "1 teaspoon palm sugar"
        },
        {
            "15": "1.0 tablespoons vegetable oil"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with 4 to 5 inches of water. Insert a large steam rack inside the pot."
        },
        {
            "2": "Season chicken thighs with salt and spread ginger slices over top. Arrange thighs in an even layer in a large, shallow, heat-proof bowl. Sprinkle white parts of green onions over top; pour in coconut juice and water. Place the bowl onto the steam rack in the pot."
        },
        {
            "3": "Cover the pot and bring water to a boil. Reduce the heat to a simmer and cook until chicken is no longer pink at the bone and the juices run clear, about 35 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C)."
        },
        {
            "4": "While the chicken is cooking, combine Thai chiles, cilantro stems, garlic, ginger, fish sauce, vinegar, lime juice, and palm sugar in a food processor; pulse until mixture is well combined. Transfer sauce to a medium bowl and stir in green parts of green onions."
        },
        {
            "5": "Heat vegetable oil in a skillet over medium heat until smoking, about 4 minutes. Remove from the heat, pour hot oil into sauce mixture, and stir to combine."
        },
        {
            "6": "Use an oven mitt or dish retriever tool to carefully remove chicken bowls from the pot. Transfer chicken to a plate; discard ginger and green onion pieces."
        },
        {
            "7": "Pour remaining cooking liquid through a sieve into sauce mixture; stir to combine."
        },
        {
            "8": "Pour sauce over chicken. Garnish with cilantro leaves."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "314"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "20g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5143620.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}