{
    "title": "Authentic Taralli",
    "Category": "Crackers",
    "Ingredients": [
        {
            "1": "4 cups all-purpose flour"
        },
        {
            "2": "0.5 teaspoon fine sea salt, divided"
        },
        {
            "3": "0.75 cup olive oil"
        },
        {
            "4": "0.75 cup dry white wine"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour, 1/4 teaspoon salt, oil, and wine in a stand mixer. Mix ingredients using the paddle attachment until a ball forms. Switch to the dough hook and knead dough for 10 minutes."
        },
        {
            "2": "Line a baking sheet with parchment paper. Bring a large pot of water to boil over high heat and add the remaining salt. Spread a large, clean cloth out on a counter or table."
        },
        {
            "3": "Pinch off a walnut-sized piece of dough once kneading has finished. Roll dough piece into a snake about 2 1/2 inches long. Form a tear drop shape, lightly pressing the two ends together to seal them into a ring. Repeat with remaining dough."
        },
        {
            "4": "Turn down the boiling water to a low boil. Drop taralli into the water a few at a time. Do not stir; they will sink at first, then begin to float. Remove floating taralli with a slotted spoon. Place them on the clean cloth and continue until all the taralli have boiled and are drained on the cloth. Place them on the prepared baking sheet."
        },
        {
            "5": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "6": "Bake in the preheated oven until taralli are golden and firm on the outside, but still soft on the inside, about 40 minutes. Cool completely and rest for at least 1 hour before serving. Wrap with a clean cloth or place in a paper bag; store at room temperature for up to 1 week."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs 35 mins"
        },
        {
            "Servings": "60 "
        },
        {
            "Yield": "60 taralli"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "57"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "6g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8109992.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7999235.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}