{
    "title": "Flaky Parmesan Crackers",
    "Category": "Crackers",
    "Ingredients": [
        {
            "1": "1 Dough-"
        },
        {
            "2": "2 cups all-purpose flour"
        },
        {
            "3": "2 cups finely grated Parmesan cheese"
        },
        {
            "4": "0.25 cup cold unsalted butter, cut into pieces"
        },
        {
            "5": "1 teaspoon salt"
        },
        {
            "6": "1 teaspoon dry mustard"
        },
        {
            "7": "0.5 cup whipping cream"
        },
        {
            "8": "1 Glaze-"
        },
        {
            "9": "1 large egg, beaten"
        },
        {
            "10": "0.5 cup finely grated Parmesan cheese"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour, Parmesan cheese, butter, salt, and mustard for dough in the bowl of a food processor; pulse until mixture is well combined and resembles bread crumbs. Pour 1/2 of the cream in slowly, with the processor running, until combined. Continue adding remaining cream, a little at a time, until dough has come together in clumps and feels like a damp, but not sticky, slightly over-processed pastry dough."
        },
        {
            "2": "Gather dough into a ball, then roll into a log. Wrap in plastic and place in the refrigerator to chill for 30 minutes or longer."
        },
        {
            "3": "Preheat the oven to 400 degrees F (200 degrees C)."
        },
        {
            "4": "Cut dough into quarters, then cut each quarter into 8 pieces. Lightly flour each piece as needed and feed through one of the thinnest settings of a pasta roller to make irregularly shaped, oblong crackers that are about 1/16 inch thick, 2 inches wide, and 8 inches long. Alternatively, use a rolling pin to roll dough out on a lightly floured countertop, and cut into any shape you wish."
        },
        {
            "5": "Working in batches, lay crackers on a baking sheet. Brush with beaten egg and sprinkle with Parmesan."
        },
        {
            "6": "Bake each batch in the preheated oven until crackers are browned at the edges, golden in the middle, and fully cooked through, 8 to 9 minutes. They will crisp as they cool."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 30 mins"
        },
        {
            "Servings": "32 "
        },
        {
            "Yield": "32 crackers"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "84"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "6g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [],
    "main category": "flour"
}