{
    "title": "Butternut Squash Ravioli with Brown Butter Sauce",
    "Category": "Ravioli",
    "Ingredients": [
        {
            "1": "1 Filling-"
        },
        {
            "2": "1  butternut squash, peeled and cubed"
        },
        {
            "3": "1 tablespoon olive oil"
        },
        {
            "4": "2 cloves garlic"
        },
        {
            "5": "4 tablespoons ricotta cheese"
        },
        {
            "6": "2 tablespoons grated Parmesan cheese"
        },
        {
            "7": "0.5 tablespoons brown sugar"
        },
        {
            "8": "1 teaspoon salt"
        },
        {
            "9": "1 Pasta-"
        },
        {
            "10": "1 cup semolina flour"
        },
        {
            "11": "1 cup all-purpose flour"
        },
        {
            "12": "1 teaspoon salt"
        },
        {
            "13": "3 large eggs"
        },
        {
            "14": "2 tablespoons olive oil"
        },
        {
            "15": "1 Sauce-"
        },
        {
            "16": "0.5 cup canola oil"
        },
        {
            "17": "10  fresh sage leaves, or as needed"
        },
        {
            "18": "10 tablespoons butter"
        },
        {
            "19": "1 teaspoon chopped fresh tarragon"
        },
        {
            "20": "1 teaspoon chopped fresh thyme"
        },
        {
            "21": "1 pinch salt"
        },
        {
            "22": "0.25 cup shredded Parmesan cheese, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C)."
        },
        {
            "2": "Rub squash down with 1 tablespoon olive oil and place on a baking sheet. Cut the tops off of each clove of garlic, rub with oil, and wrap in foil. Place on the baking sheet."
        },
        {
            "3": "Roast in the preheated oven until squash and garlic cloves are soft and browned, about 30 minutes."
        },
        {
            "4": "Remove squash and garlic from the oven. Remove the garlic skin and transfer to the bowl of a food processor. Add squash along with ricotta, grated Parmesan, brown sugar, and salt for filling. Blend into a thick paste. Transfer to a bowl, cover, and set in the refrigerator until cool."
        },
        {
            "5": "While squash is roasting, whisk semolina, all-purpose flour, and salt for pasta together in a bowl. Dump onto a counter and push flour into a mound. Dig a well in the center. Crack eggs into the well and add 2 tablespoons olive oil. Start folding flour and egg onto each other; continue kneading and folding until it comes together as a dough. Add more flour or oil if it is too wet or dry, respectively. The final product should look smooth, and the dough should bounce back if you press your thumb into it. Cover with plastic wrap and let rest for 30 minutes."
        },
        {
            "6": "If you have a pasta maker, pass the pasta through to make a pasta sheet about the thickness of a dime. If not, get to work with a roller on a lightly floured surface. Make several sheets."
        },
        {
            "7": "On one sheet, dollop about 2 tablespoons of squash filling 2 inches apart. Place another sheet over top and press the dough down around each lump of filling. Try to keep it tight, as you don't want a lot of air in the interior. But don't go too close, or you'll have filling trapped between pasta layers and ruin the seal. Use a ravioli stamp to stamp out and seal each ravioli. Set aside."
        },
        {
            "8": "In another pan, heat a thin layer of canola oil over medium heat. Working in batches, fry sage leaves until dark green and crispy. Remove to paper towel-lined plate to strain grease. Set aside."
        },
        {
            "9": "Melt butter in a small saucepan over medium heat; simmer, stirring frequently, until browned, fragrant, and foamy, with brown bits in it, 5 to 10 minutes. Reduce heat to medium-low. Stir in tarragon, thyme, and salt."
        },
        {
            "10": "While sauce is being prepared, bring a pot of lightly salted water to a rolling boil. Add raviolis and boil until they float, about 5 minutes. Drain and plate."
        },
        {
            "11": "Ladle butter sauce over pasta and garnish with fried sage. Sprinkle with shredded Parmesan cheese and serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 45 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "759"
        },
        {
            "Fat": "50g"
        },
        {
            "Carbs": "67g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7973776.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}