{
    "title": "Lobster Ravioli",
    "Category": "Ravioli",
    "Ingredients": [
        {
            "1": "0.5 cups all-purpose flour, plus more for dusting"
        },
        {
            "2": "2 large eggs"
        },
        {
            "3": "1 teaspoon kosher salt, divided"
        },
        {
            "4": "0.75 cup mascarpone cheese"
        },
        {
            "5": "6 tablespoons cold unsalted butter, divided"
        },
        {
            "6": "3 cloves garlic, finely chopped"
        },
        {
            "7": "1 large shallot, finely chopped"
        },
        {
            "8": "1 tablespoon finely chopped fresh chives"
        },
        {
            "9": "1 tablespoon finely chopped fresh basil"
        },
        {
            "10": "1 tablespoon finely chopped fresh tarragon leaves"
        },
        {
            "11": "1 tablespoon fresh lemon juice"
        },
        {
            "12": "2 teaspoons grated lemon zest"
        },
        {
            "13": "0.25 teaspoon ground black pepper"
        },
        {
            "14": "8 ounces cooked lobster meat, cut into bite-size pieces"
        },
        {
            "15": "0.75 cup bottled clam juice"
        },
        {
            "16": "0.5 cup dry white wine"
        },
        {
            "17": "0.75 cup heavy whipping cream"
        },
        {
            "18": "1 cup cherry tomatoes, halved"
        },
        {
            "19": "1 fresh herbs, for garnish"
        }
    ],
    "Directions": [
        {
            "1": "Place flour in a large bowl and create a well in the center. Add eggs and 1/4 teaspoon salt to well; beat using a fork to break up egg mixture. Slowly begin to incorporate flour into egg mixture, stirring from the center and gradually working outwards until shaggy pieces of dough begin to form. Use your hands to bring shaggy dough pieces together to form a shaggy ball. Transfer shaggy ball and any remaining flour in bowl to a clean work surface. Knead, pressing any loose flour into dough, until dough is smooth and elastic, 10 to 12 minutes."
        },
        {
            "2": "Wrap dough tightly in plastic wrap; let rest at room temperature at least 1 hour or up to 2 hours, or in a refrigerator up to 1 day. (If refrigerating, let come to room temperature before rolling.)"
        },
        {
            "3": "Place mascarpone in a small bowl; set aside. Melt 2 tablespoons butter in a medium skillet over medium heat. Add garlic and shallot; cook, stirring often, until softened, about 2 minutes. Stir shallot mixture into mascarpone in bowl along with herbs, lemon zest and juice, pepper, and remaining salt until combined. Gently stir in lobster. Chill, covered, for 15 minutes."
        },
        {
            "4": "While lobster filling chills, unwrap dough, and divide evenly into 2 portions. Place 1 dough portion on a clean work surface; wrap remaining dough portion in plastic wrap. Shape dough into a rectangle; press dough to flatten using heel of hand. Starting with the widest setting, pass dough through pasta machine 2 times. Fold the outer tapered ends of pasta sheet in toward the center like an envelope, so that the width of the pasta sheet is similar to the width of the pasta roller. Pass pasta sheet through widest setting 1 more time. Continue rolling pasta through machine, reducing roller width 1 notch at a time, until sheet is about 1/16-inch thick and you can see the outline of your hand through the sheet. Cut sheet in half crosswise to make them easier to work with. Cover 1 sheet loosely with plastic wrap. Lightly dust work surface with flour and place remaining dough sheet on surface."
        },
        {
            "5": "Leaving a 1-inch edge from the short sides of the dough sheet, place 1-tablespoon mounds of lobster filling 2 inches apart along center of sheet (about 4 to 6 mounds per sheet). Lightly brush dough around lobster filling with water. Loosely lift long edge of dough sheet and fold over filling, lining up edges. Press on dough around each mound to seal and press out air pockets. Using a fluted pastry wheel or pizza cutter, trim the unfolded edge of the ravioli. Cut pasta between mounds to form individual ravioli. Place ravioli on a baking sheet lined with a clean kitchen towel. Cover with a second clean kitchen towel. Repeat process with remaining pasta sheet, dough, and filling."
        },
        {
            "6": "Cut remaining 4 tablespoons butter into 4 pieces. Bring clam juice and wine to a simmer in a large skillet over high heat. Simmer, undisturbed, until reduced to about 1/3 cup, about 7 minutes. Gradually stir in remaining 4 tablespoons butter, one piece at a time, waiting until butter is nearly melted before adding the next piece. Stir in heavy cream. Cook over high heat, stirring often, until sauce is thick enough to lightly coat back of a spoon, about 2 minutes. Stir in tomatoes. Remove from heat and cover to keep warm."
        },
        {
            "7": "Bring a large pot of salted water to a boil over high heat. Working in 2 batches if needed, boil ravioli until tender, 4 to 6 minutes. Drain. Divide ravioli among 4 plates. Drizzle cream sauce evenly over ravioli. Garnish with herbs."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 1 hrs 15 mins"
        },
        {
            "Total Time": " 2 hrs 40 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "799"
        },
        {
            "Fat": "57g"
        },
        {
            "Carbs": "45g"
        },
        {
            "Protein": "25g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}