{
    "title": "Pumpkin Ravioli with Sage-Brown Butter Sauce",
    "Category": "Ravioli",
    "Ingredients": [
        {
            "1": "1 Pasta-"
        },
        {
            "2": "3 cups all-purpose flour"
        },
        {
            "3": "3 tablespoons all-purpose flour"
        },
        {
            "4": "4 large eggs"
        },
        {
            "5": "2 teaspoons salt"
        },
        {
            "6": "1 tablespoon water"
        },
        {
            "7": "1 Filling-"
        },
        {
            "8": "1 small pumpkin"
        },
        {
            "9": "1 tablespoon olive oil"
        },
        {
            "10": "0.25 cup diced onion"
        },
        {
            "11": "2 tablespoons finely chopped fresh sage"
        },
        {
            "12": "1 tablespoon heavy cream"
        },
        {
            "13": "1 large egg"
        },
        {
            "14": "1 salt and ground black pepper to taste"
        },
        {
            "15": "1 Sauce-"
        },
        {
            "16": "0.5 cup salted butter"
        },
        {
            "17": "2 tablespoons finely chopped fresh sage"
        },
        {
            "18": "1 salt and ground black pepper to taste"
        },
        {
            "19": "0.25 cup shredded Parmesan cheese"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour, eggs, and salt in the bowl of a food processor; pulse until dough holds together. Transfer to a clean work surface and knead until smooth, about 10 minutes. If dough feels too dry, add water, a little at a time, and continue kneading. Wrap dough in plastic wrap and refrigerate for at least 30 minutes."
        },
        {
            "2": "Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil."
        },
        {
            "3": "Wash pumpkin, slice into 8 pieces, and discard seeds. Transfer pumpkin slices to the prepared baking sheet and cover with another sheet of foil to create a steaming pouch."
        },
        {
            "4": "Cook pumpkin in the preheated oven until tender, about 30 minutes. Remove and let cool."
        },
        {
            "5": "While pumpkin is cooling, heat oil in a small pan over medium heat. Add onion and sage; cook and stir until onion is soft and translucent, about 5 minutes. Remove from heat."
        },
        {
            "6": "Scoop pumpkin flesh out of the skin and into a stand mixer. Add onion mixture and heavy cream; beat for a bit until mixture cools down. Mix in egg, salt, and pepper; set filling aside."
        },
        {
            "7": "Lightly flour a work surface. Remove pasta dough from the refrigerator and divide into 8 equal portions. Shape each portion into an oval-shaped flat disc. Run each disc through a pasta roller until it reaches the desired thickness and you have 8 long sheets of pasta. Lightly dust each sheet with flour."
        },
        {
            "8": "Lay one sheet of pasta on your work surface. Drop tablespoonfuls of filling for each ravioli evenly down the length of the sheet, then lay a second sheet of pasta on top. Use your fingers to press down and seal the pasta around each bit of filling, and cut ravioli with a pasta cutter or round glass. Repeat three more times with remaining 6 sheets of pasta and filling."
        },
        {
            "9": "Bring a large pot of lightly salted water to a boil. Cook ravioli in batches in the boiling water until tender yet firm to the bite, 3 to 5 minutes per batch."
        },
        {
            "10": "Meanwhile, heat butter and sage for sauce in a large saucepan over medium heat. Bring to a simmer and cook, stirring frequently, until butter is browned, fragrant, and foamy, with brown bits in it, 5 to 10 minutes. Be careful not to burn it. Season with salt and pepper. Add cooked ravioli to the sauce and sprinkle with Parmesan cheese."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 55 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "374"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "42g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2483980.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}