{
    "title": "Instant Pot® Chicken Enchiladas",
    "Category": "Instant Pot® Recipes",
    "Ingredients": [
        {
            "1": "0.5 teaspoons chili powder"
        },
        {
            "2": "1 teaspoon salt"
        },
        {
            "3": "1 teaspoon ground cumin"
        },
        {
            "4": "0.5 pounds skinless, boneless chicken breasts, or more to taste"
        },
        {
            "5": "0.5 cup chicken broth"
        },
        {
            "6": "3 cups shredded Monterey Jack cheese, divided"
        },
        {
            "7": "2 (10 ounce) cans green enchilada sauce, divided"
        },
        {
            "8": "1 (4 ounce) can chopped green chilies"
        },
        {
            "9": "0.5 cup chopped onion"
        },
        {
            "10": "2  jalapeno peppers, chopped, or more to taste"
        },
        {
            "11": "1 olive oil"
        },
        {
            "12": "16  corn tortillas, or more to taste"
        },
        {
            "13": "1 (10 ounce) can enchilada sauce"
        }
    ],
    "Directions": [
        {
            "1": "Mix chili powder, salt, and cumin together in a bowl. Rub mixture over the chicken."
        },
        {
            "2": "Pour chicken broth into a multi-functional pressure cooker (such as Instant Pot®). Add a rack to the bottom of the pot and place seasoned chicken on top. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 5 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "3": "Combine 2 cups Monterey Jack cheese, 1 can green enchilada sauce, green chiles, onions, and jalapenos in a large mixing bowl. Stir to thoroughly blend."
        },
        {
            "4": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a baking dish."
        },
        {
            "5": "Release pressure using the natural-release method according to manufacturer's instructions for 5 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid."
        },
        {
            "6": "Transfer cooked chicken to a cutting board and shred or chop into small pieces. Add to the mixing bowl with the cheese mixture. Stir until chicken mixture is blended."
        },
        {
            "7": "Heat olive oil in a skillet. Soften tortillas 1 at a time by dipping into the hot oil for 2 to 3 seconds per side. Drain on paper towels."
        },
        {
            "8": "Spoon 2 to 3 tablespoons chicken mixture onto a tortilla, roll up, and place seam-side down into the prepared baking dish. Repeat with remaining tortillas and mixture."
        },
        {
            "9": "Combine 1 can green enchilada sauce and red enchilada sauce in a bowl and pour over enchiladas in the baking dish. Sprinkle remaining 1 cup Monterey Jack cheese on top."
        },
        {
            "10": "Bake in the preheated oven for 20 to 25 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 enchiladas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "222"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "16g"
        },
        {
            "Protein": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9175577.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9125322.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9123812.jpg"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8344565.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}