{
    "title": "Instant Pot® Swiss Steak",
    "Category": "Instant Pot® Recipes",
    "Ingredients": [
        {
            "1": "0.5 pounds bottom round steak, 1 inch thick and trimmed of fat"
        },
        {
            "2": "1 salt and freshly ground black pepper to taste"
        },
        {
            "3": "0.25 cup all-purpose flour"
        },
        {
            "4": "2 tablespoons avocado oil, divided, or as needed"
        },
        {
            "5": "1 medium onion, chopped"
        },
        {
            "6": "0.5 cup carrot, chopped"
        },
        {
            "7": "0.5 cup chopped celery"
        },
        {
            "8": "1  green bell pepper, chopped (Optional)"
        },
        {
            "9": "2 cloves garlic, finely chopped"
        },
        {
            "10": "0.25 cup Merlot wine"
        },
        {
            "11": "1.5 cups canned chopped Italian-style tomatoes in juice"
        },
        {
            "12": "1 tablespoon Worcestershire sauce"
        },
        {
            "13": "1 teaspoon salt"
        },
        {
            "14": "1 teaspoon oregano"
        },
        {
            "15": "1 teaspoon paprika"
        }
    ],
    "Directions": [
        {
            "1": "Dry steak well with paper towels and cut into four 4-inch pieces. Season with salt and pepper."
        },
        {
            "2": "Place flour into a shallow bowl. Dredge steak pieces in flour, shaking off excess."
        },
        {
            "3": "Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Once the pot is hot, add 1 tablespoon avocado oil. Brown the steak in batches, so you don't crowd the pot, 2 minutes per side. Transfer browned meat to a warm plate and set aside."
        },
        {
            "4": "Add 1 tablespoon of avocado oil to the pot and cook onion, carrot, celery, and bell pepper until onions are soft and translucent, 3 to 4 minutes. Stir in garlic and cook until fragrant, about 1 minute. Deglaze the pot with Merlot. Mix in tomatoes, Worcestershire sauce, 1 teaspoon salt, oregano, and paprika. Return steak to the pot and push down into the tomato mixture."
        },
        {
            "5": "Close and lock the lid. Select manual pressure according to manufacturer's instructions; set timer for 30 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "6": "Allow pressure to release naturally according to manufacturer's instructions for 5 minutes. Carefully open the valve to release the remaining pressure, about 5 minutes more. Unlock and remove the lid."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "337"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "28g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7071713.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}