{
    "title": "Blueberry Lemon Cheesecake Bars",
    "Category": "Lemon Bars",
    "Ingredients": [
        {
            "1": "1 Crust-"
        },
        {
            "2": "0.5 (14.4 ounce) package graham crackers, coarsely broken"
        },
        {
            "3": "3 tablespoons white sugar"
        },
        {
            "4": "0.75 teaspoon ground cinnamon"
        },
        {
            "5": "6 tablespoons unsalted butter, melted"
        },
        {
            "6": "1 Filling-"
        },
        {
            "7": "3 (8 ounce) packages cream cheese, at room temperature"
        },
        {
            "8": "0.75 cup white sugar"
        },
        {
            "9": "3 medium lemons, zested and juiced"
        },
        {
            "10": "3 large eggs"
        },
        {
            "11": "1.0 cups fresh blueberries"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 325 degrees F (165 degrees C). Grease the bottom of an 8-inch square baking pan. Place parchment paper over the top of the pan and press down at the corners so you have a slight overhang."
        },
        {
            "2": "Combine graham crackers, sugar, and cinnamon for crust in the bowl of a food processor; process until combined and has the consistency of bread crumbs. Pour melted butter in slowly and pulse a couple of times to fully incorporate; the mixture will look like wet sand. Scrape into the prepared baking pan and pat firmly with the bottom of a glass."
        },
        {
            "3": "Bake in the preheated oven until set, about 12 minutes."
        },
        {
            "4": "Combine cream cheese, sugar, lemon zest, and lemon juice for filling in the bowl of a food processor; pulse until well combined. Add eggs, one at a time, blending to combine between each addition; process until smooth."
        },
        {
            "5": "Remove crust from the oven. Pour filling on top and sprinkle evenly with blueberries; they will sink slightly into the filling, this is okay."
        },
        {
            "6": "Bake until filling is mostly set and only slightly jiggly in the center, about 45 minutes. Remove from the oven and let cool completely, about 30 minutes. Refrigerate until set, at least 3 hours."
        },
        {
            "7": "Remove from the pan using the parchment lining and slice into 12 bars."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": " 3 hrs 30 mins"
        },
        {
            "Total Time": " 4 hrs 40 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 bars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "314"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "28g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}