{
    "title": "Cream Cheese Lemon Bars",
    "Category": "Lemon Bars",
    "Ingredients": [
        {
            "1": "1 cooking spray"
        },
        {
            "2": "3 tablespoons white sugar"
        },
        {
            "3": "2 medium lemons, zested and juiced, divided"
        },
        {
            "4": "2 (8 ounce) packages refrigerated crescent roll dough (such as Pillsbury® Recipe Creations®), divided"
        },
        {
            "5": "2 (8 ounce) packages cream cheese, softened"
        },
        {
            "6": "0.5 cup white sugar"
        },
        {
            "7": "2 tablespoons unsalted butter, melted"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Line the bottom and sides of a 9x13-inch dish with aluminum foil and spray with cooking spray."
        },
        {
            "2": "Mix 3 tablespoons sugar with 1/4 of the lemon zest; set aside."
        },
        {
            "3": "Unroll one piece of crescent dough and press in the bottom of the prepared dish, stretching dough to the edges."
        },
        {
            "4": "Mix lemon juice and remaining lemon zest in a large bowl. Add cream cheese and 1/2 cup white sugar; beat with an electric mixer until smooth and creamy. Spread over the crescent dough in the pan."
        },
        {
            "5": "Unroll the second piece of crescent dough and layer over the cream cheese mixture, gently stretching dough to the edges. Brush melted butter on top and sprinkle with reserved sugar-lemon zest mixture."
        },
        {
            "6": "Bake in the preheated oven until top is golden brown, about 30 minutes."
        },
        {
            "7": "Remove from the oven and cool on a wire rack for 20 minutes. Lift lemon bars from the baking dish using the foil; transfer to a cutting board. Cut into 24 squares, leaving bars on the foil. Lift the foil and transfer the bars back into the baking dish. Refrigerate until chilled, at least 1 hour."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 1 hrs 20 mins"
        },
        {
            "Total Time": " 2 hrs 10 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "24 bars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "171"
        },
        {
            "Fat": "12g"
        },
        {
            "Carbs": "15g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}