{
    "title": "Quince-Apple Sauce",
    "Category": "Applesauce",
    "Ingredients": [
        {
            "1": "2 cups water"
        },
        {
            "2": "1 pound quinces - peeled, cored, and diced"
        },
        {
            "3": "0.5  lemon, juiced"
        },
        {
            "4": "1 pound apples - peeled, cored and chopped"
        },
        {
            "5": "0.5 cup sugar, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Inspect two 16-ounce jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until apple sauce is ready. Wash new, unused lids and rings in warm soapy water."
        },
        {
            "2": "Combine water, quinces, and lemon juice in a pot over medium heat. Bring to a boil, reduce heat, and simmer until softened, 8 to 10 minutes. Add apples and sugar and simmer until all fruit is very soft, 10 to 15 minutes. Remove from heat and strain through a sieve."
        },
        {
            "3": "Reheat apple-quince mixture until hot, stirring constantly."
        },
        {
            "4": "Immediately pack quince-apple sauce into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any spills. Top with lids and screw rings on tightly."
        },
        {
            "5": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for for 5 minutes."
        },
        {
            "6": "Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Additional Time": " 12 hrs"
        },
        {
            "Total Time": " 12 hrs 50 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "223"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "60g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5791051.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5791047.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "drinks"
}