{
    "title": "Instant Pot Tamales",
    "Category": "Tamales",
    "Ingredients": [
        {
            "1": "1 (8 ounce) package dried corn husks"
        },
        {
            "2": "1 Pork Filling-"
        },
        {
            "3": "2 cups water, or more as needed"
        },
        {
            "4": "2 cups coarsely chopped onion"
        },
        {
            "5": "3 cloves garlic, smashed"
        },
        {
            "6": "1 tablespoon chili powder"
        },
        {
            "7": "2 teaspoons kosher salt"
        },
        {
            "8": "1 teaspoon chipotle chile powder"
        },
        {
            "9": "1 teaspoon ground cumin"
        },
        {
            "10": "1 (3 pound) boneless pork shoulder"
        },
        {
            "11": "1 Salsa Roja (Red Sauce)-"
        },
        {
            "12": "3 cups chicken stock, divided"
        },
        {
            "13": "2 medium Roma tomatoes, quartered"
        },
        {
            "14": "8  Armenian chile peppers, seeded and sliced"
        },
        {
            "15": "2  de arbol chile peppers"
        },
        {
            "16": "4 cloves garlic"
        },
        {
            "17": "0.5 teaspoons ground cumin"
        },
        {
            "18": "0.5 teaspoons kosher salt"
        },
        {
            "19": "0.5 teaspoon onion powder"
        },
        {
            "20": "1 Masa Mixture-"
        },
        {
            "21": "4 cups instant corn masa"
        },
        {
            "22": "1.0 teaspoons kosher salt, divided"
        },
        {
            "23": "1 teaspoon baking powder"
        },
        {
            "24": "1 cup lard, melted"
        },
        {
            "25": "2 cups warm water, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Place 20 dried husks in a large Dutch oven and cover with water. Place a plate or bowl filled with water on top of husks to keep submerged. Let soak for at least 2 hours, flipping occasionally until husks are softened."
        },
        {
            "2": "Meanwhile, prepare the filling: Combine 2 cups water, onion, garlic, chili powder, salt, chipotle powder, and cumin in a multi-functional pressure cooker (such as Instant Pot). Cut pork shoulder into 4 equal pieces and add to the pot. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 60 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "3": "While the filling is cooking, prepare the sauce: Place 2 cups chicken stock, tomatoes, chiles, and garlic in a saucepan over medium-high heat; bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until tomatoes are fully softened, about 30 minutes."
        },
        {
            "4": "Transfer sauce mixture into a blender; Cover and hold the lid down with a potholder; pulse a few times before leaving on to blend until completely smooth, 2 to 3 minutes."
        },
        {
            "5": "Transfer blended mixture back into the saucepan; stir in remaining 1 cup chicken stock, cumin, 1 teaspoon salt, and onion powder. Bring to a simmer over medium-high heat, then reduce heat to low and cook, stirring occasionally, until sauce has thickened and color is a deeper red, about 30 minutes."
        },
        {
            "6": "When the filling has finished cooking, release pressure using the natural-release method according to manufacturer's instructions for 10 minutes, then use the quick-release method to release remaining pressure, 1 to 2 minutes. Unlock and remove the lid."
        },
        {
            "7": "Remove pork to a shallow baking dish; discard any fat and shred using 2 forks. Place shredded meat in a bowl. Stir 1 cup of the prepared red sauce and remaining 1/2 teaspoon salt into shredded pork to coat; set filling aside. Set remaining sauce aside for serving."
        },
        {
            "8": "Strain cooking liquid through a fine mesh strainer and discard solids. Skim as much grease as possible from the liquid. Reserve 1 cup strained cooking liquid for cooking the masa and discard any remaining."
        },
        {
            "9": "To make the dough: Combine masa, 2 teaspoons salt, and baking powder in a stand mixer fitted with the paddle attachment; mix on low speed until completely combined, 1 to 2 minutes. Increase speed to medium and gradually add melted, warm lard alternately with 1 cup reserved, warm cooking liquid and 2 cups warm water; beat until dough is completely combined. Increase speed to medium-high and beat until dough is light and fluffy, 4 to 5 minutes. The dough should resemble a loose cookie dough; adjust by adding 1 tablespoon of warm water at a time, if needed."
        },
        {
            "10": "Drain water from corn husks. One at a time, flatten out each husk, with the narrow end facing you, and spread approximately 1/4 cup masa mixture onto the top 2/3 of the husk. Spread about 1 tablespoon of meat mixture down the middle of the masa. Roll up the corn husk starting at one of the long sides. Fold the narrow end of the husk onto the rolled tamale and tie with a piece of butcher's twine."
        },
        {
            "11": "Stand tamales vertically, open-side up, in the steamer basket of the Instant Pot. Place the trivet in the cooker and add 2 cups of water. Place the steamer basket on the trivet, and close and lock the lid. Select high pressure and set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "12": "Release pressure using the natural-release method according to manufacturer's instructions for 10 minutes, then use the quick-release method to release remaining pressure, 1 to 2 minutes. Unlock and remove the lid. Allow tamales to rest in the cooker for 10 minutes before serving. Meanwhile, warm the remaining sauce to serve with tamales."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": " 2 hrs"
        },
        {
            "Total Time": " 3 hrs"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "20 tamales"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "683"
        },
        {
            "Fat": "47g"
        },
        {
            "Carbs": "45g"
        },
        {
            "Protein": "24g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9419649.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}