{
    "title": "Beyond Beef Vegan Meatballs",
    "Category": "Meatballs",
    "Ingredients": [
        {
            "1": "1 (10 ounce) package frozen chopped spinach"
        },
        {
            "2": "2 tablespoons water"
        },
        {
            "3": "2 (16 ounce) packages Beyond Meat® Beyond Beef® plant-based ground"
        },
        {
            "4": "0.75 cup nutritional yeast"
        },
        {
            "5": "0.75 cup vegan bread crumbs (such as Aleia's)"
        },
        {
            "6": "4 tablespoons tomato paste"
        },
        {
            "7": "5 cloves garlic, minced"
        },
        {
            "8": "1 tablespoon dried oregano leaves"
        },
        {
            "9": "1 tablespoon dried basil leaves"
        },
        {
            "10": "1 teaspoon onion powder"
        },
        {
            "11": "0.5 teaspoon salt"
        },
        {
            "12": "0.5 teaspoon ground black pepper"
        },
        {
            "13": "4 tablespoons olive oil, divided, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine frozen spinach and water in a 1-quart microwave-safe casserole dish. Cover and microwave on high for 5 minutes, stirring halfway through the cooking time. Break up any clumps with a fork and cook for 1 more minute. Transfer to a colander to drain. When cool enough to handle, squeeze small handfuls of spinach to release remaining water and place spinach in a large mixing bowl."
        },
        {
            "2": "Add Beyond Beef, nutritional yeast, bread crumbs, tomato paste, minced garlic, oregano, basil, onion powder, salt, and pepper to the spinach. Mix with your hands until all ingredients are thoroughly combined. Roll into 1 1/4-inch diameter meatballs."
        },
        {
            "3": "Preheat oven to 400 degrees F (200 degrees C). Line a large rimmed baking sheet with parchment paper."
        },
        {
            "4": "Heat 1 tablespoon olive oil over medium heat in a large Dutch oven. Working in batches, add about 12 meatballs and cook, turning often and being careful not to burn, until browned on all sides, about 5 to 7 minutes. Transfer meatballs to the prepared baking sheet, and repeat with remaining batches."
        },
        {
            "5": "Bake in the preheated oven until heated through, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "48 meatballs"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "411"
        },
        {
            "Fat": "26g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "29g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7635186.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}