{
    "title": "Overnight Eggnog",
    "Category": "Eggnog",
    "Ingredients": [
        {
            "1": "4 cups whole milk"
        },
        {
            "2": "1 tablespoon ground cinnamon"
        },
        {
            "3": "2 teaspoons vanilla extract"
        },
        {
            "4": "1 teaspoon ground cloves"
        },
        {
            "5": "12 large egg yolks"
        },
        {
            "6": "1 cup cane sugar"
        },
        {
            "7": "1 pint whipping cream"
        },
        {
            "8": "0.5 teaspoons ground nutmeg"
        }
    ],
    "Directions": [
        {
            "1": "Combine milk, cinnamon, vanilla, and cloves in a medium pot over medium-high heat. Cook, stirring every so often, until spices become one with the milk, 3 to 5 minutes. Be sure to stir from the bottom of the pot so the milk doesn't burn."
        },
        {
            "2": "Meanwhile, whisk egg yolks and cane sugar together in a large mixing bowl until pale yellow, thick, and smooth."
        },
        {
            "3": "Remove milk mixture from the stove. Pour some of the hot milk into the egg yolk mixture, whisking quickly to avoid scrambling the eggs. Continue, pouring a little bit at a time and whisking, until all has been added."
        },
        {
            "4": "Pour the mixture back into the pot and place over medium heat. Stir constantly with a spatula until eggnog thickens and becomes light beige in color, about 5 minutes; it should leave a slight film on the spatula. Remove from the heat."
        },
        {
            "5": "Pour whipping cream and nutmeg into a pitcher. Pour eggnog mixture into the whipping cream and mix with the spatula to combine. Place in the refrigerator, 8 hours to overnight for best enjoyment. Stir before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 8 hrs"
        },
        {
            "Total Time": " 8 hrs 25 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "400"
        },
        {
            "Fat": "33g"
        },
        {
            "Carbs": "18g"
        },
        {
            "Protein": "9g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8923305.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "drinks"
}