{
    "title": "Calzagatti (Pan-Fried Polenta and Beans)",
    "Category": "Polenta",
    "Ingredients": [
        {
            "1": "3 cups water"
        },
        {
            "2": "0.5 teaspoon salt"
        },
        {
            "3": "1 cup polenta"
        },
        {
            "4": "1 teaspoon olive oil"
        },
        {
            "5": "0.5 ounces guanciale, minced"
        },
        {
            "6": "0.25 cup minced white onion"
        },
        {
            "7": "1 sprig fresh rosemary, leaves stripped and finely chopped"
        },
        {
            "8": "1 clove garlic, whole"
        },
        {
            "9": "1 cup Romano (cranberry) beans, rinsed and drained"
        },
        {
            "10": "0.25 cup canned, diced tomatoes"
        },
        {
            "11": "1 cheesecloth"
        },
        {
            "12": "0.25 cup light vegetable oil, divided"
        }
    ],
    "Directions": [
        {
            "1": "Bring 3 cups of water to boil in a large pot. Add 1/2 teaspoon salt. Sprinkle in polenta, whisking constantly, to avoid lumps from forming. Reduce heat and simmer, stirring often, until polenta is creamy and no longer gritty, 15 to 20 minutes. Turn off the heat."
        },
        {
            "2": "While polenta is cooking, heat 1 teaspoon olive oil in a skillet. Add guanciale and saute until crispy. Add minced onion, garlic clove, and rosemary and cook until garlic is lightly browned and fragrant but not burned, about 1 minute. Remove and discard garlic clove. Stir in cranberry beans and tomatoes and simmer until thickened a bit, about 5 minutes."
        },
        {
            "3": "Fold bean mixture into polenta and mix well. Pour into a 9-inch square glass dish or silicone cake pan and allow to cool, about 30 minutes."
        },
        {
            "4": "Flip cooled polenta over and set out, covered with cheesecloth, to air-dry until most of the moisture has evaporated, 8 hours to overnight."
        },
        {
            "5": "Cut dried polenta into 2x3-inch rectangles."
        },
        {
            "6": "Heat a pan over medium-high heat and add 2 tablespoons oil. Add a few polenta rectangles to the hot oil and cook until brown and crisp, 3 to 4 minutes, without disturbing the calzagatti. Flip, and cook until brown and crisp on the other side. Remove and drain on paper towels. Continue with the rest of the calzagatti, adding more oil as necessary."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 8 hrs 30 mins"
        },
        {
            "Total Time": " 9 hrs 10 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "218"
        },
        {
            "Fat": "13g"
        },
        {
            "Carbs": "21g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7186678.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "side_dishes"
}