{
    "title": "Polenta Taragna with Taleggio and Radicchio",
    "Category": "Polenta",
    "Ingredients": [
        {
            "1": "0.5 cups whole grain polenta"
        },
        {
            "2": "1 cup whole grain buckwheat flour"
        },
        {
            "3": "1.5 cups water"
        },
        {
            "4": "1 cup vegetable broth"
        },
        {
            "5": "1 teaspoon salt"
        },
        {
            "6": "0.25 cup unsalted butter, at room temperature, cubed"
        },
        {
            "7": "6 ounces Taleggio cheese at room temperature, cubed"
        },
        {
            "8": "1 large head radicchio"
        },
        {
            "9": "1 teaspoon olive oil"
        }
    ],
    "Directions": [
        {
            "1": "Whisk polenta and buckwheat flour together in a bowl."
        },
        {
            "2": "Combine water, broth, and salt in a large pot and bring to a boil over medium-high heat. Sprinkle polenta mixture into the water little by little, whisking constantly to avoid clumping. Immediately reduce heat and simmer, stirring often to avoid scorching, for about 15 minutes."
        },
        {
            "3": "Set aside 4 Taleggio cheese cubes. Add butter and remaining Taleggio cheese to the polenta, stirring often until melted and the polenta is thick and creamy like grits, about 10 minutes."
        },
        {
            "4": "Meanwhile, heat a griddle or skillet over medium heat. Remove the outer leaves of the radicchio and cut the head into 4 equal wedges. Drizzle oil onto the griddle and cook the radicchio on each side until heated and slightly charred and just beginning to wilt."
        },
        {
            "5": "Distribute equal portions of polenta onto plates and top with a cube of Taleggio and a wedge of grilled radicchio. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "665"
        },
        {
            "Fat": "32g"
        },
        {
            "Carbs": "73g"
        },
        {
            "Protein": "24g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8545784.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "side_dishes"
}