{
    "title": "Air Fryer Everything Bagel Bites",
    "Category": "Bagels",
    "Ingredients": [
        {
            "1": "1 cooking spray"
        },
        {
            "2": "1 cup all-purpose flour"
        },
        {
            "3": "2 teaspoons baking powder"
        },
        {
            "4": "0.5 teaspoon salt"
        },
        {
            "5": "1 cup fat-free Greek yogurt (such as Fage®)"
        },
        {
            "6": "0.25 cup garlic and herb cheese spread (such as Boursin®)"
        },
        {
            "7": "1 large egg white, beaten"
        },
        {
            "8": "2 teaspoons everything bagel seasoning"
        }
    ],
    "Directions": [
        {
            "1": "Preheat an air fryer to 330 degrees F (165 degrees C). Spray the air fryer basket with cooking spray and set aside."
        },
        {
            "2": "Whisk flour, baking powder, and salt together in a bowl. Add yogurt and mix with a fork until well combined."
        },
        {
            "3": "Dust a work surface with flour. Remove dough from the bowl, and knead until no longer sticky, about 12 times. Add a little bit more flour if necessary."
        },
        {
            "4": "Evenly divide dough into 8 pieces and flatten into circles with the palm of your hand. Place 1/2 tablespoon cheese spread in the center of each circle. Pull up the edges of the dough to cover the cheese, roll into a ball, and pinch the seams closed."
        },
        {
            "5": "Brush each bagel bite with egg white and sprinkle with bagel seasoning."
        },
        {
            "6": "Transfer bagel bites, seam sides down, into the prepared air fryer basket. Do not overcrowd. Depending on the size of your air fryer, you may have to do 2 batches."
        },
        {
            "7": "Air fry until golden, 10 to 12 minutes. Remove bagel bites from the basket, and cool for about 10 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 bagel bites"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "136"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "14g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [],
    "main category": "flour"
}