{
    "title": "Gingersnap Strips",
    "Category": "Gingersnaps",
    "Ingredients": [
        {
            "1": "0.75 cup shortening"
        },
        {
            "2": "1 cup white sugar"
        },
        {
            "3": "1  egg"
        },
        {
            "4": "0.25 cup molasses"
        },
        {
            "5": "2 cups all-purpose flour"
        },
        {
            "6": "2 teaspoons baking soda"
        },
        {
            "7": "0.5 teaspoon salt"
        },
        {
            "8": "1 teaspoon ground cinnamon"
        },
        {
            "9": "1 teaspoon ground ginger"
        },
        {
            "10": "0.5 teaspoon ground cloves"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Line two cookie sheets with parchment paper, or you may use ungreased cookie sheets."
        },
        {
            "2": "In a medium bowl, cream together the shortening and sugar until smooth. Beat in the egg and molasses. Combine the flour, baking soda, salt, cinnamon, ginger and cloves; stir into the batter until it forms a dough. The dough may seem a bit crumbly, but that is ok. Keep mixing and it will come together."
        },
        {
            "3": "Remove dough from the bowl, and knead for a few turns. Pat out into a square, and divide into 6 equal pieces. Roll each piece out into a 12 inch long log. Place 3 logs onto each cookie sheet. Wet the tops of the logs with a little bit of water using your fingertips, then sprinkle with sugar."
        },
        {
            "4": "Bake for 10 to 12 minutes in the preheated oven. Allow the cookies to cool for a couple of minutes, then slice the bars diagonally into 1 inch pieces using a knife or pizza cutter. Remove from cookie sheets to cool on wire racks. When completely cool, store in an airtight container at room temperature."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "12 mins"
        },
        {
            "Total Time": "32 mins"
        },
        {
            "Servings": "60 "
        },
        {
            "Yield": "5 dozen"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "56"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "8g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F384270.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}