{
    "title": "White Chocolate Gingersnaps",
    "Category": "Gingersnaps",
    "Ingredients": [
        {
            "1": "3 cups white sugar, divided, or as needed"
        },
        {
            "2": "0.5 cups canola oil"
        },
        {
            "3": "0.5 cup molasses"
        },
        {
            "4": "1 pinch kosher salt"
        },
        {
            "5": "4 cups all-purpose flour"
        },
        {
            "6": "4 teaspoons baking soda"
        },
        {
            "7": "3 teaspoons ground ginger"
        },
        {
            "8": "2 teaspoons ground cinnamon"
        },
        {
            "9": "1 (11 ounce) package white chocolate chips"
        },
        {
            "10": "1 cup chopped crystallized ginger"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Cream 2 cups sugar, oil, molasses, and salt together in a bowl."
        },
        {
            "3": "Whisk flour, baking soda, ginger, and cinnamon together in a separate bowl and mix into the creamed mixture. Scrape the bowl during the process and try not to overmix."
        },
        {
            "4": "Roll dough into 1-inch balls, then roll the balls in remaining sugar."
        },
        {
            "5": "Bake in the preheated oven until edges are set and golden, 10 to 12 minutes, rotating the cookies halfway through the process so they don't bake unevenly. It's really important not to overbake so the middles stay mushy. Immediately remove the parchment paper from the cookie sheet so the cookies stop baking, and after 2 minutes, transfer to a wire rack to cool completely."
        },
        {
            "6": "Place white chocolate in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Drizzle cookies with white chocolate and immediately sprinkle with chopped candied ginger. You want the still-liquid chocolate to grab the candied ginger."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "60 "
        },
        {
            "Yield": "60 gingersnaps"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "161"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "23g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}