{
    "title": "Cherry Mandlbrodt",
    "Category": "Biscotti",
    "Ingredients": [
        {
            "1": "0.5 cup vegetable oil"
        },
        {
            "2": "1 cup white sugar"
        },
        {
            "3": "3  eggs"
        },
        {
            "4": "3 cups all-purpose flour"
        },
        {
            "5": "0.5 teaspoon salt"
        },
        {
            "6": "1 teaspoon baking powder"
        },
        {
            "7": "1 cup chopped pecans"
        },
        {
            "8": "0.5 cup maraschino cherries, halved"
        },
        {
            "9": "0.5 cup cinnamon sugar"
        }
    ],
    "Directions": [
        {
            "1": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet."
        },
        {
            "2": "Beat the vegetable oil and sugar with an electric mixer in a large bowl. Add the room-temperature eggs one at a time, allowing each egg to blend into the sugar mixture before adding the next. Combine flour, salt, and baking powder in a small bowl. Stir flour mixture into sugar mixture until just incorporated. Fold in the pecans and cherries; mixing just enough to evenly combine."
        },
        {
            "3": "Using lightly greased hands, divide dough into 2 equal portions. Form 2 loaves about 10 inches long and 3 inches wide and place on the prepared baking sheet. Sprinkle with cinnamon sugar."
        },
        {
            "4": "Bake in the preheated oven until firm, 25 to 30 minutes. Remove from oven and allow to cool slightly. Cut each loaf into 3/4 inch slices. Place slices cut side up, back on the baking sheet. Increase oven heat to 400 degrees F (200 degrees C) and return mandlebrodt to the oven. Toast until edges become golden brown, about 5 minutes."
        },
        {
            "5": "Cool in the pans for 10 minutes before removing to cool completely on a wire rack. Store in an airtight container."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 1 hrs 30 mins"
        },
        {
            "Total Time": " 2 hrs 20 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "2 dozen cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "192"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "27g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F73327fd3b757574392722f2ca1d5e077%2F824739.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}