{
    "title": "Restaurant-Style Tofu Lettuce Wraps",
    "Category": "Lettuce Wraps",
    "Ingredients": [
        {
            "1": "1 (12 ounce) package extra-firm tofu, drained"
        },
        {
            "2": "1 Cooking Sauce-"
        },
        {
            "3": "0.25 cup soy sauce"
        },
        {
            "4": "3 tablespoons brown sugar"
        },
        {
            "5": "1 tablespoon rice wine vinegar"
        },
        {
            "6": "1 tablespoon dry sherry (Optional)"
        },
        {
            "7": "1 Special Sauce-"
        },
        {
            "8": "0.25 cup water"
        },
        {
            "9": "0.25 cup white sugar, or to taste"
        },
        {
            "10": "3 tablespoons soy sauce"
        },
        {
            "11": "2 tablespoons hoisin sauce"
        },
        {
            "12": "2 tablespoons oyster sauce"
        },
        {
            "13": "1 tablespoon rice wine vinegar"
        },
        {
            "14": "1 teaspoon chile-garlic sauce (such as Sriracha®), or more to taste"
        },
        {
            "15": "1 teaspoon cornstarch, or as needed (Optional)"
        },
        {
            "16": "2 teaspoons sesame oil, divided, or to taste"
        },
        {
            "17": "1 large white onion, chopped"
        },
        {
            "18": "2 cloves garlic, chopped"
        },
        {
            "19": "1 (15 ounce) can straw mushrooms, drained and chopped"
        },
        {
            "20": "1 (8 ounce) can water chestnuts, drained and chopped"
        },
        {
            "21": "1 (8 ounce) can bamboo shoots, drained and chopped"
        },
        {
            "22": "1 Garnishes-"
        },
        {
            "23": "1 medium head radicchio, chopped"
        },
        {
            "24": "1 (8 ounce) package bean sprouts"
        },
        {
            "25": "1 (5 ounce) can fried noodles (such as La Choy®)"
        },
        {
            "26": "1 chopped peanuts"
        },
        {
            "27": "0.5 cup chopped carrot"
        },
        {
            "28": "0.5 cup green onions, chopped"
        },
        {
            "29": "1 (10 ounce) bag romaine lettuce leaves"
        }
    ],
    "Directions": [
        {
            "1": "Place tofu in an airtight container and freeze for 24 hours. Remove from container and thaw, at least 3 hours. Squeeze out excess moisture with your hands or place tofu on paper towels and lay a heavy cutting board on top."
        },
        {
            "2": "Whisk 1/4 cup soy sauce, brown sugar, 1 tablespoon rice wine vinegar, and sherry together in a bowl to make the cooking sauce."
        },
        {
            "3": "Whisk water, white sugar, 3 tablespoons soy sauce, hoisin sauce, oyster sauce, 1 tablespoon rice wine vinegar, and chile-garlic sauce together in a small saucepan over medium-low heat. Add 1/4 teaspoon cornstarch at a time and whisk until thickened, 3 to 5 minutes. Store special sauce in the refrigerator until ready to serve."
        },
        {
            "4": "Chop tofu roughly into small pieces. Heat 1 teaspoon sesame oil in a large skillet over high heat. Add tofu when oil is hot; stir-fry until tofu is browned, about 5 minutes. Set tofu aside in a bowl."
        },
        {
            "5": "Heat remaining sesame oil in the skillet over high heat. Saute onion and garlic until browned and any excess liquid is absorbed, about 2 minutes. Add mushrooms, water chestnuts, and bamboo shoots. Cook over medium-high heat until any excess liquid is absorbed, 2 to 3 minutes. Add cooking sauce to the skillet and stir. Add tofu to the skillet. Cook until sauce is thickened and all vegetables are tender, 2 to 3 minutes more. Remove from heat."
        },
        {
            "6": "Place radicchio, bean sprouts, noodles, peanuts, carrot, and green onions in individual bowls. Place tofu mixture in a serving bowl. Arrange lettuce leaves on a large plate. Put special sauce in a serving bowl with a spoon. Assemble by placing 2 to 3 lettuce leaves on a plate, topping with tofu and garnishes, and drizzling the special sauce on top."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": "1 day 3 hrs"
        },
        {
            "Total Time": "1 day 3 hrs 55 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "16 lettuce wraps"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "292"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "42g"
        },
        {
            "Protein": "13g"
        }
    ],
    "Images": [],
    "main category": "main_dishes"
}