{
    "title": "Light Pumpkin Mousse",
    "Category": "Mousse",
    "Ingredients": [
        {
            "1": "3  eggs"
        },
        {
            "2": "1 cup milk"
        },
        {
            "3": "0.75 cup honey"
        },
        {
            "4": "0.5 cup water"
        },
        {
            "5": "1 (.25 ounce) package unflavored gelatin"
        },
        {
            "6": "0.5 cups pumpkin puree"
        },
        {
            "7": "3 tablespoons white sugar"
        },
        {
            "8": "1 teaspoon ground cinnamon"
        },
        {
            "9": "0.5 teaspoon ground cloves"
        },
        {
            "10": "0.5 teaspoon ground mace"
        },
        {
            "11": "0.5 teaspoon ground nutmeg"
        },
        {
            "12": "0.5 teaspoon ground ginger"
        },
        {
            "13": "1 teaspoon vanilla extract"
        },
        {
            "14": "2 tablespoons chopped crystallized ginger"
        }
    ],
    "Directions": [
        {
            "1": "Pour the 1/2 cup of water or milk into a small bowl and sprinkle the gelatin over it to soften."
        },
        {
            "2": "Separate the eggs, placing the whites in an electric mixer bowl and the yolks in a heat-proof bowl that holds at least 2 cups."
        },
        {
            "3": "Combine the milk, honey and spices in a heavy bottomed saucepan and heat until the honey dissolves and the mixture is steaming hot. Add the softened gelatin with its liquid and stir until it is completely dissolved."
        },
        {
            "4": "Pour most of the hot milk mixture into the egg yolks, whisking constantly, then pour this mixture back into the pot and continue heating until it thickens and almost boils. Stir in the pumpkin and keep stirring until there are no big bubbles when you stop stirring for a few seconds. Remove from the heat and whisk in the vanilla."
        },
        {
            "5": "Beat the egg whites until frothy, then start adding the sugar gradually, beating until stiff peaks have formed. Fold a big spatula of the whites into the pumpkin custard, then fold in the remaining egg whites. Turn the mousse into a 6-cup metal mold that has been rinsed with cold water. Chill mousse overnight. To unmold, dip the mold in hot water for about 30 seconds then invert onto a serving platter. Alternatively, spoon the mousse into individual ramekins or wine glasses that have a tablespoon or two of chopped crystallized ginger and/or gingersnap crumbs in the bottom. Serve with whipped cream."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Additional Time": " 6 hrs"
        },
        {
            "Total Time": " 6 hrs 30 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "178"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "37g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6022509.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}