{
    "title": "Lemon Blueberry Pavlova",
    "Category": "Pavlova",
    "Ingredients": [
        {
            "1": "1 For the Lemon Curd Filling-"
        },
        {
            "2": "0.5 cup unsalted butter"
        },
        {
            "3": "4 large eggs"
        },
        {
            "4": "2 tablespoons lemon zest"
        },
        {
            "5": "1 pinch salt"
        },
        {
            "6": "0.5 cup white sugar"
        },
        {
            "7": "0.25 cup lemon juice"
        },
        {
            "8": "1 For the Meringue-"
        },
        {
            "9": "1 cooking spray"
        },
        {
            "10": "1 tablespoon cornstarch"
        },
        {
            "11": "1 cup white sugar"
        },
        {
            "12": "1 pinch cream of tartar"
        },
        {
            "13": "2 teaspoons lemon juice"
        },
        {
            "14": "0.25 teaspoon pure vanilla extract"
        },
        {
            "15": "1 For the Blueberry Sauce-"
        },
        {
            "16": "1 cup blueberries"
        },
        {
            "17": "2 tablespoons white sugar"
        },
        {
            "18": "0.5 cup cold water"
        },
        {
            "19": "1 For Serving-"
        },
        {
            "20": "0.5 cup fresh blueberries, or more to taste"
        },
        {
            "21": "1 sprig fresh mint"
        }
    ],
    "Directions": [
        {
            "1": "Prepare lemon curd filling: Cut butter into small pieces and set aside."
        },
        {
            "2": "Separate eggs, placing yolks in a heat-proof bowl and whites in glass, metal, or ceramic bowl. Cover egg whites and leave on the counter to come to room temperature for the meringue."
        },
        {
            "3": "Add lemon zest, salt, sugar, and lemon juice to egg yolks. Whisk until thoroughly combined."
        },
        {
            "4": "Add 1 to 2 inches water to a saucepan over low heat; bring to a simmer. Place bowl of filling over the simmering water. Cook, stirring constantly with a spatula, until mixture is very hot to the touch and thick enough to coat the back of a spoon, 10 to 15 minutes."
        },
        {
            "5": "Stir in butter, 3 or 4 pieces at a time, waiting until butter has melted before each addition. Remove from the heat and pour filling into a bowl to cool, about 15 minutes. Lay plastic wrap on top of the filling, pressing down so it doesn't develop a skin, and place in the refrigerator until well chilled, 2 to 3 hours."
        },
        {
            "6": "Preheat the oven to 250 degrees F (120 degrees C). Line a baking sheet with a silicone liner, such as Silpat®. Lightly spray with cooking spray."
        },
        {
            "7": "Begin meringue: Mix cornstarch into sugar and set aside."
        },
        {
            "8": "Add cream of tartar, lemon juice, and vanilla to the reserved egg whites. Whisk with a large whisk until very soft peaks form, about 3 minutes. Whisk in sugar mixture, 2 tablespoons at a time, whisking about 1 minute between each addition, until incorporated. When all sugar mixture has been added, continue to whisk until relatively stiff peaks form and whites are firm enough to hold their shape."
        },
        {
            "9": "Use 2 spoons or a piping bag to transfer whites onto the prepared baking sheet, forming a ring of dollops about 8 or 9 inches across. Fill in the middle with meringue, then go back around the edges adding more meringue to build up the outside edge."
        },
        {
            "10": "Bake in the center of the preheated oven for exactly 1 hour. At 1 hour, turn off the oven and crack the door. Let meringue sit in the oven until its cooled completely, about 1 hour."
        },
        {
            "11": "Meanwhile, prepare blueberry sauce: combine 1 cup blueberries, sugar, and water in a saucepan over medium heat; bring to a simmer. Cook, stirring occasionally, until blueberries collapse and liquid thickens, about 10 minutes."
        },
        {
            "12": "Remove from the heat and pass through a fine mesh strainer. Place in the refrigerator until fully chilled, about 45 minutes."
        },
        {
            "13": "Very carefully transfer cooled meringue to a serving platter using 2 large spatulas if necessary; you may get some cracks but that's okay. Use a spoon to crack the center a bit to make room for the filling."
        },
        {
            "14": "Fill the center with chilled lemon curd filling. Place remaining blueberries over top and drizzle with blueberry sauce. Garnish with mint."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": " 1 hrs 20 mins"
        },
        {
            "Additional Time": " 3 hrs 15 mins"
        },
        {
            "Total Time": " 5 hrs"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "424"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "62g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fbf74fa87e592033a2d62eca5571daeb8%2F1646519911C4DD411F-7348-4D5B-9803-8F6D71EA4F47.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fbf74fa87e592033a2d62eca5571daeb8%2F16443703511644370319124103718824124764188.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9402844.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9238312.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/gUlnPkz3PiTPaizpA28-fr1sU0Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-222-c8d631b51cb44b98ab2e614e527e3c30.jpg"
        }
    ],
    "main category": "snacks_&_sweets"
}