{
    "title": "Meringue Cake with Whipped Cream and Raspberries",
    "Category": "Pavlova",
    "Ingredients": [
        {
            "1": "1 cup confectioners' sugar"
        },
        {
            "2": "0.5 cup granulated sugar, plus"
        },
        {
            "3": "1 tablespoon granulated sugar"
        },
        {
            "4": "1 tablespoon cornstarch"
        },
        {
            "5": "4  large egg whites, at room temperature"
        },
        {
            "6": "0.5 teaspoon cream of tartar"
        },
        {
            "7": "2 cups heavy cream"
        },
        {
            "8": "1 teaspoon vanilla extract"
        },
        {
            "9": "1 pint fresh raspberries"
        },
        {
            "10": "1 Recommended-"
        },
        {
            "11": "1 NOTE- You will need parchment paper for this recipe."
        }
    ],
    "Directions": [
        {
            "1": "The night before serving, adjust oven rack to lower-middle position and heat oven to 500 degrees."
        },
        {
            "2": "Line a lipped cookie sheet (approximately 12 by 18 inches) with parchment paper. Trace two side-by-side rectangles - about 5 inches by 12 or 13 inches - on the paper. Crumple the paper, then smooth it out again and line the bottom of the pan."
        },
        {
            "3": "Whisk together confectioner's sugar, 1/2 cup granulated sugar and cornstarch. Set aside."
        },
        {
            "4": "In the bowl of a mixer, beat egg whites and cream of tartar until they turn from foamy to white and beaters just start to leave a trail. On low speed, add sugar mixture, a heaping tablespoon at a time. Increase speed to medium-high and beat to the consistency of marshmallow cream, 2 to 3 minutes longer."
        },
        {
            "5": "Just before forming meringues, flick water onto parchment with fingertips. Divide meringue in half, spooning two or three mounds down each traced rectangle. Use a rubber spatula, or a cake decorator's metal offset spatula, to fill in and even out rectangles."
        },
        {
            "6": "Set meringues in oven, close door and turn oven off (but leave oven light on). Let meringues dry overnight. Remove, then carefully set a wire rack or cookie sheet over meringues. Invert; peel off parchment and turn right side up. (It's OK if edges chip.) Wrap in foil and set aside until ready to proceed."
        },
        {
            "7": "No more than two hours before serving, whip cream to soft peaks, beating in remaining sugar and the vanilla. Set one meringue on a platter. Spread with half the cream and sprinkle on half the berries. Repeat with remaining meringue, cream and berries. Refrigerate, uncovered, until ready to serve."
        }
    ],
    "Details": [
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "283"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "30g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fdc9e051c184f34daa5f6348faef85ae0%2F410810.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}