{
    "title": "Mini Berry Pavlovas",
    "Category": "Pavlova",
    "Ingredients": [
        {
            "1": "1 Meringue-"
        },
        {
            "2": "4  egg whites"
        },
        {
            "3": "1 cup white sugar"
        },
        {
            "4": "1 teaspoon cornstarch"
        },
        {
            "5": "0.5 teaspoon cream of tartar"
        },
        {
            "6": "1 teaspoon vanilla extract"
        },
        {
            "7": "1 pinch salt"
        },
        {
            "8": "1 Toppings-"
        },
        {
            "9": "1 cup whipped cream, or more to taste"
        },
        {
            "10": "0.75 cup sliced fresh berries, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 275 degrees F (135 degrees C). Line a baking sheet with parchment paper."
        },
        {
            "2": "Beat egg whites in a glass, metal, or ceramic bowl on medium speed with an electric mixer until until soft peaks form, about 3 minutes. Slowly add sugar, cornstarch, and cream of tartar and continue beating on high speed until stiff, glossy peaks form, 3 to 5 minutes. Add vanilla extract and salt and beat until combined, about 30 seconds."
        },
        {
            "3": "Scoop the meringue with a spring-hinged scoop onto the prepared baking sheet and shape into individual rounds about 3 inches in diameter. Use the back of a spoon to create an indentation in the center of the meringue."
        },
        {
            "4": "Bake in the preheated oven until the meringue is dry to the touch, about 1 hour 15 minutes. Transfer the parchment with the meringues on it to a wire rack and allow to cool. Once meringues are cool to the touch, remove from parchment and place directly on the rack to cool completely, about 1 hour."
        },
        {
            "5": "When ready to serve, top each meringue with whipped cream and garnish with fresh berries."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs 15 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs 35 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "82"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "14g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6970788.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}