{
    "title": "Orange-Berry Pavlova",
    "Category": "Pavlova",
    "Ingredients": [
        {
            "1": "1 Pavlova Base-"
        },
        {
            "2": "6  egg whites, room temperature"
        },
        {
            "3": "0.5 teaspoon cream of tartar"
        },
        {
            "4": "1 pinch salt"
        },
        {
            "5": "1 cup white sugar"
        },
        {
            "6": "1 teaspoon vanilla extract"
        },
        {
            "7": "0.5 teaspoon almond extract"
        },
        {
            "8": "0.5 tablespoons cornstarch"
        },
        {
            "9": "1 Orange Whipped Cream-"
        },
        {
            "10": "2 cups heavy whipping cream"
        },
        {
            "11": "1 large orange, zested"
        },
        {
            "12": "1 teaspoon vanilla extract"
        },
        {
            "13": "1 Topping-"
        },
        {
            "14": "1 large orange, peeled and sliced"
        },
        {
            "15": "0.75 cup mixed fresh berries"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 250 degrees F (120 degrees C). Draw a 9-inch circle on a large sheet of parchment paper. Place parchment on a large baking sheet with the circle facing down and centered in the pan."
        },
        {
            "2": "Beat together egg whites, cream of tartar, and salt on high speed with an electric mixer in a bowl until soft peaks form. Add in sugar 1 tablespoon at a time, beating continuously, until stiff, glossy peaks form. Mix in vanilla and almond extracts. Sift cornstarch over the egg mixture and gently fold in until just combined."
        },
        {
            "3": "Pour egg mixture into the center of the circle on the parchment paper on the prepared pan. Starting from the center and moving outwards, gently form the meringue into a round no larger than the drawn circle. Create an impression in the center of the meringue so the edges are slightly taller than the middle."
        },
        {
            "4": "Place into the preheated oven and bake until the pavlova feels firm and dry to the touch, 1 to 1 1/2 hours. Turn the oven off without removing pavlova. Leave in the oven to cool for at least 1 hour."
        },
        {
            "5": "Pour heavy whipping cream into a large bowl. Beat at medium-high speed until soft peaks form. Add orange zest and vanilla extract; beat until combined."
        },
        {
            "6": "Gently remove pavlova base from the parchment paper and place onto a serving tray. Top with whipped cream, oranges slices, and mixed berries. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs 30 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs 50 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "234"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "23g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6969147.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}