{
    "title": "Best Gazpacho",
    "Category": "Gazpacho",
    "Ingredients": [
        {
            "1": "6 large ripe tomatoes"
        },
        {
            "2": "1 large cucumber"
        },
        {
            "3": "1 medium red onion, coarsely chopped"
        },
        {
            "4": "3 cloves garlic, coarsely chopped"
        },
        {
            "5": "4 tablespoons red wine vinegar, or more to tate"
        },
        {
            "6": "5 tablespoons extra-virgin olive oil, or more to taste"
        },
        {
            "7": "1 salt and ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Prepare a bowl with ice water."
        },
        {
            "2": "Bring a large pot of water to a boil over high heat. Cut crosses into the bottom of the tomatoes with a sharp knife, and blanch tomatoes in the boiling water for 1 to 2 minutes until the skin begins to come off. Remove tomatoes with a slotted spoon and immediately immerse in the ice water."
        },
        {
            "3": "Remove skin from the tomatoes and cut out the seeds over a bowl (so that no juice is lost); discard the seeds."
        },
        {
            "4": "If the cucumber is organic, leave the peel on; otherwise peel it. Remove seeds of cucumber and roughly chop."
        },
        {
            "5": "Combine tomatoes, cucumber, onion, garlic, and red wine vinegar in a food processor or blender; blend until gazpacho has desired consistency, either coarsely chopped or finely pureed. Slowly add olive oil and season with salt and pepper. Puree again briefly."
        },
        {
            "6": "Refrigerate gazpacho until cold, at least 1 hour. Remove from the fridge at least 30 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 1 hrs 30 mins"
        },
        {
            "Total Time": " 1 hrs 55 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "115"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "9g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [],
    "main category": "soups"
}