{
    "title": "World's Best Maine Whoopie Pies - Ayuh",
    "Category": "Whoopie Pies",
    "Ingredients": [
        {
            "1": "0.5 cup vegetable shortening"
        },
        {
            "2": "2 cups milk"
        },
        {
            "3": "2 cups white sugar"
        },
        {
            "4": "2  eggs"
        },
        {
            "5": "2 teaspoons vanilla extract"
        },
        {
            "6": "4 cups all-purpose flour"
        },
        {
            "7": "0.5 cup unsweetened cocoa powder (such as Hershey's®)"
        },
        {
            "8": "2 tablespoons unsweetened cocoa powder (such as Hershey's®)"
        },
        {
            "9": "1 tablespoon baking soda"
        },
        {
            "10": "0.5 teaspoons salt"
        },
        {
            "11": "1 cup milk"
        },
        {
            "12": "1 cup butter at room temperature"
        },
        {
            "13": "1 cup vegetable shortening"
        },
        {
            "14": "2 cups white sugar"
        },
        {
            "15": "2 tablespoons all-purpose flour"
        },
        {
            "16": "2 teaspoons vanilla extract"
        },
        {
            "17": "2 (7 ounce) jars marshmallow creme"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C). Cut and set aside 25 pieces of plastic wrap about 5 inches square."
        },
        {
            "2": "For cookies, beat 1/2 cup vegetable shortening, 2 cups milk, 2 cups sugar, the eggs, and 2 teaspoons vanilla extract together in a large mixing bowl until smooth and creamy."
        },
        {
            "3": "In a separate bowl, whisk 4 cups flour with 1/2 cup plus 2 tablespoons unsweetened cocoa, baking soda, and salt until thoroughly combined. Beat the flour mixture into the wet ingredients just until smooth."
        },
        {
            "4": "Scoop up the batter by teaspoons, and drop onto ungreased baking sheets in small round dollops about 2 inches apart. Recipe should make about 50 cookies. Cookies will rise and expand a lot."
        },
        {
            "5": "Bake in the preheated oven until cookies are set in the middle, 8 to 10 minutes. Allow to cool on baking sheets for several minutes before removing to finish cooling on racks."
        },
        {
            "6": "To make the filling, place 1 cup milk in a microwave-safe measuring cup, and microwave until hot but not simmering, 1 to 2 minutes."
        },
        {
            "7": "Pour heated milk into a large mixing bowl. Add 1 cup room temperature butter, 1 cup vegetable shortening, 2 cups sugar, 2 tablespoons flour, 2 teaspoons vanilla extract, and marshmallow creme. Beat the mixture on high speed until the frosting is fluffy, 5 to 10 minutes. At first the frosting will appear lumpy, but keep beating."
        },
        {
            "8": "To fill cookies, choose 2 cookies that are about the same size, and spread about 1 1/2 tablespoons of frosting onto the flat bottom of a cookie. Top with the other cookie, flat-side down, and wrap the filled cookie in a sheet of plastic wrap. Place filled cookie in the freezer. Repeat with remaining cookies and frosting, wrapping each whoopie pie in plastic wrap and freezing."
        },
        {
            "9": "To serve, remove whoopie pies from the freezer and allow to thaw until very cold but not frozen, 10 to 15 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": "20 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "25 "
        },
        {
            "Yield": "25 whoopie pies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "451"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "63g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F63e8bd42934881a70ebbe931501b31c3%2F5855179.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Faec17f0c1f1f12ea3dc1736ee46f4ef6%2F2739995.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fdd66fb701e4a92c2b89100b9e69505e7%2F2276119.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pies"
}