{
    "title": "Egg Pesto Breakfast Wrap",
    "Category": "Breakfast Burritos",
    "Ingredients": [
        {
            "1": "2  eggs"
        },
        {
            "2": "0.5 teaspoons reduced-fat sour cream"
        },
        {
            "3": "0.25 cup shredded reduced-fat Cheddar cheese"
        },
        {
            "4": "2 tablespoons finely chopped onion"
        },
        {
            "5": "0.5 teaspoons prepared pesto sauce"
        },
        {
            "6": "3  grape tomatoes, sliced"
        },
        {
            "7": "1 slice turkey bacon"
        },
        {
            "8": "0.5 ounce marinated artichoke hearts, drained and thinly sliced"
        },
        {
            "9": "1  10-inch flour tortilla"
        },
        {
            "10": "1 salt and pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Beat the eggs in a bowl with the sour cream until blended, and stir in the Cheddar cheese."
        },
        {
            "2": "Spray a skillet with cooking spray, and cook and stir the onion and pesto sauce over medium heat until the onion is translucent, about 6 minutes. Stir in the tomatoes, and pour the egg mixture into the skillet. Cook and stir the egg mixture until the eggs are cooked but not dry, about 3 minutes. Remove eggs from the skillet, and set aside."
        },
        {
            "3": "Place the turkey bacon into the skillet, and fry, flipping once, until the bacon is thoroughly cooked and starting to crisp, about 3 minutes per side. When the bacon is cooked, place the artichokes into the skillet to heat for about 1 minute, and remove the bacon and artichokes from the pan."
        },
        {
            "4": "Spray the skillet with cooking spray, and place the tortilla into the hot skillet. Heat the tortilla until warm and flexible, and remove to a plate."
        },
        {
            "5": "Spoon the eggs, turkey bacon, and artichokes into the center of the tortilla, and season with salt and pepper. Fold the bottom 2 inches of the tortilla up to enclose the filling, and wrap tightly."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Total Time": "25 mins"
        },
        {
            "Servings": "1 "
        },
        {
            "Yield": "1 wrap"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "533"
        },
        {
            "Fat": "27g"
        },
        {
            "Carbs": "45g"
        },
        {
            "Protein": "28g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F3f5c4ff3bfa20d2a86db3f253feffb1a%2F826735.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "breakfast"
}