{
    "title": "Freeze-and-Reheat Breakfast Burritos",
    "Category": "Breakfast Burritos",
    "Ingredients": [
        {
            "1": "1 (12 ounce) package bacon"
        },
        {
            "2": "10 large eggs"
        },
        {
            "3": "3 tablespoons milk"
        },
        {
            "4": "0.25 teaspoon salt"
        },
        {
            "5": "3 tablespoons vegetable oil"
        },
        {
            "6": "4 cups frozen hash brown potatoes with peppers and onion (such as Ore-Ida® Potatoes O'Brien®)"
        },
        {
            "7": "0.5 teaspoon garlic salt"
        },
        {
            "8": "0.25 teaspoon ground black pepper"
        },
        {
            "9": "10 sheets aluminum foil"
        },
        {
            "10": "10 large flour tortillas"
        },
        {
            "11": "0.5 cups shredded Cheddar cheese"
        },
        {
            "12": "1 cup salsa, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels and crumble into bits. Keep the skillet warm."
        },
        {
            "2": "Whisk together eggs, milk, and salt in a bowl until combined. Pour into the hot skillet. Cook and stir over medium-high heat until eggs are scrambled and set, about 5 minutes. Transfer to a bowl."
        },
        {
            "3": "Heat oil in the same skillet over medium-high heat. Add frozen potatoes, garlic salt, and pepper. Fry until browned on the bottom, 4 to 5 minutes. Flip and cook until other side is browned, 4 to 5 minutes more. Let cool."
        },
        {
            "4": "Lay 10 sheets of aluminum foil, slightly larger than tortillas, on a flat work surface. Lay 1 tortilla on each aluminum foil piece; evenly distribute Cheddar cheese on top. Add scrambled eggs, bacon bits, salsa, and potatoes to each tortilla, in that order. Tightly roll burritos, tucking tops and bottoms in first."
        },
        {
            "5": "Wrap aluminum foil tightly around each burrito, covering it completely. Place in resealable plastic bags in a single layer. Remove as much air as possible from the bags before sealing. Store in the freezer until ready to reheat."
        },
        {
            "6": "Reheat by removing the aluminum foil, placing burrito on a microwave-safe plate, and covering it with a paper towel. Heat in the microwave until evenly warmed through, 1 to 2 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 burritos"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "546"
        },
        {
            "Fat": "30g"
        },
        {
            "Carbs": "55g"
        },
        {
            "Protein": "23g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fd383b6087422fed82c2e825c7c97b77b%2F6801571.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4600527.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "breakfast"
}