{
    "title": "Make-Ahead Air Fryer Breakfast Burritos",
    "Category": "Breakfast Burritos",
    "Ingredients": [
        {
            "1": "1 pound mild country bulk sausage"
        },
        {
            "2": "12 large eggs, beaten"
        },
        {
            "3": "1 salt and ground black pepper to taste"
        },
        {
            "4": "1 cup shredded Cheddar cheese"
        },
        {
            "5": "15 (8 inch) flour tortillas"
        }
    ],
    "Directions": [
        {
            "1": "Crumble sausage into a large skillet over medium-high heat. Cook until no longer pink, about 10 minutes. Transfer to a large bowl using a slotted spoon."
        },
        {
            "2": "Reduce heat to medium. Pour beaten eggs into the skillet and season with salt and pepper. Cook for 3 minutes. Stir and cook for 2 minutes more. Turn heat off. Stir one last time, breaking up larger pieces. Pour into the bowl with the sausage, add cheese, and stir to combine."
        },
        {
            "3": "Lay out 1 tortilla on a clean work surface. Place 1/4 cup of the sausage-egg mixture on the bottom third of the tortilla, closest to you. Fold the end of the tortilla over the mixture. Fold in both sides of the tortilla over the filling, making an envelope shape. Tuck, roll, and place on a baking sheet seam side down. Repeat with remaining tortillas and filling."
        },
        {
            "4": "Place baking sheet into the freezer for 2 hours. Transfer burritos to a covered freezer-safe container until ready to serve."
        },
        {
            "5": "When ready to cook, preheat the air fryer to 400 degrees F (200 degrees C)."
        },
        {
            "6": "Place burrito, seam-side down, in the preheated air fryer, and cook for 5 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 2 hrs"
        },
        {
            "Total Time": " 2 hrs 40 mins"
        },
        {
            "Servings": "15 "
        },
        {
            "Yield": "15 burritos"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "324"
        },
        {
            "Fat": "17g"
        },
        {
            "Carbs": "28g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8942436.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://www.allrecipes.com/thmb/Yjp2wjrn2FIKWCplarBnrrFpxmw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-587-fd55ce7ad3914b3b83a78105c87be34c.jpg"
        }
    ],
    "main category": "breakfast"
}