{
    "title": "Make-Ahead Sweet Potato and Chorizo Breakfast Burritos",
    "Category": "Breakfast Burritos",
    "Ingredients": [
        {
            "1": "2 medium sweet potatoes, scrubbed and cut into 1/2-inch cubes"
        },
        {
            "2": "3  green onions, chopped"
        },
        {
            "3": "2 tablespoons olive oil"
        },
        {
            "4": "0.5 teaspoon garlic powder"
        },
        {
            "5": "0.5 teaspoon salt"
        },
        {
            "6": "0.25 teaspoon ground black pepper"
        },
        {
            "7": "1 (14 ounce) package Mexican-style chorizo"
        },
        {
            "8": "1 tablespoon butter"
        },
        {
            "9": "8  eggs"
        },
        {
            "10": "8 (10 inch) flour tortillas"
        },
        {
            "11": "0.5 cup salsa"
        },
        {
            "12": "1 (4 ounce) package queso fresco, crumbled"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper."
        },
        {
            "2": "Place sweet potatoes and green onions on the baking sheet. Drizzle with olive oil and sprinkle with garlic powder, salt, and pepper. Toss to combine and spread out evenly."
        },
        {
            "3": "Roast in the preheated oven until soft, about 25 minutes."
        },
        {
            "4": "Meanwhile, cook chorizo in a medium skillet over medium-high heat, breaking apart with a wooden spoon, 8 to 10 minutes. Drain any excess fat; transfer chorizo to a bowl and set aside to cool. Wipe out the skillet and return it to the stove."
        },
        {
            "5": "Whisk eggs in a bowl. Heat butter in the skillet over medium-high heat. Pour in eggs and scramble until just set, 3 to 5 minutes. Scrape eggs into a bowl and let cool."
        },
        {
            "6": "Line up tortillas in assembly-line fashion. Divide chorizo between the 8 tortillas. Top each with a portion of sweet potato-onion mixture, scrambled eggs, 1 tablespoon salsa, and queso fresco. Fold the bottom of each tortilla up over the filling, then fold in both sides and roll up burritos."
        },
        {
            "7": "Flip burritos so they are seam side-down. Wrap each individually with aluminum foil and place into a resealable plastic bag."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 burritos"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "634"
        },
        {
            "Fat": "35g"
        },
        {
            "Carbs": "51g"
        },
        {
            "Protein": "27g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5605556.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "breakfast"
}