{
    "title": "Ripley's Bloody Mary Mix for Canning",
    "Category": "Bloody Marys",
    "Ingredients": [
        {
            "1": "4  dried chile de arbol peppers"
        },
        {
            "2": "20 pounds tomatoes, chopped"
        },
        {
            "3": "2 pounds onions, chopped"
        },
        {
            "4": "4  green bell peppers, chopped"
        },
        {
            "5": "4  carrots, chopped"
        },
        {
            "6": "1  jalapeno pepper, chopped"
        },
        {
            "7": "4 cloves garlic, minced"
        },
        {
            "8": "2 (8 ounce) cans tomato sauce"
        },
        {
            "9": "1 cup vinegar"
        },
        {
            "10": "6 tablespoons prepared horseradish"
        },
        {
            "11": "4 teaspoons kosher salt"
        },
        {
            "12": "4 teaspoons Worcestershire sauce"
        },
        {
            "13": "2 teaspoons freshly ground black pepper"
        },
        {
            "14": "5  bay leaves"
        },
        {
            "15": "1 teaspoon celery seed"
        },
        {
            "16": "1 teaspoon seafood seasoning (such as Old Bay®)"
        },
        {
            "17": "1 teaspoon hot pepper sauce (such as Tabasco®)"
        },
        {
            "18": "1 cup lemon juice"
        },
        {
            "19": "8  (1 quart) sterilized canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Grind chile de arbol peppers into a powder with a mortar and pestle."
        },
        {
            "2": "Process tomatoes, onions, green bell peppers, carrots, jalapeno pepper, and garlic in a food processor, working in batches, until vegetables are finely chopped. Transfer vegetables to a large pot."
        },
        {
            "3": "Stir tomato sauce, vinegar, horseradish, ground chile de arbol peppers, kosher salt, Worcestershire sauce, black pepper, bay leaves, celery seed, seafood seasoning, and hot pepper sauce into the vegetables. Bring mixture to a boil, reduce heat, and simmer until vegetables are tender, about 30 minutes, stirring regularly. Remove bay leaves."
        },
        {
            "4": "Process the mixture through a vegetable juicer, working in batches if necessary. Strain excess pulp from the juice if desired. Pour juice into a large pot, set over medium heat, and heat until juice is nearly boiling. Stir in lemon juice."
        },
        {
            "5": "Sterilize jars and lids in boiling water for at least 5 minutes. Pack the bloody mary mix into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "6": "Place a rack in the bottom of a large stockpot or canning kettle and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 40 minutes."
        },
        {
            "7": "Remove the jars from the pot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": " 2 hrs"
        },
        {
            "Cook Time": " 1 hrs 5 mins"
        },
        {
            "Additional Time": " 8 hrs"
        },
        {
            "Total Time": " 11 hrs 5 mins"
        },
        {
            "Servings": "32 "
        },
        {
            "Yield": "8 quarts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "78"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "17g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7094512.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "drinks"
}