{
    "title": "Instant Pot Asparagus Risotto",
    "Category": "Risotto",
    "Ingredients": [
        {
            "1": "3 tablespoons unsalted butter"
        },
        {
            "2": "2  shallots, finely chopped"
        },
        {
            "3": "2 cloves garlic, minced"
        },
        {
            "4": "1 pound asparagus spears, trimmed and cut into 1-inch pieces"
        },
        {
            "5": "0.5 cup dry white wine"
        },
        {
            "6": "0.5 cups Arborio rice"
        },
        {
            "7": "1.5 cups chicken broth"
        },
        {
            "8": "0.5 cup heavy cream"
        },
        {
            "9": "0.5 teaspoon salt"
        },
        {
            "10": "0.25 teaspoon ground black pepper"
        },
        {
            "11": "0.25 teaspoon dried thyme"
        },
        {
            "12": "0.5 cup shredded Parmesan cheese"
        },
        {
            "13": "2 tablespoons lemon juice"
        }
    ],
    "Directions": [
        {
            "1": "Turn on a multi-functional pressure cooker (such as Instant Pot) and select Saute function. Add butter and melt. Stir in shallots and garlic; cook for 2 minutes. Remove shallots and garlic with a slotted spoon and set aside. Add asparagus and saute in butter for 2 minutes; remove and set aside on a plate."
        },
        {
            "2": "Return shallots and garlic to the Instant Pot and pour in wine. Stir well, scraping the bottom of the pot with a wooden or plastic spoon, for 30 seconds. Stir in rice and saute in the wine mixture for 2 1/2 minutes, stirring constantly and scraping the bottom of the pot to loosen any brown bits. Stir in chicken broth, cream, salt, pepper, and thyme. Cancel Saute function."
        },
        {
            "3": "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 6 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "4": "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Gradually stir in Parmesan cheese and lemon juice, stirring until cheese is melted. Stir in reserved asparagus pieces. Allow risotto to thicken in the pot, uncovered, for 3 to 4 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "611"
        },
        {
            "Fat": "23g"
        },
        {
            "Carbs": "81g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7677264.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}