{
    "title": "Rib-Eye Steak and Mushroom Risotto",
    "Category": "Risotto",
    "Ingredients": [
        {
            "1": "1 salt and ground black pepper to taste"
        },
        {
            "2": "2 (8 ounce) boneless rib-eye steaks"
        },
        {
            "3": "1 tablespoon canola oil"
        },
        {
            "4": "3 tablespoons olive oil, divided"
        },
        {
            "5": "1 (16 ounce) package white mushrooms, thinly sliced"
        },
        {
            "6": "1 (16 ounce) package cremini mushrooms, thinly sliced"
        },
        {
            "7": "3  shallots, diced"
        },
        {
            "8": "3 cloves garlic, minced"
        },
        {
            "9": "0.5 cups Arborio rice"
        },
        {
            "10": "0.5 cup dry white wine"
        },
        {
            "11": "6 cups low-sodium chicken broth, divided"
        },
        {
            "12": "0.25 cup butter"
        },
        {
            "13": "2 tablespoons finely chopped fresh chives"
        },
        {
            "14": "1 sea salt to taste"
        },
        {
            "15": "1 freshly ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat a sous vide cooker to 132 degrees F (56 degrees C) in a water bath, according to manufacturer's instructions."
        },
        {
            "2": "Season steaks with salt and pepper and place in a vacuum-seal or heavy-duty freezer bag. Seal. Drop the bag into the water bath and set timer for 2 hours."
        },
        {
            "3": "Remove steaks from bag and place on a paper towel-lined plate. Pat dry carefully on both sides."
        },
        {
            "4": "Heat canola oil in a heavy skillet over medium-high heat until it starts smoking. Add steaks. Cook until nicely browned on both sides, flipping every 15 to 30 seconds, about 90 seconds total. Transfer steaks to a plate; let rest for 10 minutes. Slice thinly against the grain."
        },
        {
            "5": "Heat 2 tablespoons olive oil in a large, heavy saucepan over medium-high heat. Stir in white mushrooms and cremini mushrooms; cook until soft, about 3 minutes. Transfer mushrooms and their liquid to a bowl."
        },
        {
            "6": "Heat the remaining tablespoon olive oil in the same saucepan over medium-low heat. Add shallots and garlic. Cook, stirring constantly, until shallots are tender, about 3 minutes. Add rice and increase heat to medium. Cook and stir until rice is pale golden with nearly translucent edges, 3 to 4 minutes."
        },
        {
            "7": "Pour wine into the rice mixture; cook, stirring constantly, until fully absorbed, about 6 minutes. Add 1/2 cup chicken broth; stir until absorbed, about 3 minutes. Add remaining broth, 1/2 cup at a time, stirring risotto continuously until liquid is absorbed and rice is tender yet firm to the bite, 15 to 20 minutes more."
        },
        {
            "8": "Remove risotto from heat. Stir in mushrooms with their liquid, butter, chives, sea salt, and freshly ground pepper. Plate the risotto with strips of steak on the side."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 2 hrs 34 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 2 hrs 59 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "549"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "57g"
        },
        {
            "Protein": "22g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9120206.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4545893.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}