{
    "title": "Risotto with Fresh Figs and Prosciutto",
    "Category": "Risotto",
    "Ingredients": [
        {
            "1": "4 cups vegetable broth"
        },
        {
            "2": "6 tablespoons butter, divided"
        },
        {
            "3": "1 tablespoon extra-virgin olive oil"
        },
        {
            "4": "1  green onion, finely chopped"
        },
        {
            "5": "1 (12 ounce) package Arborio rice"
        },
        {
            "6": "0.5 cup dry white wine"
        },
        {
            "7": "14  small fresh figs, divided"
        },
        {
            "8": "4 thin slices  prosciutto, finely chopped"
        },
        {
            "9": "1 cup grated Pecorino-Romano cheese, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Heat vegetable stock in a large pot and keep warm over low heat."
        },
        {
            "2": "Heat 2 tablespoons butter and 1 tablespoon olive oil in a large, heavy-bottomed saucepan over medium-low heat. Add green onion; cook and stir until softened, about 1 minute. Pour in rice and stir until coated in butter and oil and starting to toast, 2 to 3 minutes. Increase heat and pour in wine. Simmer until alcohol has evaporated and the wine is mostly absorbed. Reduce heat to medium and stir in 1 ladle of boiling broth. Continue stirring until the rice has absorbed the liquid and turned creamy. Once the liquid has been fully absorbed, add the next ladle. Repeat this process, stirring constantly until all liquid has been used or rice is tender yet firm to the bite (al dente). Stirring in the broth should take 12 to 15 minutes in all."
        },
        {
            "3": "Meanwhile, chop 10 figs. Melt 2 tablespoons butter in a medium skillet and cook chopped figs until soft and coated in butter, 4 to 5 minutes. Crush figs gently with a wooden spoon while cooking. Stir in prosciutto. Add fig-prosciutto mixture to the risotto when there are about 5 minutes left to cook."
        },
        {
            "4": "Remove risotto from heat; stir in remaining 2 tablespoons butter and grated Pecorino romano cheese. Let stand for a few minutes."
        },
        {
            "5": "Divide risotto evenly onto 4 plates, garnishing each with a whole fig before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Total Time": "30 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "768"
        },
        {
            "Fat": "30g"
        },
        {
            "Carbs": "100g"
        },
        {
            "Protein": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5573419.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}