{
    "title": "Blueberry Cream Cheese Wontons",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "0.5 (8 ounce) package cream cheese"
        },
        {
            "2": "48  wonton wrappers"
        },
        {
            "3": "1 cup blueberry pie filling"
        },
        {
            "4": "1 water as needed"
        },
        {
            "5": "1 cooking spray"
        },
        {
            "6": "0.25 cup powdered sugar"
        }
    ],
    "Directions": [
        {
            "1": "Cut 4 ounce block of cream cheese in half, then in half again to create 4 pieces. Further cut each piece in half again so you have 8 equal pieces total. Set aside."
        },
        {
            "2": "Working with 6 wonton wrappers at a time, separate them out onto a clean work surface. Divide one of the cream cheese pieces into 6 pieces and place a piece in the middle of each wonton wrapper. Place 1 teaspoon of blueberry pie filling over the top of the cream cheese. Do not overfill, as the mixture may ooze out."
        },
        {
            "3": "Use your finger to lightly wet the 4 edges of each wonton wrapper. Gently fold in half diagonally to make a triangle, then bring up the remaining two corners so all corners join together. Try not to leave excess air in the wonton, which can cause them to burst. Press seams together to ensure a tight seal. Set wontons aside, covered in a damp paper towel, while you finish making the remaining wontons."
        },
        {
            "4": "Preheat the air fryer to 325 degrees F (160 degrees C). Spray the inner basket with cooking spray and place as many wontons in basket as will fit, without overcrowding. Lightly mist wontons with cooking spray."
        },
        {
            "5": "Air-fry for 5 minutes. Remove to a cooling rack and dust with powdered sugar. Let cool while you cook the remaining wontons in batches. Best served slightly warm or at room temperature."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "5 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "48 "
        },
        {
            "Yield": "48 wontons"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "44"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "8g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "cooking_technique_&_channels"
}