{
    "title": "Broccoli-Cheddar Frittata",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "7 large eggs"
        },
        {
            "2": "0.25 cup heavy cream"
        },
        {
            "3": "1 teaspoon smoked paprika"
        },
        {
            "4": "1 salt and freshly ground black pepper to taste"
        },
        {
            "5": "2 tablespoons unsalted butter"
        },
        {
            "6": "0.5 cup chopped onion"
        },
        {
            "7": "0.5 cups chopped fresh broccoli"
        },
        {
            "8": "1 cup frozen diced hash brown potatoes, thawed"
        },
        {
            "9": "1 cup shredded Cheddar cheese"
        },
        {
            "10": "4 slices bacon, cooked and crumbled"
        }
    ],
    "Directions": [
        {
            "1": "Position a rack in the center of the oven and preheat the oven to 400 degrees F (200 degrees C)."
        },
        {
            "2": "Whisk eggs, cream, smoked paprika, salt, and pepper together in a bowl. Set aside."
        },
        {
            "3": "Melt butter in a 12-inch nonstick, oven-proof skillet over medium-high heat until bubbly. Add chopped onion and cook until softened, 1 to 2 minutes. Add chopped broccoli and cook, stirring occasionally, about 2 minutes. Add potatoes and cook, stirring occasionally, about 2 minutes. Lightly season vegetables with additional salt and pepper."
        },
        {
            "4": "Gently pat the vegetables into an even layer with the back of a spatula or spoon and turn off the heat. Sprinkle cheese over the vegetables, followed by bacon."
        },
        {
            "5": "Pour the egg mixture into the skillet and gently shake to eliminate any holes around the vegetables. Let the residual heat cook the eggs slightly, about 2 minutes."
        },
        {
            "6": "Bake in the preheated oven for 8 to 10 minutes. Check for doneness by using a knife to cut the center slightly. Eggs should not be runny enough to fill the cut. Allow to cool in the skillet for 5 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "179"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "6g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8600461.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}