{
    "title": "Butternut Squash Gnocchi with Garlic-Sage Butter over Wilted Spinach",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "1 cup water"
        },
        {
            "2": "1 pound butternut squash, peeled and cut into 1/2-inch cubes"
        },
        {
            "3": "0.5 pound Yukon Gold potatoes, peeled and cut into 1-inch cubes"
        },
        {
            "4": "1 large egg"
        },
        {
            "5": "2 teaspoons salt"
        },
        {
            "6": "2 cups all-purpose flour, plus more as needed"
        },
        {
            "7": "2 bunches fresh spinach, rinsed and chopped"
        },
        {
            "8": "4 tablespoons salted butter"
        },
        {
            "9": "2 tablespoons extra-virgin olive oil"
        },
        {
            "10": "0.25 cup chopped fresh sage"
        },
        {
            "11": "4 cloves garlic, minced"
        },
        {
            "12": "0.5 teaspoon crushed red pepper"
        },
        {
            "13": "0.25 cup freshly grated Parmigiano-Reggiano cheese"
        }
    ],
    "Directions": [
        {
            "1": "Pour water into the pot of a multi-functional pressure cooker (such as Instant Pot®) and place a steamer basket inside. Place butternut squash and potatoes in the steamer basket. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 5 minutes. Allow 15 minutes for pressure to build."
        },
        {
            "2": "Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Use a pot holder to remove the steamer basket and set aside to allow the squash and potatoes to cool slightly, about 5 minutes."
        },
        {
            "3": "Press the squash and potatoes through a ricer into a large bowl. Add egg and salt, and mix thoroughly. Sift about 1 1/2 cups of flour over the mixture and mix to combine. If the mixture is still sticky, add a bit more flour until it comes together. Turn out mixture onto a well-floured surface and knead slightly, adding more flour until the dough is no longer sticking to your hands or to the surface."
        },
        {
            "4": "Divide dough into 4 parts. Line 2 baking sheets with parchment paper and dust with flour."
        },
        {
            "5": "Take 1 piece of dough and roll it into a 1/2-inch thick rope on the floured surface. Cut the rope lengthwise into 1/2-inch pieces. Working with 1 piece at a time, roll each piece down a floured gnocchi board to make ridges. Transfer gnocchi onto the prepared baking sheet. Repeat with remaining dough. Place baking sheets in the freezer while you prepare the sauce and spinach."
        },
        {
            "6": "Bring a large pot of salted water to a boil."
        },
        {
            "7": "Meanwhile, place wet spinach in a large skillet over medium heat. Cover and allow condensation to build until the spinach starts to wilt, about 3 minutes. Remove lid and stir the spinach until wilted and the pan begins to dry. Divide spinach among 4 serving plates."
        },
        {
            "8": "Combine butter and olive oil in the same skillet that you cooked the spinach. Heat over medium-high heat until mixture begins to foam. Add sage, garlic, and red pepper and swirl the pan to combine. Remove from heat."
        },
        {
            "9": "Cook gnocchi in boiling water until they float, 3 to 4 minutes per batch. Remove with a slotted spoon and transfer to the skillet with the garlic-sage butter. Toss lightly to coat. Place gnocchi on top of spinach on the serving plates and sprinkle each with 1 tablespoon Parmigiano-Reggiano cheese. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "35 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "572"
        },
        {
            "Fat": "23g"
        },
        {
            "Carbs": "79g"
        },
        {
            "Protein": "18g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8727424.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}