{
    "title": "Cheesy Bacon Tater Tots",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "6 slices bacon"
        },
        {
            "2": "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®)"
        },
        {
            "3": "0.5 teaspoon garlic salt"
        },
        {
            "4": "2 cups shredded Cheddar cheese, divided"
        },
        {
            "5": "0.25 cup sour cream"
        },
        {
            "6": "2 tablespoons chopped green onions"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 450 degrees F (230 degrees C)."
        },
        {
            "2": "Cook bacon in a large cast iron skillet over medium-high heat until crispy on both sides, about 10 minutes. Place on a paper towel-lined plate and set aside, keeping bacon grease in the skillet."
        },
        {
            "3": "Reduce the heat to medium and add potato nuggets to the skillet. Season with garlic salt and toss until evenly coated. Cook until outsides are crisp, about 10 minutes, turning carefully with a spatula once or twice. Remove the skillet from heat."
        },
        {
            "4": "Carefully remove half of the potato nuggets from the skillet and spread out remaining nuggets in a single layer. Top with 1/2 of the Cheddar cheese. Place remaining nuggets on top of cheese and top with remaining cheese."
        },
        {
            "5": "Transfer the skillet to the preheated oven and bake until nuggets are warmed through and cheese is melted and starts to turn golden brown, about 10 minutes."
        },
        {
            "6": "While the nuggets are baking, crumble cooked bacon. Remove the skillet from the oven and top with crumbled bacon, sour cream, and green onions."
        }
    ],
    "Details": [
        {
            "Prep Time": "5 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "8 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "360"
        },
        {
            "Fat": "24g"
        },
        {
            "Carbs": "29g"
        },
        {
            "Protein": "13g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8831308.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}