{
    "title": "Chicken Stuffed Potatoes with Alfredo Sauce",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "8 large baking potatoes"
        },
        {
            "2": "1 tablespoon olive oil"
        },
        {
            "3": "0.5 teaspoon kosher salt, or to taste"
        },
        {
            "4": "1 (2 pound) rotisserie chicken"
        },
        {
            "5": "1 (16 ounce) package Vegetables, mixed, frozen, unprepared"
        },
        {
            "6": "1 Sauce-"
        },
        {
            "7": "4 tablespoons butter"
        },
        {
            "8": "4 cloves garlic, minced"
        },
        {
            "9": "1 cup fat-free half-and-half"
        },
        {
            "10": "0.5 cup heavy whipping cream"
        },
        {
            "11": "5 ounces freshly grated Parmigiano-Reggiano cheese"
        },
        {
            "12": "1 freshly ground black pepper or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 450 degrees F (230 degrees C). Set a wire rack on a rimmed baking sheet."
        },
        {
            "2": "Rinse and scrub potatoes, then prick with a fork. Drizzle with olive oil and sprinkle with salt. Set on the prepared rack."
        },
        {
            "3": "Bake potatoes in the preheated oven until the internal temperature is 205 to 212 degrees F (96 to 100 degrees C), about 50 minutes."
        },
        {
            "4": "While potatoes are baking, remove meat from rotisserie chicken; discard skin and bones. Pull or cut meat into chunks and keep warm."
        },
        {
            "5": "Prepare Alfredo sauce: Melt butter in a skillet over medium heat until sizzling. Add garlic in a single layer; cook until soft and fragrant but not brown, about 1 minute. Reduce heat and pour in half-and-half and cream; whisk to incorporate. Add Parmesan cheese and pepper and continue to whisk, until cheese is melted."
        },
        {
            "6": "Place vegetables in a microwave-safe bowl. Microwave on high power until warm, about 3 minutes. Chop vegetables into bite-sized pieces if desired, and mix with chicken."
        },
        {
            "7": "When potatoes are finished baking, remove from the oven. Cut a slit into each potato with a fork or a knife, leaving 1/2 inch uncut on edge. Use both hands to press each potato in towards the center so it opens up. This will help let you stuff the potato."
        },
        {
            "8": "Top potatoes with chicken mixture and drizzle with Alfredo sauce."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 stuffed potatoes"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "687"
        },
        {
            "Fat": "28g"
        },
        {
            "Carbs": "77g"
        },
        {
            "Protein": "35g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9352407.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}