{
    "title": "Individual Green Bean Casseroles",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "1 pound fresh green beans, trimmed and cut into 1 1/2-inch pieces"
        },
        {
            "2": "1 cooking spray"
        },
        {
            "3": "2 tablespoons unsalted butter"
        },
        {
            "4": "1 cup sliced fresh mushrooms"
        },
        {
            "5": "1 medium shallot, thinly sliced"
        },
        {
            "6": "1 clove garlic, minced"
        },
        {
            "7": "1 tablespoon all-purpose flour"
        },
        {
            "8": "0.5 cup chicken stock"
        },
        {
            "9": "1 teaspoon low-sodium soy sauce"
        },
        {
            "10": "1 teaspoon Dijon mustard"
        },
        {
            "11": "0.5 teaspoon dried thyme"
        },
        {
            "12": "0.5 cup half-and-half"
        },
        {
            "13": "1 salt and ground black pepper to taste"
        },
        {
            "14": "1 strip crispy cooked bacon, crumbled"
        },
        {
            "15": "0.5 cup French-fried onions (such as French's®)"
        }
    ],
    "Directions": [
        {
            "1": "Bring a large pot of lightly-salted water to a rolling boil. Add beans and cook until just tender, about 5 minutes. (The beans will not soften too much more during baking, so if you want them softer, cook to your preference.)"
        },
        {
            "2": "Drain beans, run under cold water, and place in a bowl of ice water to stop the cooking. When beans are chilled, drain and set aside."
        },
        {
            "3": "Meanwhile, preheat the oven to 350 degrees F (175 degrees C). Spray the inside of 4 ramekins with cooking spray."
        },
        {
            "4": "Melt butter in a medium skillet over medium heat. Add mushrooms and shallot and cook until they start to brown, 2 to 4 minutes. Add garlic and cook until fragrant, about 30 seconds."
        },
        {
            "5": "Sprinkle flour over the mushrooms, stirring well to combine. Gradually pour in chicken stock, soy sauce, Dijon, and thyme, stirring constantly; the mixture will be thick at this point. Stir in half-and-half, salt, and pepper until well combined. Reduce heat to low and simmer until flavors have melded and sauce has thickened, 3 to 5 minutes."
        },
        {
            "6": "Stir in green beans and bacon until well combined. Spoon into the prepared ramekins and top with French-fried onions."
        },
        {
            "7": "Bake in the preheated oven for 13 to 15 minutes. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "348"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "26g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9388472.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}