{
    "title": "Instant Pot® Dijon Pork Chops",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "1 teaspoon salt"
        },
        {
            "2": "1 teaspoon freshly ground black pepper"
        },
        {
            "3": "1 teaspoon dried thyme"
        },
        {
            "4": "4 (1-inch thick) bone-in pork chops"
        },
        {
            "5": "1 tablespoon olive oil"
        },
        {
            "6": "0.5 cup dry white wine"
        },
        {
            "7": "0.5 cup low-sodium chicken stock"
        },
        {
            "8": "2 tablespoons Dijon mustard"
        },
        {
            "9": "0.5 teaspoon garlic powder"
        },
        {
            "10": "4 tablespoons unsalted butter"
        },
        {
            "11": "3 tablespoons chopped fresh flat-leaf parsley"
        }
    ],
    "Directions": [
        {
            "1": "Combine salt, pepper, and thyme in a small bowl. Sprinkle spice mixture over both sides of the pork chops, rubbing in and pressing down."
        },
        {
            "2": "Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Add olive oil and when hot, add pork chops and brown for 3 minutes per side. Remove chops and set aside. Pour in wine and chicken stock. Stir and deglaze the bottom of the pan and allow the liquid to slightly reduce and the alcohol to cook off, about 3 minutes. Turn off Saute function."
        },
        {
            "3": "Add chops back to the pot, close and lock the lid, and set the pressure valve to sealing. Select Manual high pressure according to the manufacturer's instructions, and set the timer for 5 minutes, allowing 10 to 15 minutes for pressure to build."
        },
        {
            "4": "Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Release pressure carefully using the quick-release method, about 5 minutes. Unlock and remove the lid. Remove pork chops to a plate and tent with foil to keep warm."
        },
        {
            "5": "Turn on Saute function. Cook for about 1 minute to reduce liquid; stir in Dijon mustard and garlic powder. Gradually stir in butter until well incorporated, about 3 minutes. Add pork chops back to the pot, coating with the sauce."
        },
        {
            "6": "Garnish with chopped parsley, and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 pork chops"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "432"
        },
        {
            "Fat": "28g"
        },
        {
            "Carbs": "4g"
        },
        {
            "Protein": "35g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9149686.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}