{
    "title": "Instant Pot® Crispy Chicken Carnitas",
    "Category": "Meal Prep",
    "Ingredients": [
        {
            "1": "1 Chicken-"
        },
        {
            "2": "1 tablespoon ground cumin"
        },
        {
            "3": "0.5 teaspoon chili powder"
        },
        {
            "4": "0.5 teaspoon dried oregano"
        },
        {
            "5": "1 pinch salt and ground black pepper to taste"
        },
        {
            "6": "3 tablespoons olive oil, divided"
        },
        {
            "7": "2 pounds skinless, boneless chicken breast halves"
        },
        {
            "8": "5 cloves garlic, pressed"
        },
        {
            "9": "1  yellow onion, quartered"
        },
        {
            "10": "0.25 cup lime juice"
        },
        {
            "11": "0.25 cup chicken broth"
        },
        {
            "12": "0.5 bunch cilantro"
        },
        {
            "13": "1  chipotle pepper in adobo sauce, or more to taste"
        },
        {
            "14": "1  orange, zested and juiced"
        },
        {
            "15": "1  bay leaf"
        },
        {
            "16": "1 Chipotle Sauce-"
        },
        {
            "17": "0.5 cup mayonnaise"
        },
        {
            "18": "1 tablespoon milk"
        },
        {
            "19": "1  chipotle pepper in adobo sauce, or more to taste"
        },
        {
            "20": "1 pinch salt"
        },
        {
            "21": "1 pinch garlic powder"
        }
    ],
    "Directions": [
        {
            "1": "Combine cumin, chili powder, oregano, salt, and pepper in a bowl. Sprinkle over chicken breasts on both sides."
        },
        {
            "2": "Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Add 1 tablespoon olive oil and sear chicken breasts, 1 to 2 minutes per side, working in batches so chicken sears rather than steams. Transfer chicken to a plate."
        },
        {
            "3": "Add garlic and onion to the hot cooker; cook and stir until browned evenly on all sides, about 2 minutes. Return chicken to the pressure cooker along with lime juice, chicken broth, cilantro, chipotle pepper with 1 tablespoon adobo sauce, orange zest and juice, and bay leaf. Close and lock the lid. Set timer for 8 to 10 minutes, depending on size of chicken breasts."
        },
        {
            "4": "Meanwhile, combine mayonnaise, milk, chipotle pepper and 1 tablespoon adobo sauce, salt, and garlic powder to an electric blender. Blend chipotle sauce until smooth."
        },
        {
            "5": "Release pressure from the cooker using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid."
        },
        {
            "6": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler."
        },
        {
            "7": "Transfer chicken breasts to a clean surface and reserve cooking liquid. Shred chicken meat using 2 forks. Place in a large bowl and drizzle 1/4 cup cooking liquid over chicken; toss to coat. Drizzle 1 tablespoon oil over the surface of a baking sheet. Add chicken to the sheet and drizzle remaining 1 tablespoon oil on top. Stir to coat evenly."
        },
        {
            "8": "Broil chicken in the preheated oven for 5 minutes. Toss chicken with 1 to 2 tablespoons reserved cooking liquid and rotate the pan for even broiling. Continue broiling until crispy, 5 to 7 minutes more. Serve with chipotle sauce."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "236"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "5g"
        },
        {
            "Protein": "20g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6913262.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "side_dishes"
}