{
    "title": "Oven-Baked Chicken and Vegetables in Foil",
    "Category": "Meal Prep",
    "Ingredients": [
        {
            "1": "1 heavy duty aluminum foil"
        },
        {
            "2": "3 (5 ounce) boneless, skinless chicken breasts"
        },
        {
            "3": "1 salt and freshly ground black pepper to taste"
        },
        {
            "4": "2 tablespoons olive oil"
        },
        {
            "5": "1 tablespoon minced garlic"
        },
        {
            "6": "0.5 teaspoon salt, or to taste"
        },
        {
            "7": "0.5 teaspoon freshly ground black pepper, or to taste"
        },
        {
            "8": "1  parsnip, peeled and sliced"
        },
        {
            "9": "2 medium carrots, cut into 1/4 inch thick slices"
        },
        {
            "10": "1 medium red bell pepper, cut into 1/2-inch pieces"
        },
        {
            "11": "4 ounces button mushrooms, sliced"
        },
        {
            "12": "6 sprigs fresh rosemary"
        },
        {
            "13": "6 slices  red onion"
        },
        {
            "14": "6 sprigs fresh rosemary"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C)."
        },
        {
            "2": "Cut an 18-inch wide roll of heavy-duty aluminum foil into six 12-inch long pieces."
        },
        {
            "3": "Slice each chicken breast in half lengthwise, so the thickest part is about 1/2 inch thick and season with salt and pepper to taste. Set each seasoned chicken breast onto a single piece of aluminum foil."
        },
        {
            "4": "Combine olive oil, garlic, salt, and pepper in a large bowl. Add sliced carrots, parsnip, red bell peppers, and mushrooms. Stir to combine vegetables with the seasoned oil. Set an even amount of vegetables on top of each piece of chicken."
        },
        {
            "5": "Top vegetables with a whole slice of red onion and place a sprig of fresh rosemary on top of the onion."
        },
        {
            "6": "Fold aluminum like a book cover over the top of each serving and crimp the edges all around tightly together."
        },
        {
            "7": "Place foil packets with the chicken on the bottom onto a 12x18-inch rimmed baking sheet."
        },
        {
            "8": "Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 25 to 30 minutes. Watch out for any steam when you check the chicken for doneness. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        },
        {
            "9": "Remove foil packets from the oven, open the packets, and serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "143"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "5g"
        },
        {
            "Protein": "18g"
        }
    ],
    "Images": [],
    "main category": "side_dishes"
}