{
    "title": "Dry-Brined Smoked Salmon",
    "Category": "Salmon Recipes",
    "Ingredients": [
        {
            "1": "0.5 cups brown sugar, divided"
        },
        {
            "2": "1 cup kosher salt"
        },
        {
            "3": "3 pounds salmon fillets"
        },
        {
            "4": "0.5 cup honey"
        },
        {
            "5": "2 (12 fluid ounce) cans or bottles cola-flavored carbonated beverage (such as Coca-Cola®) (Optional)"
        },
        {
            "6": "3 cups wood chips, soaked"
        }
    ],
    "Directions": [
        {
            "1": "Mix 1 cup brown sugar and kosher salt together in a small bowl."
        },
        {
            "2": "Spread a thin layer of the brown sugar mixture in the bottom of a 9-inch baking pan. Arrange 2 to 3 salmon fillets on top; cover with some of the brown sugar mixture. Repeat layers until all the salmon fillets are coated. Cover with plastic wrap and refrigerate, 8 hours to overnight."
        },
        {
            "3": "Preheat a smoker to 195 degrees F (91 degrees C) according to manufacturer's instructions."
        },
        {
            "4": "Rinse brown sugar mixture off salmon fillets. Brush fillets lightly with honey and sprinkle remaining 1/2 cup brown sugar on top."
        },
        {
            "5": "Pour cola-flavored beverage into the smoker's water pan; add water to within 1 inch of the top. Place half of the wood chips around the perimeter of the hot charcoal. Place salmon on the cooking racks."
        },
        {
            "6": "Cook salmon, adding more wood chips if needed, until an instant-read thermometer inserted into the center reads 145 degrees F (63 degrees C), about 2 hours. Cool before serving, at least 15 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 2 hrs"
        },
        {
            "Additional Time": " 8 hrs 15 mins"
        },
        {
            "Total Time": " 10 hrs 30 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "3 pounds"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "296"
        },
        {
            "Fat": "4g"
        },
        {
            "Carbs": "45g"
        },
        {
            "Protein": "21g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7953735.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "fish_&_sushi"
}