{
    "title": "Vegan Burritos",
    "Category": "Burritos",
    "Ingredients": [
        {
            "1": "0.5 cups water"
        },
        {
            "2": "1 cup uncooked brown rice"
        },
        {
            "3": "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®)"
        },
        {
            "4": "3 teaspoons ground cumin"
        },
        {
            "5": "2 teaspoons ground turmeric"
        },
        {
            "6": "1 teaspoon chopped fresh basil"
        },
        {
            "7": "1 pinch garlic powder, or to taste"
        },
        {
            "8": "1 pinch salt and ground black pepper to taste"
        },
        {
            "9": "1 pinch seasoned salt, or to taste"
        },
        {
            "10": "2 tablespoons olive oil"
        },
        {
            "11": "2 large red potatoes, cubed"
        },
        {
            "12": "1  green bell pepper, chopped"
        },
        {
            "13": "1 medium onion, chopped"
        },
        {
            "14": "1 clove garlic, minced, or to taste"
        },
        {
            "15": "1 (15 ounce) can black beans, rinsed and drained"
        },
        {
            "16": "6  flour tortillas"
        },
        {
            "17": "1 cup fresh spinach, or to taste"
        },
        {
            "18": "1 cup chopped romaine lettuce, or to taste"
        },
        {
            "19": "0.25 cup salsa, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Grease a baking sheet."
        },
        {
            "2": "Bring water and brown rice to a boil in a saucepan. Stir in diced tomatoes with chile peppers. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, about 50 minutes."
        },
        {
            "3": "While rice is cooking, mix cumin, turmeric, basil, garlic powder, salt, pepper, and seasoned salt together in a large bowl. Add olive oil. Toss potatoes in the mixture until well coated. Lay potatoes in a single layer on the prepared baking sheet."
        },
        {
            "4": "Bake in the preheated oven until fork-tender, 15 to 30 minutes, depending on the size of the cubes, checking halfway through cooking time and flipping over as needed."
        },
        {
            "5": "While potatoes are cooking, heat a skillet over medium heat. Saute bell pepper and onion in the hot pan until softened, about 5 minutes. Add garlic and cook for 1 minute. Remove from heat and set aside."
        },
        {
            "6": "Heat black beans in a saucepan over medium-low heat until hot, 2 to 3 minutes. Keep warm."
        },
        {
            "7": "Meanwhile, heat tortillas in a separate skillet over low heat until warm, 1 to 2 minutes, or according to package instructions."
        },
        {
            "8": "Lay out tortillas and fill as desired with cooked rice, beans, potatoes, pepper-onion mixture, spinach, romaine lettuce, and salsa as desired. Wrap up into burritos and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 burritos"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "495"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "89g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9080953.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}