{
    "title": "Peppers Stuffed with Grilled Chicken and Rice",
    "Category": "Stuffed Bell Peppers",
    "Ingredients": [
        {
            "1": "4 medium green bell peppers, tops removed, seeded"
        },
        {
            "2": "0.25 cups water, divided"
        },
        {
            "3": "3 tablespoons taco seasoning, divided"
        },
        {
            "4": "2 (5 ounce) skinless, boneless chicken breast halves"
        },
        {
            "5": "0.5 cup brown rice, rinsed well"
        },
        {
            "6": "1 medium red bell pepper, cut into thick slices"
        },
        {
            "7": "1 tablespoon olive oil"
        },
        {
            "8": "0.25 cup chopped onion"
        },
        {
            "9": "2 teaspoons minced garlic"
        },
        {
            "10": "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®)"
        },
        {
            "11": "1 cup shredded Mexican-blend cheese, divided"
        },
        {
            "12": "0.5 teaspoon garlic salt, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C). Place green peppers in a baking dish with 1/8 cup water in the bottom."
        },
        {
            "2": "Bake in the preheated oven until peppers are slightly browned around the edges, 20 to 25 minutes."
        },
        {
            "3": "While the peppers are baking, whisk 1/4 cup water and 2 tablespoons taco seasoning together in a small bowl. Add chicken and toss to coat. Cover the bowl with plastic wrap and marinate in the refrigerator for at least 15 minutes."
        },
        {
            "4": "Combine remaining 1 cup water and rice in a pot over high heat; bring to a boil. Cover, reduce heat to low, and cook for 15 minutes. Remove from the heat. Stir in remaining taco seasoning and let sit, covered, until tender, about 15 minutes more. Remove the lid, drain any remaining liquid, and set aside."
        },
        {
            "5": "Preheat an outdoor grill for medium heat and lightly oil the grate."
        },
        {
            "6": "Remove chicken from the refrigerator and place on the preheated grill with the pepper slices. Cook chicken until no longer pink in the center and the juices run clear, about 5 to 7 minutes per side. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C). Grill peppers until tender, about 2 to 3 minutes per side."
        },
        {
            "7": "Remove chicken and peppers from the grill and allow to cool. Shred chicken and dice peppers."
        },
        {
            "8": "Heat oil in a large skillet over medium heat. Add onions and garlic; saute until soft, 5 to 7 minutes. Add cooked rice, shredded chicken, diced peppers, diced tomatoes and green chiles, 1/2 of the cheese, and garlic salt; stir until well blended. Cook over medium heat, stirring occasionally, until hot, about 5 minutes."
        },
        {
            "9": "Spoon rice mixture into the green peppers. Top with remaining cheese."
        },
        {
            "10": "Return to the oven until cheese is melted, about 5 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 30 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 stuffed peppers"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "367"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "25g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F777303.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}