{
    "title": "Boneless Turkey Breast in the Instant Pot®",
    "Category": "Keto Diet",
    "Ingredients": [
        {
            "1": "1 tablespoon ground paprika"
        },
        {
            "2": "1 tablespoon herbes de Provence"
        },
        {
            "3": "1 teaspoon seasoned salt"
        },
        {
            "4": "1 salt and ground black pepper to taste"
        },
        {
            "5": "1 (3 pound) frozen boneless turkey breast in mesh, thawed, with gravy packet reserved"
        },
        {
            "6": "2 tablespoons extra-virgin olive oil, divided"
        },
        {
            "7": "0.5 cups chicken stock"
        },
        {
            "8": "3 stalks celery, cut into 4-inch pieces"
        },
        {
            "9": "0.5  onion, cut into 1/2-inch slices"
        },
        {
            "10": "0.5 cup water, or as needed"
        },
        {
            "11": "2 tablespoons unsalted butter"
        },
        {
            "12": "2 tablespoons all-purpose flour"
        }
    ],
    "Directions": [
        {
            "1": "Combine paprika, herbes de Provence, seasoned salt, salt, and pepper in a small bowl. Place the trivet of a multi-functional pressure cooker (such as Instant Pot®) on a work surface."
        },
        {
            "2": "Pat all sides of thawed turkey breast with paper towels until dry. Be sure to leave the mesh in place, as this holds the turkey together. Rub turkey with about 2 teaspoons olive oil, then rub with dry seasonings. Set gravy packet aside for later use."
        },
        {
            "3": "Turn on the cooker and select Saute function. Allow the inner pot to heat, 1 to 2 minutes. Add remaining oil to the hot pot, then add turkey breast and brown on all sides, about 5 minutes. Carefully remove turkey breast and set on the trivet. Pour chicken stock into the hot pot and scrape up any browned bits with a wooden spoon. Place the trivet and turkey breast into the pot and place celery and onions around it. Cancel Saute function."
        },
        {
            "4": "Close and lock the lid, set the valve to seal, and select high pressure according to manufacturer's instructions. Set timer for 25 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "5": "Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Release any remaining pressure carefully using the quick-release method according to manufacturer's instructions."
        },
        {
            "6": "Open the pot and check internal temperature of the turkey with an instant-read thermometer. Safe internal temperature is at least 165 degrees F (74 degrees C). Lift turkey out of the pot and place on a cutting board; cover with aluminum foil. Remove the trivet and turn off the cooker."
        },
        {
            "7": "Strain cooking liquid into a glass measuring cup. Add enough water to make 1 1/2 cups liquid."
        },
        {
            "8": "Return the inner pot to the cooker, add butter, and select Saute function. Sprinkle flour into the melted butter and whisk briskly to avoid lumps. Whisk bubbling mixture for about 2 minutes, then gradually add the cooking liquid, stirring constantly. Pour in the contents of the gravy packet; cook and stir until mixture comes to a boil and thickens slightly, 5 to 10 minutes. Cancel Saute function and pour gravy into a serving container."
        },
        {
            "9": "Slice turkey and serve warm with gravy."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "353"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "3g"
        },
        {
            "Protein": "43g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7947439.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "healty_&_diets"
}