{
    "title": "Meaty Baked Ziti",
    "Category": "Ziti",
    "Ingredients": [
        {
            "1": "1 pound bulk mild Italian sausage"
        },
        {
            "2": "1 pound ground beef"
        },
        {
            "3": "2 (14.5 ounce) cans tomato sauce"
        },
        {
            "4": "1 (28 ounce) can whole peeled tomatoes with juice"
        },
        {
            "5": "0.5 cup diced white onion"
        },
        {
            "6": "3 cloves garlic, minced"
        },
        {
            "7": "2 teaspoons Italian seasoning"
        },
        {
            "8": "1 teaspoon dried basil"
        },
        {
            "9": "1 teaspoon white sugar"
        },
        {
            "10": "0.5 teaspoon red pepper flakes"
        },
        {
            "11": "1 (16 ounce) package ziti pasta"
        },
        {
            "12": "1 (15 ounce) container whole-milk ricotta cheese"
        },
        {
            "13": "4 cups shredded mozzarella cheese, divided"
        },
        {
            "14": "0.5 cup grated Parmesan cheese"
        },
        {
            "15": "1 large egg, beaten"
        },
        {
            "16": "2 tablespoons chopped flat-leaf (Italian) parsley, or to taste"
        },
        {
            "17": "0.5 teaspoon ground black pepper"
        },
        {
            "18": "12 slices provolone cheese"
        }
    ],
    "Directions": [
        {
            "1": "Heat a large pot over medium-high heat. Cook and stir sausage and ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Add tomato sauce, whole tomatoes with juice, onion, garlic, Italian seasoning, basil, sugar, and red pepper flakes; bring to a simmer. Reduce heat to medium-low and simmer for 30 minutes to 1 hour. Turn off the heat. Transfer 3 cups sauce to a bowl and leave remaining sauce in the pot; allow to cool while you prepare ziti."
        },
        {
            "2": "Preheat the oven to 375 degrees F (190 degrees C)."
        },
        {
            "3": "Bring a large pot of lightly salted water to a boil. Add ziti and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain ziti and rinse under cool water to stop it from cooking."
        },
        {
            "4": "Combine ricotta, 2 cups mozzarella, Parmesan, egg, 2 tablespoon parsley, and pepper in a bowl; stir together with a few turns but do not mix completely. Pour drained ziti into the bowl and toss until slightly combined with large lumps. Add the reserved 3 cups meat sauce and toss to combine."
        },
        {
            "5": "Place 1/2 of the pasta mixture into a 9x13-inch casserole dish. Spoon 1/2 of the remaining sauce over top, layer with 6 slices of provolone and 1 cup mozzarella. Repeat layers: pasta mixture, remaining sauce, 6 slices provolone, and 1 cup mozzarella. Cover with foil."
        },
        {
            "6": "Place on a baking sheet and bake in the preheated oven until bubbling, 30 to 40 minutes. Remove foil and bake until cheese is fully melted and slightly browned, 5 to 10 more minutes. Remove from the oven and sprinkle with parsley. Let stand 5 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": " 1 hrs 35 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 2 hrs 5 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "593"
        },
        {
            "Fat": "32g"
        },
        {
            "Carbs": "37g"
        },
        {
            "Protein": "39g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4468971.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}