{
    "title": "Quick Vegetarian Picadillo Empanadas",
    "Category": "Empanada Recipes",
    "Ingredients": [
        {
            "1": "1 tablespoon olive oil"
        },
        {
            "2": "1 (15 ounce) can lentils, drained and rinsed"
        },
        {
            "3": "0.25 cup sofrito"
        },
        {
            "4": "3 cloves garlic, minced"
        },
        {
            "5": "0.5 teaspoon dried oregano"
        },
        {
            "6": "0.5 teaspoon salt"
        },
        {
            "7": "0.25 teaspoon ground black pepper"
        },
        {
            "8": "1 (15 ounce) can diced potatoes, drained"
        },
        {
            "9": "1 (8 ounce) can tomato sauce"
        },
        {
            "10": "0.5 cup sliced pimento-stuffed green olives"
        },
        {
            "11": "2 cups vegetable oil for frying, or as needed"
        },
        {
            "12": "16 pieces empanada pastry discs"
        }
    ],
    "Directions": [
        {
            "1": "Heat olive oil in a saucepan over medium-high heat. Add lentils, sofrito, garlic, oregano, salt, and pepper; cook for 4 minutes."
        },
        {
            "2": "Reduce heat to medium-low and stir in potatoes, tomato sauce, and olives. Simmer until mixture is warmed through, 3 to 4 minutes. Remove from heat and allow to cool."
        },
        {
            "3": "Fill a deep skillet or frying pan with 2 inches vegetable oil and place over medium heat while you assemble the empanadas."
        },
        {
            "4": "Set empanada discs on a clean work surface. Add 1/4 cup of lentil-potato mixture to the center of one half of an empanada disc in a half moon shape (so it follows the curve of the wrapper). Wet your fingers in a bowl of water and run them around the entire edge of the wrapper to moisten. Fold the wrapper in half to cover the filling and pinch the edges of the dough together to seal, then use a fork to crimp the edges to secure the wrapper further. Repeat with the remaining discs and filling."
        },
        {
            "5": "Once oil has reached 350 degrees F (175 degrees C), add empanadas in a single layer; do not overlap. You will need to cook in batches."
        },
        {
            "6": "Fry until empanadas are golden brown and crispy, flipping once or twice so they brown evenly while frying, about 5 minutes. Transfer to a paper towel-lined plate to drain. Repeat to cook remaining empanadas."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "16 empanadas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "382"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "55g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9349191.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}