{
    "title": "Amazing Apple Butter",
    "Category": "Canning and Preserving",
    "Ingredients": [
        {
            "1": "10 pounds apples, quartered"
        },
        {
            "2": "4 cups unsweetened apple juice"
        },
        {
            "3": "1 cup white sugar"
        },
        {
            "4": "1 tablespoon apple cider vinegar"
        },
        {
            "5": "0.5 teaspoons ground cinnamon"
        },
        {
            "6": "0.5 teaspoon ground cloves"
        },
        {
            "7": "0.5 teaspoon ground allspice"
        },
        {
            "8": "6  half-pint canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Combine apples and apple juice in a stockpot; bring to a boil. Reduce heat and cook at a simmer until apples are soft and mushy, 20 to 30 minutes."
        },
        {
            "2": "Spoon apples into a food mill and process into puree while discarding the cores and peels remaining in the mill. Transfer process apples to a slow cooker."
        },
        {
            "3": "Cook on High with the lid off until the moisture evaporates and the volume reduces by about half, overnight to 24 hours."
        },
        {
            "4": "Stir sugar, apple cider vinegar, cinnamon, cloves, and allspice through the apple puree."
        },
        {
            "5": "Continue cooking on High until mixture mounds on a chilled plate without any water separating from the edges, another 2 to 6 hours."
        },
        {
            "6": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the apple butter into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "7": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process 5 to 10 minutes."
        },
        {
            "8": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": " 10 hrs 25 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 10 hrs 40 mins"
        },
        {
            "Servings": "48 "
        },
        {
            "Yield": "6 cups"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "75"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F0390addf2622d7471ed854e87833a043%2F165592660220220622_104103.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8522395.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F98eba22630f149cf2456fee2dbc0caeb%2F7287999.jpg"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F371d779aff3173598bb4ea1cbcb1ca0c%2F4097964.jpg"
        }
    ],
    "main category": "preserved"
}