{
    "title": "Ghirardelli Chocolate-Peanut Butter Thumbprint Cookies",
    "Category": "Thumbprint Cookies",
    "Ingredients": [
        {
            "1": "1 Cookies-"
        },
        {
            "2": "1 cup unsalted butter, softened"
        },
        {
            "3": "1 cup granulated sugar"
        },
        {
            "4": "1 cup packed light brown sugar"
        },
        {
            "5": "1 cup creamy peanut butter"
        },
        {
            "6": "2  large eggs"
        },
        {
            "7": "1 teaspoon vanilla extract"
        },
        {
            "8": "3 cups all-purpose flour"
        },
        {
            "9": "1 teaspoon baking soda"
        },
        {
            "10": "0.5 teaspoon baking powder"
        },
        {
            "11": "0.5 teaspoon kosher salt"
        },
        {
            "12": "1 Filling-"
        },
        {
            "13": "1 (12 ounce) bag Ghirardelli Semi-Sweet Chocolate Baking Chips"
        },
        {
            "14": "0.25 cup heavy cream"
        },
        {
            "15": "2 tablespoons salted butter"
        },
        {
            "16": "1 (11 ounce) package Ghirardelli Grand Semi-Sweet Chocolate Baking Chips"
        }
    ],
    "Directions": [
        {
            "1": "Prepare the Cookies: Beat butter, granulated sugar, brown sugar, and peanut butter with a heavy-duty stand mixer fitted with paddle attachment on medium speed until smooth, 1 to 2 minutes. Add eggs, one at a time, beating just until incorporated after each addition. Beat in vanilla."
        },
        {
            "2": "Whisk together flour, baking soda, baking powder, and salt in a medium bowl; gradually add to butter mixture, beating on low speed just until blended and smooth. Cover and chill 1 hour."
        },
        {
            "3": "Preheat the oven to 350 degrees F."
        },
        {
            "4": "Scoop dough into balls using a 1-inch cookie scoop (about 1/2 tablespoon); place 2 inches apart on parchment paper-lined baking sheets. Press your thumb or the end of a wooden spoon into center of each ball, forming an indentation. Keep unused dough chilled while baking cookies."
        },
        {
            "5": "Bake, in batches, in preheated oven until lightly browned, 10 to 11 minutes. Cool on baking sheets 5 minutes; transfer to wire racks. Lightly press your thumb into indentations again while cookies are warm to reinforce shape. Cool completely, about 30 minutes."
        },
        {
            "6": "Prepare the Filling: Place first bag of Ghirardelli Semi-Sweet Chocolate Baking Chips, heavy cream, and butter in a medium-size microwaveable bowl, and microwave on medium (50% power) until melted and smooth, 1 1/2 to 2 minutes, stirring every 30 seconds. Let stand 15 minutes."
        },
        {
            "7": "Transfer filling to a piping bag or a heavy-duty zip-top bag with 1/2 inch snipped from 1 corner."
        },
        {
            "8": "Pipe filling into indentation in each cookie, about 1 teaspoon per cookie. Press 3 Ghirardelli Grand Semi-Sweet Chocolate Chips onto the filling of each cookie. Let stand until chocolate filling is firm, about 1 hour."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 2 hrs 50 mins"
        },
        {
            "Total Time": " 3 hrs 35 mins"
        },
        {
            "Servings": "108 "
        },
        {
            "Yield": "9 dozen"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "91"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "11g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5925148.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}