{
    "title": "Cranberry-Ginger Linzer Torte Cookies",
    "Category": "Gingerbread Cookies",
    "Ingredients": [
        {
            "1": "1 Cranberry-Ginger Filling-"
        },
        {
            "2": "1 (12 ounce) package fresh cranberries"
        },
        {
            "3": "2 cups white sugar"
        },
        {
            "4": "1 medium orange, zested"
        },
        {
            "5": "0.5 cup fresh orange juice"
        },
        {
            "6": "0.25 cup water"
        },
        {
            "7": "2 tablespoons grated fresh ginger root"
        },
        {
            "8": "1 pinch salt"
        },
        {
            "9": "1 Cookies-"
        },
        {
            "10": "1.5 cups all-purpose flour"
        },
        {
            "11": "1 tablespoon ground ginger"
        },
        {
            "12": "1 teaspoon ground cinnamon"
        },
        {
            "13": "0.5 teaspoon salt"
        },
        {
            "14": "0.5 cups unsalted butter, at room temperature"
        },
        {
            "15": "1 cup white sugar"
        },
        {
            "16": "1 teaspoon vanilla extract"
        },
        {
            "17": "0.25 cup confectioners' sugar, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine cranberries, sugar, orange zest, orange juice, water, ginger, and salt for filling in a medium saucepan over medium-high heat, stirring to dissolve sugar. Lower heat and simmer, stirring frequently, until cranberries burst. Continue cooking, mashing fruit a bit with the back of a spoon, until thick as jam, about 30 minutes. Remove from heat to cool completely. Can be stored in an airtight container in the refrigerator for up to one week."
        },
        {
            "2": "Sift flour, ginger, cinnamon, and salt for cookies together in a medium bowl. Set aside."
        },
        {
            "3": "Mix butter and white sugar together in the bowl of an electric mixer fitted with a paddle attachment until just combined. Add the vanilla. Gradually add in flour mixture on low speed just until the dough starts to come together. Dump onto a piece of plastic wrap and flatten into a disk. Wrap and chill for 30 minutes."
        },
        {
            "4": "Roll the dough ¼-inch thick and cut into 2-inch rounds with a plain or fluted cutter. With 1/2 of the rounds, cut a hole from the middle of each round into a desired shape. Place all cookies on a parchment-lined baking sheet and chill for 15 minutes."
        },
        {
            "5": "While cookies chill, preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "6": "Bake in the preheated oven until the edges just begin to brown or the cookies are crisp, 20 to 25 minutes. Remove from the oven; let cookies cool for 1 minute on the pan, then remove to a wire rack and allow to cool completely, 15 to 20 minutes."
        },
        {
            "7": "When the cookies have cooled, place 1 teaspoon of filling on the flat side of each whole cookie, spreading it out to the edges with the back of the spoon. Dust the top of the cut-out cookies with confectioners' sugar. Place the sugared tops on the filled bottoms."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": " 1 hrs 5 mins"
        },
        {
            "Total Time": " 2 hrs 25 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "24 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "282"
        },
        {
            "Fat": "12g"
        },
        {
            "Carbs": "43g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}