{
    "title": "Gingerbread Crinkle Cookies",
    "Category": "Gingerbread Cookies",
    "Ingredients": [
        {
            "1": "0.5 sticks unsalted butter"
        },
        {
            "2": "3 cups all-purpose flour"
        },
        {
            "3": "0.75 cup packed dark brown sugar"
        },
        {
            "4": "1 tablespoon ground cinnamon"
        },
        {
            "5": "1 tablespoon ground ginger"
        },
        {
            "6": "0.75 teaspoon baking soda"
        },
        {
            "7": "0.5 teaspoon ground cloves"
        },
        {
            "8": "0.5 teaspoon salt"
        },
        {
            "9": "0.75 cup molasses"
        },
        {
            "10": "2 tablespoons whole milk"
        },
        {
            "11": "0.5 cup white sugar"
        },
        {
            "12": "0.5 cup powdered sugar"
        }
    ],
    "Directions": [
        {
            "1": "Let butter sit on the counter until slightly softened but still cool, 10 to 15 minutes. Cut into 1/2-inch cubes."
        },
        {
            "2": "Mix flour, brown sugar, cinnamon, ginger, baking soda, cloves, and salt in a large bowl with an electric mixer until combined. Add the butter pieces and mix on medium-low speed until the mixture is sandy and resembles fine meal."
        },
        {
            "3": "Reduce the mixer speed to low and gradually add molasses and milk; mix until dough is evenly moistened. Increase speed to medium and mix until thoroughly combined."
        },
        {
            "4": "Transfer dough to a work surface and divide in 2 equal pieces. Shape each piece into a ball, wrap in plastic, and refrigerate until firm, 2 to 8 hours."
        },
        {
            "5": "When ready to bake, preheat the oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper."
        },
        {
            "6": "Remove one piece of dough from the refrigerator. Pinch off small pieces of dough and roll into 2-inch diameter balls. Do not overwork the dough as it will get too warm. If the dough becomes too warm, rewrap it in plastic wrap and return to the refrigerator until chilled."
        },
        {
            "7": "Roll balls in white sugar until coated, then roll in powdered sugar until coated. Place 1 inch apart on the prepared baking sheets."
        },
        {
            "8": "Bake in the preheated oven until cookies are set in the centers, about 12 minutes; be careful not to overbake. Cool on the baking sheet for 2 minute before removing to a wire rack to cool, 8 to 10 minutes more."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 2 hrs 10 mins"
        },
        {
            "Total Time": " 2 hrs 55 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "24 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "192"
        },
        {
            "Fat": "6g"
        },
        {
            "Carbs": "34g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}