{
    "title": "Authentic Key Lime Pie with Whipped Cream",
    "Category": "Key Lime Pie",
    "Ingredients": [
        {
            "1": "1 Graham Cracker Crust-"
        },
        {
            "2": "7 tablespoons unsalted butter, melted"
        },
        {
            "3": "2 cups graham cracker crumbs"
        },
        {
            "4": "0.25 cup white sugar"
        },
        {
            "5": "0.25 teaspoon sea salt"
        },
        {
            "6": "1 Pie Filling-"
        },
        {
            "7": "1 pound Key limes"
        },
        {
            "8": "3 large egg yolks"
        },
        {
            "9": "1 (14 ounce) can sweetened condensed milk"
        },
        {
            "10": "1 Whipped Cream-"
        },
        {
            "11": "1 cup heavy cream"
        },
        {
            "12": "0.5 tablespoons white sugar"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Put melted butter in a large mixing bowl and add graham cracker crumbs, sugar, and salt; mix until combined. Transfer to a 9-inch pie plate and pat with your fingers on the bottom and up the sides to make the crust."
        },
        {
            "3": "Bake in the preheated oven until very lightly browned, about 10 minutes. Remove from the oven and let cool while you prepare the filling. Leave the oven on."
        },
        {
            "4": "Zest limes until you have 1 1/2 tablespoons for the filling plus some to sprinkle on top of the pie; set aside. Juice all limes; you should have 3/4 cup juice."
        },
        {
            "5": "Combine egg yolks and 1 1/2 tablespoons lime zest in a large mixing bowl with an electric mixer until thick. Add condensed milk and mix until thickened, about 3 minutes. Add lime juice and mix until combined. Pour filling into the cooled crust."
        },
        {
            "6": "Bake in the oven until filling has risen slightly and is mostly set but still slightly jiggly in the center, about 15 minutes."
        },
        {
            "7": "Remove from the oven and let cool for 30 minutes at room temperature. Transfer to the refrigerator and let cool for at least 2 more hours."
        },
        {
            "8": "Mix heavy cream and sugar with an electric mixer until stiff peaks form. Spread on top of the pie and sprinkle with reserved lime zest."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 2 hrs 30 mins"
        },
        {
            "Total Time": " 3 hrs 25 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 9-inch pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "508"
        },
        {
            "Fat": "29g"
        },
        {
            "Carbs": "58g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [],
    "main category": "pies"
}