{
    "title": "Coconut-Crusted Key Lime and White Chocolate Mousse Pie",
    "Category": "Key Lime Pie",
    "Ingredients": [
        {
            "1": "1 Crust-"
        },
        {
            "2": "1 teaspoon shortening"
        },
        {
            "3": "0.5 cup white sugar"
        },
        {
            "4": "0.5 cup unsalted butter, at room temperature"
        },
        {
            "5": "1 cup all-purpose flour"
        },
        {
            "6": "1 teaspoon Key lime zest"
        },
        {
            "7": "1 teaspoon vanilla extract"
        },
        {
            "8": "0.25 cup finely shredded coconut"
        },
        {
            "9": "1 Filling-"
        },
        {
            "10": "1 (14 ounce) can nonfat sweetened condensed milk"
        },
        {
            "11": "1 (8 ounce) container nonfat sour cream"
        },
        {
            "12": "0.5 cup freshly squeezed lime juice, or more to taste"
        },
        {
            "13": "2 medium Key limes, juiced"
        },
        {
            "14": "3 tablespoons coconut cream, or more to taste"
        },
        {
            "15": "0.5 (11 ounce) package white chocolate chips"
        },
        {
            "16": "10 drops green food coloring"
        },
        {
            "17": "8 ounces fat-free frozen whipped topping, thawed"
        },
        {
            "18": "1 Garnish-"
        },
        {
            "19": "1.5 ounces white chocolate"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 400 degrees F (200 degrees C). Grease the bottom and sides of a 9 1/2-inch glass pie pan with shortening."
        },
        {
            "2": "Beat sugar and butter for crust in a bowl on medium speed until smooth. Beat in flour, lime zest, and vanilla extract on low speed just until crumbly. Press evenly into the bottom of the prepared pan."
        },
        {
            "3": "Bake in the preheated oven until light golden brown, 13 to 16 minutes. Remove to a wire rack and let cool completely, about 30 minutes."
        },
        {
            "4": "While the crust is cooling, grind shredded coconut in a food processor into a coarse powder."
        },
        {
            "5": "Spread coconut powder thinly over the cooled crust."
        },
        {
            "6": "Prepare filling: Whip condensed milk, sour cream, lime and Key lime juices, and coconut cream in a medium bowl on low to medium speed until smooth. Add more lime juice or coconut cream to taste; it should be quite sour but not bitter."
        },
        {
            "7": "Melt white chocolate chips in a microwave-safe bowl in 15-second increments just until soft. Mash with a spoon, then quickly add to the filling mixture and whip immediately on high speed to evenly distribute. Whip in food coloring on low speed, then gently fold in whipped topping."
        },
        {
            "8": "Pour filling into the pie pan. Cover and refrigerate until filling is fully set, at least 12 hours."
        },
        {
            "9": "Remove from the refrigerator. Shave white chocolate with a vegetable peeler over the pie to decorate. Serve immediately or refrigerate until serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 12 hrs 30 mins"
        },
        {
            "Total Time": " 13 hrs 20 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "1 9 1/2-inch pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "526"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "73g"
        },
        {
            "Protein": "8g"
        }
    ],
    "Images": [],
    "main category": "pies"
}