{
    "title": "Key Lime Bars",
    "Category": "Key Lime Pie",
    "Ingredients": [
        {
            "1": "1 Pastry Crust-"
        },
        {
            "2": "6 tablespoons unsalted butter, softened"
        },
        {
            "3": "1 cup all-purpose flour"
        },
        {
            "4": "0.25 cup firmly packed light brown sugar"
        },
        {
            "5": "0.25 teaspoon salt"
        },
        {
            "6": "1 Lime Layer-"
        },
        {
            "7": "2 medium limes, zested and juiced"
        },
        {
            "8": "3 tablespoons Key lime juice"
        },
        {
            "9": "0.75 cup white sugar"
        },
        {
            "10": "2 large eggs"
        },
        {
            "11": "2 tablespoons all-purpose flour"
        },
        {
            "12": "0.25 teaspoon double-acting baking powder"
        },
        {
            "13": "1 drop green food coloring"
        },
        {
            "14": "1 tablespoon confectioners' sugar, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Line an 8-inch square baking pan with aluminum foil, then brush with melted butter. Place pan in the freezer until needed."
        },
        {
            "2": "Cream butter for crust in a bowl with an electric mixer. Beat in flour, brown sugar, and salt. If mixture does not hold together, knead it on a work surface. Place mounds of the mixture in the cold baking pan; press with your fingers to smooth it into a firm layer on the bottom."
        },
        {
            "3": "Bake in the preheated oven until lightly colored, about 18 minutes."
        },
        {
            "4": "While the crust is baking, prepare lime layer: pour 2 tablespoons regular lime juice into a small bowl. Discard any extra, or reserve for another use. Add lime zest and Key lime juice; mix to combine."
        },
        {
            "5": "Combine sugar, eggs, flour, and baking powder in a bowl; beat with an electric mixer at high speed for 1 minute. Stir in lime zest-juice mixture and food coloring."
        },
        {
            "6": "Remove crust from the oven and immediately pour lime mixture over top. Return to the oven and bake until top is light colored and custardy, 25 to 30 minutes. Remove from the oven and let cool, about 30 minutes. Move to the freezer and chill for 30 minutes."
        },
        {
            "7": "Remove from the pan and cut into 16 squares. Sprinkle confectioners' sugar on top."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs 10 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 bars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "134"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "21g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [],
    "main category": "pies"
}