{
    "title": "Amazing Shrimp Stuffed Mushrooms",
    "Category": "Stuffed Mushrooms",
    "Ingredients": [
        {
            "1": "20 large white mushrooms, stems removed"
        },
        {
            "2": "1 (4 ounce) can small shrimp, rinsed, drained and broken up"
        },
        {
            "3": "0.5 cup chive and onion flavored cream cheese"
        },
        {
            "4": "0.5 teaspoon Worcestershire sauce"
        },
        {
            "5": "1 pinch garlic powder, or to taste"
        },
        {
            "6": "1 dash Louisiana-style hot sauce, or to taste"
        },
        {
            "7": "0.75 cup grated Romano cheese"
        }
    ],
    "Directions": [
        {
            "1": "Lightly grease a 9x13 inch baking dish. Fill a saucepan with water and simmer the mushroom caps over medium heat for 2 minutes, until the mushrooms begin to soften. Remove the mushrooms with a slotted spoon, drain, and let cool, hollow sides down, on paper towels, for about 15 minutes."
        },
        {
            "2": "While mushroom caps are cooling, combine the shrimp, cream cheese, Worcestershire sauce, garlic powder, and hot sauce in a bowl and stir to blend well. Spoon about 2 teaspoons of the shrimp mixture into the cap of each mushroom and place, stuffing side up, in the prepared baking dish. Sprinkle the Romano cheese onto each mushroom. Cover and refrigerate for at least 3 hours or overnight to blend the flavors and firm up the stuffing."
        },
        {
            "3": "Preheat an oven to 400 degrees F (200 degrees C). Uncover the dish and bake the mushrooms in the preheated oven for about 15 minutes, until the cheese is browned and bubbling."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 3 hrs 15 mins"
        },
        {
            "Total Time": " 3 hrs 50 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "20 stuffed mushrooms"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "103"
        },
        {
            "Fat": "7g"
        },
        {
            "Carbs": "3g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F201740.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}