{
    "title": "Easy Vegetarian Stuffed Mushrooms",
    "Category": "Stuffed Mushrooms",
    "Ingredients": [
        {
            "1": "2 tablespoons butter, divided, or more as needed"
        },
        {
            "2": "10 medium brown mushrooms, stems removed and diced"
        },
        {
            "3": "3 ounces garden vegetable cream cheese spread (such as Philadelphia(R) Garden Vegetable), or more to taste"
        },
        {
            "4": "2 stalks green onions, chopped"
        },
        {
            "5": "1 tablespoon chopped fresh chives, or to taste"
        },
        {
            "6": "0.25 cup panko bread crumbs"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 425 degrees F (220 degrees C)."
        },
        {
            "2": "Melt 1 tablespoon butter in a skillet over medium heat. Add mushroom caps and saute until soft and browned, about 2 1/2 minutes per side. Transfer to a baking dish."
        },
        {
            "3": "Add diced mushroom stems to the same skillet, adding more butter if needed. Saute until mushrooms have softened, about 3 minutes. Transfer to a bowl along with any pan juices. Add cream cheese, green onions, and chives and mix while still hot. Stuff mixture into the mushroom caps until they are full."
        },
        {
            "4": "Melt remaining tablespoon butter in a skillet. Add bread crumbs and toss until well coated. Top each mushroom cap with a layer of the buttered crumbs."
        },
        {
            "5": "Bake in the preheated oven until tops are browned and crispy, about 9 minutes. Remove and let cool for about 3 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "5 "
        },
        {
            "Yield": "10 stuffed mushrooms"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "124"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "7g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9423408.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}