{
    "title": "Stuffed Portobello Mushrooms with Egg and Pesto",
    "Category": "Stuffed Mushrooms",
    "Ingredients": [
        {
            "1": "4 large portobello mushrooms"
        },
        {
            "2": "2 tablespoons olive oil, or as needed"
        },
        {
            "3": "0.25 cup pesto"
        },
        {
            "4": "4 large eggs"
        },
        {
            "5": "1 salt and freshly ground black pepper to taste"
        },
        {
            "6": "4 teaspoons finely shredded Parmesan cheese"
        },
        {
            "7": "2 tablespoons minced fresh parsley"
        }
    ],
    "Directions": [
        {
            "1": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil."
        },
        {
            "2": "Use a damp cloth to remove any dirt from mushrooms. Cut stems off and use a spoon to remove gills, being careful not to break sides of the mushrooms. If there is not enough room for an egg, scrape out a bit of the mushroom flesh. Brush mushroom tops with olive oil and place, top-sides down, on the prepared baking sheet."
        },
        {
            "3": "Broil in the preheated oven until mushrooms start to release liquid, 5 to 6 minutes. Remove from oven and reduce heat to 400 degrees F (200 degrees C)."
        },
        {
            "4": "Pour out any accumulated liquid from the mushrooms and pat the insides dry with a paper towel. Return mushrooms to the baking sheet. Lightly brush the foil with additional oil to prevent sticking."
        },
        {
            "5": "Spread 1 tablespoon pesto into each mushroom. Gently crack an egg into each mushroom and season with salt and pepper. Sprinkle with Parmesan cheese."
        },
        {
            "6": "Bake in the preheated oven until whites are set and egg yolks are done to your liking, 12 to 15 minutes. Garnish with parsley."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "218"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "2g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9399855.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}