{
    "title": "Fudge Stripe Cookies",
    "Category": "Copycat Recipes",
    "Ingredients": [
        {
            "1": "1 cup unsalted butter, softened"
        },
        {
            "2": "0.75 cup granulated sugar"
        },
        {
            "3": "1 large egg"
        },
        {
            "4": "0.5 teaspoons vanilla extract"
        },
        {
            "5": "0.5 teaspoon kosher salt"
        },
        {
            "6": "1.0 cups all-purpose flour"
        },
        {
            "7": "1 (12 ounce) bag semisweet chocolate chips"
        }
    ],
    "Directions": [
        {
            "1": "Combine butter and sugar in a stand mixer and beat with the paddle attachment on medium speed until light and fluffy, about 3 minutes, stopping to scrape down sides of the mixing bowl once or twice. Add egg, vanilla, and salt; beat until well-incorporated, about 30 seconds. Reduce mixer speed to low and gradually add flour, beating on low until just combined, about 1 minute."
        },
        {
            "2": "Divide dough in half, and flatten each half into a 1/2-inch-thick disk. (Disks will be about 12.5 oz. each.) Wrap each disk in plastic wrap, and chill until firm, at least 30 minutes or up to 2 days."
        },
        {
            "3": "Line two baking sheets with parchment paper; set aside."
        },
        {
            "4": "Working with one disk at a time, roll dough on a lightly floured surface to 1/4-inch thickness. If desired, prick the dough with a docking tool or run over the dough with an embossed rolling pin to create a decorative texture. If you do not have a docking or decorating tool, use a meat mallet to emboss the dough: apply the mallet textured-side down and lightly tap the center of the smooth side with the heel of your hand, and repeat, being sure to line up decorative scores."
        },
        {
            "5": "Cut out rounds with a 2-inch round cutter. Place rounds 1-inch apart on the prepared baking sheets. Repeat with second dough disk, then gather all dough scraps and discard. Using a 1/2-inch cutter or piping tip, cut out and remove the center of each dough round to create a donut shape. Reserve any extra dough for another use. Chill cut-out cookies until firm, about 30 minutes."
        },
        {
            "6": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "7": "Bake cookies, one sheet at a time, in the preheated oven until edges begin to brown, about 12 minutes. Cool cookies on the baking sheet for 10 minutes. Transfer cookies to a wire rack, and cool completely, about 30 minutes. Repeat with second baking sheet."
        },
        {
            "8": "Place chocolate in a medium microwave-safe bowl. Microwave on HIGH until melted, about 2 minutes, stopping to stir every 30 seconds. Transfer 1/4 cup of the chocolate to a piping bag and cut a 1/8-inch hole at the end."
        },
        {
            "9": "Place wire rack over a parchment lined baking sheet. Pipe four stripes across the top of each cookie. Dip the base of each cookie into the bowl of melted chocolate, scraping the excess off on the side of the bowl. Place chocolate-side down on a clean parchment-lined baking sheet. Chill until chocolate is set, about 10 minutes."
        },
        {
            "10": "Store cookies in an airtight container in the refrigerator for up to 4 days."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Chill Time": " 1 hrs 50 mins"
        },
        {
            "Bake Time": "12 mins"
        },
        {
            "Total Time": " 2 hrs 47 mins"
        },
        {
            "Servings": "36 "
        },
        {
            "Yield": "36 cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "140"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "17g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F13c64a92719be3374cc416b1c3ab5b69%2F1667771692270DSC_0177-4-.JPG&q=60&c=sc&orient=true&w=160&poi=auto&h=90.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F13c64a92719be3374cc416b1c3ab5b69%2F1667751618147FudgeStripeCookies.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}