{
    "title": "Langostino Ceviche",
    "Category": "Ceviche",
    "Ingredients": [
        {
            "1": "1 medium orange"
        },
        {
            "2": "5 medium limes, divided"
        },
        {
            "3": "2 medium lemons"
        },
        {
            "4": "0.75 cup diced red onion"
        },
        {
            "5": "0.25 cup kosher salt, or more to taste"
        },
        {
            "6": "6 sprigs fresh cilantro"
        },
        {
            "7": "3 cloves garlic, peeled and slightly crushed"
        },
        {
            "8": "2  serrano chile peppers, halved lengthwise and seeded"
        },
        {
            "9": "2 teaspoons sea salt"
        },
        {
            "10": "1 teaspoon dried, crushed Mexican oregano"
        },
        {
            "11": "0.5 teaspoon cayenne pepper, or to taste"
        },
        {
            "12": "2 (12 ounce) packages frozen pre-cooked langostinos (such as Trader Joe's®), thawed"
        },
        {
            "13": "1 cup cherry tomatoes, quartered"
        },
        {
            "14": "1 cup chopped fresh cilantro"
        },
        {
            "15": "3 tablespoons good-quality extra-virgin olive oil"
        }
    ],
    "Directions": [
        {
            "1": "Grate 1 teaspoon orange zest into a bowl. Grate 1 teaspoon lime zest into the same bowl. Juice the orange, 4 limes, and both lemons into the same bowl; set aside."
        },
        {
            "2": "Place red onion in a non-reactive bowl. Add 1/4 cup kosher salt and cover with warm water. Juice the remaining lime into the bowl. Let sit for 10 minutes. Drain and rinse well with cold water; drain again."
        },
        {
            "3": "Return onion to the non-reactive bowl. Add citrus juice and zest, cilantro sprigs, garlic cloves, serrano peppers, sea salt, oregano, and cayenne. Cover and marinate in the refrigerator, stirring occasionally, for 45 minutes."
        },
        {
            "4": "Remove from the refrigerator. Remove and discard garlic, serrano peppers, and cilantro sprigs. Add langostino tails and mix gently to combine with the juices. Cover and refrigerate for 45 more minutes."
        },
        {
            "5": "Remove from the refrigerator and add cherry tomatoes, chopped cilantro, and olive oil; mix well until thoroughly incorporated."
        },
        {
            "6": "Taste and season with additional kosher salt if needed."
        }
    ],
    "Details": [
        {
            "Prep Time": "35 mins"
        },
        {
            "Additional Time": " 1 hrs 40 mins"
        },
        {
            "Total Time": " 2 hrs 15 mins"
        },
        {
            "Servings": "8 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "61"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "3g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "fish_&_sushi"
}