{
    "title": "Air Fryer Latkes",
    "Category": "Potato Pancakes",
    "Ingredients": [
        {
            "1": "1 (16 ounce) package frozen shredded hash brown potatoes, thawed"
        },
        {
            "2": "0.5 cup shredded onion"
        },
        {
            "3": "1  egg"
        },
        {
            "4": "1 kosher salt and ground black pepper to taste"
        },
        {
            "5": "2 tablespoons matzo meal"
        },
        {
            "6": "1 avocado oil cooking spray"
        }
    ],
    "Directions": [
        {
            "1": "Preheat an air fryer to 375 degrees F (190 degrees C) according to manufacturer's instructions. Lay out a sheet of parchment or waxed paper."
        },
        {
            "2": "Place thawed potatoes and shredded onion on several layers of paper towels. Cover with more paper towels and press to squeeze out most of the liquid."
        },
        {
            "3": "Whisk together egg, salt, and pepper in a large bowl. Stir in potatoes and onion with a fork. Sprinkle matzo meal on top and stir until ingredients are evenly distributed. Use your hands to form mixture into ten 3- to 4-inch wide patties. Place patties on the parchment or waxed paper."
        },
        {
            "4": "Spray the air fryer basket with cooking spray. Carefully place half of the patties in the basket and spray generously with cooking spray."
        },
        {
            "5": "Air-fry until crispy and dark golden brown on the outside, 10 to 12 minutes. (Check for doneness at 8 minutes if you prefer a softer latke.) Remove latkes to a plate. Repeat with remaining patties, spraying them with cooking spray before cooking."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "5 "
        },
        {
            "Yield": "10 latkes"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "97"
        },
        {
            "Fat": "7g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7976693.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7348425.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}