{
    "title": "Rainbow Potato Pancakes with Harissa and Eggs",
    "Category": "Potato Pancakes",
    "Ingredients": [
        {
            "1": "1 cup vegetable oil for frying, or more as needed"
        },
        {
            "2": "1 pound russet potatoes, peeled and shredded"
        },
        {
            "3": "6 tablespoons shredded yellow onion"
        },
        {
            "4": "1 pound purple potatoes, peeled and shredded"
        },
        {
            "5": "8  eggs, divided"
        },
        {
            "6": "0.5 cup potato starch"
        },
        {
            "7": "2 tablespoons potato starch"
        },
        {
            "8": "2 teaspoons kosher salt"
        },
        {
            "9": "0.25 teaspoon ground black pepper"
        },
        {
            "10": "1 teaspoon balsamic vinegar"
        },
        {
            "11": "2 teaspoons white vinegar"
        },
        {
            "12": "0.5 cup microgreens"
        },
        {
            "13": "0.25 cup sour cream"
        },
        {
            "14": "0.25 cup harissa"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oil in a 10-inch skillet to 350 degrees F (175 degrees C). Preheat oven to 200 degrees F (95 degrees C). Line a baking sheet with parchment paper."
        },
        {
            "2": "Put shredded russet potatoes and 3 tablespoons onion on a clean kitchen towel; squeeze out as much moisture as possible, then transfer to a bowl. Put shredded purple potatoes and remaining 3 tablespoons onion in the same towel; squeeze out as much moisture as possible, then transfer to a separate bowl."
        },
        {
            "3": "Whisk 4 eggs, 1/2 cup plus 2 tablespoons potato starch, salt, and pepper in a large bowl until smooth. Transfer 1/2 of the egg mixture to another large bowl; stir in balsamic vinegar and fold in purple potato mixture. Fold russet potato mixture into remaining egg mixture."
        },
        {
            "4": "Drop four 3-tablespoon portions of batter at a time into the hot oil and flatten with a spatula. Fry, turning once, until golden brown, about 8 minutes. Transfer pancakes to prepared baking sheet; keep warm in oven. Repeat with remaining potato mixture."
        },
        {
            "5": "Fill a large saucepan with 2 to 3 inches of water and bring to a boil. Reduce the heat to medium-low, pour in white vinegar, and keep the water at a gentle simmer. Crack an egg into a small bowl then gently slip egg into the simmering water, holding the bowl just above the surface of water. Repeat with the remaining eggs. Cook eggs until the whites are firm and the yolks have thickened but are not hard, 2 1/2 to 3 minutes."
        },
        {
            "6": "Remove the eggs from the water with a slotted spoon and dab on a kitchen towel to remove excess water. Top pancakes with poached eggs and microgreens. Serve with sour cream and harissa."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "16 potato pancakes"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "485"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "62g"
        },
        {
            "Protein": "18g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7619056.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}