{
    "title": "Baked Flank Steak Roulade Stuffed with Bacon and Cheese",
    "Category": "Flank Steak",
    "Ingredients": [
        {
            "1": "2 (1 pound) flank steaks"
        },
        {
            "2": "1 Marinade-"
        },
        {
            "3": "2 tablespoons olive oil"
        },
        {
            "4": "0.5 tablespoons Italian seasoning"
        },
        {
            "5": "0.5 teaspoon ground black pepper"
        },
        {
            "6": "2 cloves garlic, crushed"
        },
        {
            "7": "1 Cheese Filling-"
        },
        {
            "8": "10 slices bacon"
        },
        {
            "9": "0.5 (8 ounce) package cream cheese, softened"
        },
        {
            "10": "0.5 cup shredded Italian cheese blend"
        },
        {
            "11": "0.25 cup cooked chopped spinach, squeezed very dry"
        },
        {
            "12": "1 clove garlic, crushed"
        }
    ],
    "Directions": [
        {
            "1": "Sandwich the flank steaks between waxed paper and pound with a kitchen mallet to tenderize."
        },
        {
            "2": "Whisk olive oil, Italian seasoning, pepper, and garlic for marinade together in a small bowl. Pour into the bottom of a baking dish that's large enough to hold both steaks in a single layer. Add steaks so that one side is touching the marinade; do not flip to coat. Let sit while you prepare the filling."
        },
        {
            "3": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until slightly browned and not yet crispy, about 8 minutes. Drain bacon slices on paper towels."
        },
        {
            "4": "Mix cream cheese, Italian cheese, spinach, and garlic together in a bowl. Spread cheese mixture on the unmarinated side of the steaks. Place 5 bacon strips on top the cheese on each steak. Roll steaks up and pin with toothpicks to secure."
        },
        {
            "5": "Bake, uncovered, in the preheated oven until an instant-read thermometer inserted into the center reads 135 to 140 degrees F (57 to 60 degrees C), about 45 minutes. Remove from the oven, cover, and let sit for 5 minutes before slicing."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "269"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "2g"
        },
        {
            "Protein": "21g"
        }
    ],
    "Images": [],
    "main category": "meat_&_chicken"
}