{
    "title": "Grilled Chili Flank Steak with Chipotle-Tomatillo Salsa",
    "Category": "Flank Steak",
    "Ingredients": [
        {
            "1": "1 Flank Steak-"
        },
        {
            "2": "4 cloves garlic, peeled and pressed"
        },
        {
            "3": "1 tablespoon brown sugar"
        },
        {
            "4": "2 teaspoons chili powder"
        },
        {
            "5": "2 teaspoons ground black pepper"
        },
        {
            "6": "2 teaspoons kosher salt"
        },
        {
            "7": "0.5 teaspoon ground cumin"
        },
        {
            "8": "1 (2 pound) flank steak"
        },
        {
            "9": "1 tablespoon olive oil"
        },
        {
            "10": "1 Chipotle-Tomatillo Salsa-"
        },
        {
            "11": "0.5 pound tomatillos - husked, stemmed, and halved"
        },
        {
            "12": "4 cloves garlic, peeled"
        },
        {
            "13": "1 tablespoon olive oil, or more if needed"
        },
        {
            "14": "2  chipotle peppers in adobo sauce"
        },
        {
            "15": "1 tablespoon olive oil"
        },
        {
            "16": "1 salt and ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Mix together garlic, brown sugar, chili powder, pepper, salt, and cumin until blended. Spread a heavy coating of the spice blend over both sides of flank steak and place in a large glass baking dish. Cover the dish with plastic wrap and marinate in the refrigerator for 4 to 8 hours."
        },
        {
            "2": "Preheat one side of an outdoor grill for medium-high heat and lightly oil the grate. Remove steak from the refrigerator and brush lightly with 1 tablespoon oil."
        },
        {
            "3": "Place steak on the hot side of the grill, cover, and cook for 5 minutes. Flip steak, cover, and cook another 5 minutes. Move steak to to cooler side of the grill, cover, and cook until desired doneness, about 2 to 5 minutes longer. Remove from the grill and let rest for 15 minutes."
        },
        {
            "4": "Meanwhile, preheat the oven to 400 degrees F (200 degrees C). Spread tomatillos and garlic cloves on a baking sheet and drizzle lightly with 1 tablespoon oil."
        },
        {
            "5": "Roast in the preheated oven until vegetables are soft, 10 to 15 minutes. Remove vegetables from the oven and cool slightly, about 5 minutes."
        },
        {
            "6": "Scoop tomatillos and garlic into the bowl of a food processor or blender. Add chipotle peppers and remaining 1 tablespoon olive oil; pulse until blended but still slightly chunky. Pour into a serving dish and let cool."
        },
        {
            "7": "Slice flank steak thinly against the grain and serve with salsa."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 4 hrs 5 mins"
        },
        {
            "Total Time": " 4 hrs 55 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "228"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "7g"
        },
        {
            "Protein": "19g"
        }
    ],
    "Images": [],
    "main category": "meat_&_chicken"
}