{
    "title": "Eight-Day Icicle Pickles",
    "Category": "Pickles",
    "Ingredients": [
        {
            "1": "10 pounds cucumbers with peel - ends trimmed, halved, seeded, and cut into chunks"
        },
        {
            "2": "2 cups pickling salt"
        },
        {
            "3": "16 cups water"
        },
        {
            "4": "16 cups water"
        },
        {
            "5": "0.5 teaspoons alum"
        },
        {
            "6": "16 cups water"
        },
        {
            "7": "16 cups water"
        },
        {
            "8": "12 cups white sugar"
        },
        {
            "9": "2 tablespoons pickling spice"
        },
        {
            "10": "6 cups white vinegar"
        },
        {
            "11": "1 tablespoon green food coloring"
        },
        {
            "12": "16 cups water"
        },
        {
            "13": "8  1-quart canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Day 1: Place the cucumbers into a large (10-quart) jar or pickle crock. Stir the pickling salt and 16 cups of water (or as needed to cover the cucumbers) into a large pot, and bring to a boil over medium heat, stirring until the salt is dissolved. Pour the boiling salt mixture over the cucumbers, and cover the crock with a cover or dinner plate."
        },
        {
            "2": "Days 2 and 3: Stir the pickles and brine once each day. Cover the crock each time."
        },
        {
            "3": "Day 4: Pour off the brine. Bring 16 more cups of water to a boil, and pour the boiling water over the pickles. Cover."
        },
        {
            "4": "Day 5: Pour off the water from the pickles again, and bring alum and 16 cups of water to a boil. Stir until the alum is completely dissolved. Pour the boiling water-alum mixture over the pickles. Cover."
        },
        {
            "5": "Day 6: In a large pot, boil 16 more cups of water with the sugar, pickling spice, vinegar, and food coloring. Pour the water-alum mixture from the pickles and discard, and pour the boiling sugar mixture over the pickles. Cover."
        },
        {
            "6": "Day 7: Pour off the syrup from the pickles, but retain the syrup. Transfer the syrup into a large pot, bring to a boil again, and pour over the pickles. Cover."
        },
        {
            "7": "Day 8: Pour off and retain the syrup again, and transfer into a large pot. Reboil the syrup over medium heat. Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the pickles into the hot, sterilized jars, and pour the boiling syrup in, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "8": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 minutes."
        },
        {
            "9": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": " 3 hrs"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Additional Time": "7 days 1 hrs"
        },
        {
            "Total Time": "7 days 5 hrs"
        },
        {
            "Servings": "128 "
        },
        {
            "Yield": "8 quarts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "78"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F692063.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}