{
    "title": "Homemade Pickled Beets",
    "Category": "Pickles",
    "Ingredients": [
        {
            "1": "5 pounds beets, stems removed"
        },
        {
            "2": "4 cups white vinegar"
        },
        {
            "3": "2 cups white sugar"
        },
        {
            "4": "0.5 teaspoons pickling salt"
        },
        {
            "5": "0.5 teaspoon ground cloves"
        }
    ],
    "Directions": [
        {
            "1": "Place beets in a large pot. Cover with water and bring to a boil. Reduce heat and cook until beets are tender, 20 to 25 minutes, depending on size."
        },
        {
            "2": "Meanwhile, inspect six 16-ounce jars for cracks and rings for rust, discarding any defective ones. Bring a second pot of water to a boil. Immerse jars in simmering water until beets are ready. Wash new, unused lids in warm soapy water."
        },
        {
            "3": "Drain cooked beets, reserving 1 cup beet water. Let cool until able to handle, 10 to 15 minutes. Peel and slice."
        },
        {
            "4": "Pack beets into the hot, sterilized jars, filling to within 1/2 inch of the top."
        },
        {
            "5": "Strain reserved beet water through a fine-mesh strainer into a saucepan. Add vinegar, sugar, pickling salt, and cloves. Bring to a rapid boil over high heat. Pour hot brine over beets in jars, leaving 1/4-inch of head space. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any residue. Top with lids and screw rings on tightly."
        },
        {
            "6": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 30 minutes."
        },
        {
            "7": "Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 1 hrs 5 mins"
        },
        {
            "Additional Time": " 12 hrs 10 mins"
        },
        {
            "Total Time": " 14 hrs"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 16-ounce jars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "424"
        },
        {
            "Fat": "1g"
        },
        {
            "Carbs": "103g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fc81a06938cf2d3137907b54bbb75bf73%2F1667376168457Screenshot_20221102-035856_Samsung-Internet.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7210333.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}