{
    "title": "Lime Pickles",
    "Category": "Pickles",
    "Ingredients": [
        {
            "1": "2 gallons water"
        },
        {
            "2": "2 cups pickling lime (calcium hydroxide)"
        },
        {
            "3": "7 pounds cucumbers, cut into chunks"
        },
        {
            "4": "6 cups cold vinegar"
        },
        {
            "5": "8 cups white sugar"
        },
        {
            "6": "2 teaspoons pickling spice"
        },
        {
            "7": "1 teaspoon salt"
        },
        {
            "8": "1 teaspoon celery seed"
        },
        {
            "9": "0.5 teaspoon whole cloves"
        },
        {
            "10": "1 drop food coloring, or as desired"
        }
    ],
    "Directions": [
        {
            "1": "Mix 2 gallons water and pickling lime together in a large bowl; add cucumbers and soak, stirring often, for 24 hours. Drain and thoroughly rinse cucumbers under cold water."
        },
        {
            "2": "Fill a large bowl with ice water and soak cucumbers for 3 hours; drain."
        },
        {
            "3": "Pour cold vinegar into a large pot. Mix sugar, pickling spice, salt, celery seed, cloves, and food coloring into vinegar until dissolved. Add cucumbers; let sit, 8 hours to overnight."
        },
        {
            "4": "Bring cucumber mixture to a boil; remove pot from heat."
        },
        {
            "5": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack cucumber mixture into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings."
        },
        {
            "6": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes."
        },
        {
            "7": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "5 mins"
        },
        {
            "Additional Time": "1 day 11 hrs"
        },
        {
            "Total Time": "1 day 11 hrs 25 mins"
        },
        {
            "Servings": "100 "
        },
        {
            "Yield": "5 1/2 quarts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "67"
        },
        {
            "Carbs": "17g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6992295.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5557067.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5557073.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}