{
    "title": "Red-Hot Cinnamon Pickles",
    "Category": "Pickles",
    "Ingredients": [
        {
            "1": "12 large cucumbers - peeled, seeded, and quartered lengthwise"
        },
        {
            "2": "1 cup pickling lime (calcium hydroxide)"
        },
        {
            "3": "1 gallon water"
        },
        {
            "4": "1 gallon cold water, or as needed to cover"
        },
        {
            "5": "0.75 cups white vinegar, divided"
        },
        {
            "6": "0.25 cups water, divided"
        },
        {
            "7": "6.0 ounces cinnamon red hot candies"
        },
        {
            "8": "0.5 teaspoons red food coloring"
        },
        {
            "9": "0.5 teaspoon alum"
        },
        {
            "10": "0.25 cups white sugar"
        },
        {
            "11": "4 (4 inch) cinnamon sticks"
        },
        {
            "12": "6 pint-sized canning jars with rings and lids-"
        }
    ],
    "Directions": [
        {
            "1": "Put cucumber spears in a large container. Stir pickling lime into 1 gallon water in a large pitcher until the lime is dissolved; pour over the cucumbers. Refrigerate for 24 hours."
        },
        {
            "2": "Drain cucumbers and rinse well; return to large container. Pour enough cold water over the drained cucumbers to cover. Soak at least 3 hours; drain. Transfer cucumbers to a large pot."
        },
        {
            "3": "Stir 1 1/4 cup vinegar and 1 1/4 cup water together in a bowl; add cinnamon red hot candies. Set aside to soak, stirring occasionally."
        },
        {
            "4": "Stir 1/2 cup vinegar, red food coloring, and alum together in a bowl until alum is dissolved; pour over the cucumbers. Put a lid on the pot, place the pot over medium heat, and bring the water to a boil. Reduce heat to low and simmer for 2 hours; drain and return cucumbers to the pot."
        },
        {
            "5": "Pour cinnamon candy mixture into a saucepan; add sugar and cinnamon sticks. Bring the mixture to a boil; cook and stir until the candies and sugar are dissolved completely into a syrupy liquid. Pour the liquid over the drained cucumbers. Refrigerate 8 hours to overnight."
        },
        {
            "6": "Drain liquid from the cucumbers into a heavy saucepan; bring to a boil and pour again over the cucumbers. Refrigerate 24 hours."
        },
        {
            "7": "Drain liquid again from the cucumbers into a heavy saucepan; bring to a boil and pour again over the cucumbers. Refrigerate another 24 hours."
        },
        {
            "8": "Heat cucumbers and syrup to a boil."
        },
        {
            "9": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack cucumbers into the hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. Refrigerate until chilled before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": " 2 hrs 15 mins"
        },
        {
            "Additional Time": "3 days 11 hrs"
        },
        {
            "Total Time": "3 days 14 hrs 15 mins"
        },
        {
            "Servings": "48 "
        },
        {
            "Yield": "6 pint jars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "63"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "16g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1852303.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1081154.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "per_spesipic_ingridiant"
}