{
    "title": "Brown Butter Carrot Sheet Cake with Brown Butter-Cream Cheese Frosting",
    "Category": "Carrot Cake",
    "Ingredients": [
        {
            "1": "1 Carrot Cake-"
        },
        {
            "2": "1 cup unsalted butter"
        },
        {
            "3": "0.75 cups all-purpose flour"
        },
        {
            "4": "2 teaspoons baking soda"
        },
        {
            "5": "0.5 teaspoon baking powder"
        },
        {
            "6": "0.5 teaspoons ground cinnamon"
        },
        {
            "7": "0.5 teaspoon ground allspice"
        },
        {
            "8": "0.5 teaspoon ground nutmeg"
        },
        {
            "9": "0.5 teaspoon salt"
        },
        {
            "10": "1 cup firmly packed dark brown sugar"
        },
        {
            "11": "4  eggs, at room temperature"
        },
        {
            "12": "0.5 teaspoons vanilla extract"
        },
        {
            "13": "3 cups shredded carrots"
        },
        {
            "14": "0.5 cup chopped walnuts"
        },
        {
            "15": "0.5 cup raisins"
        },
        {
            "16": "1 Brown Butter-Cream Cheese Frosting-"
        },
        {
            "17": "6 tablespoons unsalted butter"
        },
        {
            "18": "1 (8 ounce) package cream cheese, softened"
        },
        {
            "19": "3 cups powdered sugar"
        },
        {
            "20": "1 teaspoon vanilla extract"
        },
        {
            "21": "1 pinch salt"
        }
    ],
    "Directions": [
        {
            "1": "Place butter in a light-colored saucepan over medium heat. Cook, swirling the pan constantly, until butter is bubbling, smells nutty, and browned bits begin to form on the bottom of the pan, 5 to 10 minutes. Immediately remove from heat and pour butter into a heat-safe bowl. Allow brown butter to cool to room temperature, about 15 minutes."
        },
        {
            "2": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 12x16-inch pan and line with parchment paper."
        },
        {
            "3": "Whisk together flour, baking soda, baking powder, cinnamon, allspice, nutmeg, and salt in a bowl."
        },
        {
            "4": "Beat cooled brown butter and brown sugar in a large bowl with an electric mixer on medium speed until well combined. Beat in eggs, one at a time, mixing well after each addition, until mixture is light and fluffy. Mix in vanilla. Pour in 1/2 of the flour mixture and mix until just combined. Add in remaining flour mixture and mix until just combined."
        },
        {
            "5": "Fold in shredded carrots, walnuts, and raisins. Pour batter into the prepared pan and smooth out the top with a spatula."
        },
        {
            "6": "Bake in the preheated oven until cake is golden and a toothpick inserted into the center of it comes out clean, 23 to 27 minutes. Transfer onto a wire rack and cool completely, about 30 minutes."
        },
        {
            "7": "While cake is cooling, repeat step 1 to brown butter for the frosting. Let cool to room temperature, about 15 minutes."
        },
        {
            "8": "Beat cream cheese in a large bowl with an electric mixer on medium-high speed until completely smooth. Add in cooled brown butter and mix until thoroughly combined. Mix in powdered sugar, 1 cup at a time, beating well after each addition. Mix in vanilla and salt. Beat frosting at medium-high speed until completely smooth, 1 to 2 minutes."
        },
        {
            "9": "Spread frosting over the cooled cake. Chill cake until ready to serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 45 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "1 sheet cake"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "298"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "36g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7755019.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7790811.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "cakes"
}