{
    "title": "Swiss Almond Carrot Cake (Aargauer Rueblitorte)",
    "Category": "Carrot Cake",
    "Ingredients": [
        {
            "1": "1 teaspoon butter"
        },
        {
            "2": "4  eggs, separated"
        },
        {
            "3": "1 cup white sugar"
        },
        {
            "4": "0.5 cups peeled and grated carrots"
        },
        {
            "5": "0.5 cups ground almonds"
        },
        {
            "6": "1  lemon, zested and juiced"
        },
        {
            "7": "0.5 cup all-purpose flour"
        },
        {
            "8": "1 teaspoon baking powder"
        },
        {
            "9": "1 pinch salt"
        },
        {
            "10": "1 Decoration-"
        },
        {
            "11": "5 ounces marzipan"
        },
        {
            "12": "1 drop green gel food coloring, or as needed"
        },
        {
            "13": "1 drop orange gel food coloring, or as needed"
        },
        {
            "14": "1 cup confectioners' sugar"
        },
        {
            "15": "1 tablespoon fresh lemon juice, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch springform pan."
        },
        {
            "2": "Beat egg yolks and sugar together in a large bowl with an electric mixer until fluffy. Beat in carrots, almonds, lemon juice, and lemon zest."
        },
        {
            "3": "Mix flour, baking powder, and salt together in a bowl and add to the batter. Stir well to combine."
        },
        {
            "4": "Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Fold into the cake batter with a spatula. Pour batter into the prepared springform pan."
        },
        {
            "5": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 50 minutes. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Remove carefully and place on a serving plate or cooling rack. Let cool, about 30 minutes."
        },
        {
            "6": "Knead marzipan until soft and pliable. Pinch off 1/5 and add a little green food coloring using a toothpick. Knead until marzipan is uniformly green. Color the remaining marzipan orange using the same method. Shape orange marzipan into 12 little carrots and make tiny indentations on top with a paring knife. Shape the green marzipan into little leaves. Stick 2 leaves to the top of each carrot with a little water."
        },
        {
            "7": "Combine confectioners' sugar and enough lemon juice to make a thick icing. Coat cake with the icing. Place marzipan carrots on top around the edges in such a way that each piece of cake has a marzipan carrot. Let icing dry before slicing and serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs 10 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "1 9-inch cake"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "439"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "57g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5181434.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5181435.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "cakes"
}