{
    "title": "Best Tuna Noodle Casserole from Scratch",
    "Category": "Tuna Casserole",
    "Ingredients": [
        {
            "1": "2 (5 ounce) tuna steaks"
        },
        {
            "2": "8 ounces fettuccine noodles"
        },
        {
            "3": "6 tablespoons butter, divided"
        },
        {
            "4": "1 medium onion, diced"
        },
        {
            "5": "6 ounces sliced portobello mushrooms"
        },
        {
            "6": "0.25 cup flour"
        },
        {
            "7": "1.5 cups milk"
        },
        {
            "8": "1 teaspoon chicken bouillon concentrate (such as Better than Bouillon®)"
        },
        {
            "9": "0.5 teaspoon adobo seasoning"
        },
        {
            "10": "0.25 teaspoon black pepper"
        },
        {
            "11": "0.25 cup grated Parmesan cheese"
        },
        {
            "12": "4 slices bread, torn into small pieces"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Lightly oil an ovenproof skillet and an 8x12-inch casserole dish."
        },
        {
            "2": "Place tuna in the prepared skillet and bake in the preheated oven until fish flakes easily with a fork, 8 to 10 minutes."
        },
        {
            "3": "Fill a large saucepan with lightly salted water and bring to a rolling boil. Cook fettuccine at a boil until tender yet firm to the bite, about 8 minutes. Drain and set aside."
        },
        {
            "4": "Remove tuna from the oven; leave oven on."
        },
        {
            "5": "Meanwhile, melt 3 tablespoons butter in a saucepan over medium heat. Cook onion and mushrooms until softened, stirring occasionally, 5 to 7 minutes. Stir in flour until blended. Add milk, bouillon concentrate, adobo seasoning, and black pepper. Cook, stirring constantly, until mixture is slightly thickened, about 5 minutes more. Remove sauce from heat and stir in Parmesan cheese."
        },
        {
            "6": "Place remaining butter in a medium-sized microwave-safe bowl and heat in the microwave until melted, about 30 seconds. Stir bread crumbs into melted butter and set aside."
        },
        {
            "7": "Add cooked fettuccine and flaked tuna to the cheese sauce and toss to combine. Transfer noodle mixture to the prepared casserole dish and top with torn bread."
        },
        {
            "8": "Bake in the hot oven until golden brown, about 20 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "655"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "73g"
        },
        {
            "Protein": "36g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5795829.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}