{
    "title": "Mini Beef Wellingtons with Red Wine Sauce",
    "Category": "Beef Tenderloin",
    "Ingredients": [
        {
            "1": "2 tablespoons vegetable oil"
        },
        {
            "2": "1 salt and pepper to taste"
        },
        {
            "3": "6 (6 ounce) beef tenderloin filets"
        },
        {
            "4": "1 cup chopped fresh mushrooms"
        },
        {
            "5": "0.25 cup red wine"
        },
        {
            "6": "1 cup beef consomme"
        },
        {
            "7": "1 (3 ounce) jar foie gras pate"
        },
        {
            "8": "1 (17.25 ounce) package frozen puff pastry, thawed"
        },
        {
            "9": "1  egg, beaten"
        },
        {
            "10": "3 tablespoons butter"
        },
        {
            "11": "3 tablespoons all-purpose flour"
        },
        {
            "12": "2 tablespoons chopped green onion"
        },
        {
            "13": "1 cup beef consomme"
        },
        {
            "14": "0.5 cup red wine"
        },
        {
            "15": "2 tablespoons butter"
        },
        {
            "16": "2 tablespoons chopped fresh parsley"
        }
    ],
    "Directions": [
        {
            "1": "Heat the oil in a large skillet over medium-high heat. Season the filets with salt and pepper, then fry on each side until browned to lock in the juices. Remove from the skillet and set aside to cool slightly."
        },
        {
            "2": "Add the mushrooms, wine and beef consomme to the skillet; cook and stir over medium heat until mushrooms are tender. Use a slotted spoon to transfer the mushrooms to a small bowl, reserving the consomme. Mix the pate with the mushrooms, adding a little consomme if needed to achieve a spreadable texture. Divide the mushrooms among the filets and spread on the top. Refrigerate about 30 minutes."
        },
        {
            "3": "Preheat the oven to 400 degrees F (200 degrees C). Lay the puff pastry out on a clean surface and cut out two 5 to 6 inch rounds for each steak. You can roll it out a little thinner if you need more area. Place a steak onto a round, and bring the edges up around the sides. Cover the top with a second piece of dough, overlapping the edges and pressing to seal into a package. Repeat with remaining steaks. Place the Wellingtons onto a baking sheet, and brush the tops with beaten egg."
        },
        {
            "4": "Bake for about 12 minutes, for rare, 16 minutes for medium, or 20 minutes for well done. For best results use a meat thermometer to determine the temperature of the steaks, with 140 degrees F (60 degrees C) being medium doneness. Remove from the oven and allow to rest for about 5 minutes."
        },
        {
            "5": "While the steaks are cooking, make the sauce. Melt the butter in a saucepan over medium heat. Stir in the flour and cook, stirring constantly, until browned. Stir in the green onions, and cook until tender, about 1 minute. Gradually stir in the reserved consomme and the remaining 1 cup of consomme; continue to cook and stir until the sauce thickens. Reduce heat to low and stir in the wine. Continue to simmer until thickened, about 15 minutes. Remove from the heat and stir in butter and parsley. Season with salt and pepper to taste."
        },
        {
            "6": "To serve, cut each Wellington in half and spoon some sauce onto the plate."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "1027"
        },
        {
            "Fat": "65g"
        },
        {
            "Carbs": "42g"
        },
        {
            "Protein": "60g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8651674.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7823329.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3910038.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F250159.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}