{
    "title": "Vegan Raspberry Chocolate Tarts",
    "Category": "Raw Food Diet",
    "Ingredients": [
        {
            "1": "1 Crust-"
        },
        {
            "2": "1 cup firmly packed pitted dates"
        },
        {
            "3": "0.5 cup walnuts"
        },
        {
            "4": "1 Ganache-"
        },
        {
            "5": "0.5 cups vegan chocolate chips"
        },
        {
            "6": "1 tablespoon coconut oil"
        },
        {
            "7": "0.5 cup coconut cream (mix solid and liquid creams together before measuring)"
        },
        {
            "8": "3 tablespoons unsweetened cocoa powder"
        },
        {
            "9": "1 Raspberry Filling-"
        },
        {
            "10": "6 ounces fresh raspberries"
        }
    ],
    "Directions": [
        {
            "1": "Combine dates and walnuts in the bowl of a food processor and blend until well combined, about 2 minutes. Press about 2 tablespoons of mixture into the bottom of 12 mini tart pans. Place in the freezer while making ganache."
        },
        {
            "2": "Place chocolate chips and coconut oil in top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. Add melted chocolate to the bowl of the food processor. Add coconut cream and cocoa powder and mix on high until smooth, about 1 minute."
        },
        {
            "3": "Remove crusts from the freezer. Spoon about 1 1/2 teaspoons of ganache on top of each crust, spreading to the edges. Add enough to reach halfway up the side of the tart cup. Place tarts back in the freezer until firm, about 10 minutes."
        },
        {
            "4": "Mash raspberries in a bowl with a fork until they have the consistency of sauce. Spread a layer of mashed raspberries onto the hardened ganache layer, but don't go all the way to the edges. Freeze until sauce is firm and won't collapse when topped with ganache, about 20 minutes."
        },
        {
            "5": "Remove tarts from freezer. Add the remaining ganache to the top, spreading all the way to the edges. Try to seal in the raspberry sauce as much as possible. Return to the freezer to firm up. Keep tarts in the refrigerator if you are serving them within 2 hours."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "5 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 chocolate tarts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "321"
        },
        {
            "Fat": "27g"
        },
        {
            "Carbs": "31g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5122686.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "healty_&_diets"
}