{
    "title": "Texas Sausage Kolaches (Klobasneks)",
    "Category": "Cooking for a Crowd",
    "Ingredients": [
        {
            "1": "0.5 cup milk"
        },
        {
            "2": "0.5 cup white sugar"
        },
        {
            "3": "0.25 cup unsalted butter"
        },
        {
            "4": "1 teaspoon salt"
        },
        {
            "5": "0.5 cup warm water"
        },
        {
            "6": "2 (.25 ounce) packages active dry yeast"
        },
        {
            "7": "2.0 cups all-purpose flour, divided"
        },
        {
            "8": "2 large eggs, beaten"
        },
        {
            "9": "4 tablespoons unsalted butter, melted, divided"
        },
        {
            "10": "1 (8 ounce) smoked breakfast sausage links (such as Eckrich®)"
        },
        {
            "11": "1 (8 ounce) package sharp Cheddar cheese"
        }
    ],
    "Directions": [
        {
            "1": "Heat milk in a small saucepan over medium heat until it begins to bubble; remove from heat immediately. Stir in sugar, 1/4 cup butter, and salt and stir until sugar is dissolved. Set aside to cool to room temperature, about 10 minutes."
        },
        {
            "2": "Combine warm water and yeast in the large bowl of a stand mixer and stir until dissolved. Stir in 2 cups flour, cooled milk mixture, and eggs; beat using the dough hook attachment until smooth. Add remaining flour, mixing as you go, just until dough is elastic and slightly stiff, but not dry."
        },
        {
            "3": "Turn dough out onto a floured board and knead until smooth and very elastic, 10 to 15 minutes. Brush dough lightly with some of the melted butter and place in a bowl. Cover with plastic wrap or a damp towel and let sit in a warm place to double in size, about 1 hour."
        },
        {
            "4": "Meanwhile, cut sausages in half and pat dry (this is important). Thinly slice Cheddar cheese block from the short end so that each slice of cheese is about the same length as the halved sausages."
        },
        {
            "5": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet."
        },
        {
            "6": "Turn risen dough out onto a very lightly floured board. Roll into a log, cut into 5 equal pieces, and cut each piece into quarters to make 20 equal-sized pieces of dough. Use the palm of your hand to flatten and press 1 piece into a circle or oval. Add 1 piece of Cheddar cheese topped with 1 sausage half. Roll dough around fillings and very tightly pinch all seams together to seal. Smooth seams down and place kolache on the prepared baking sheet. Repeat with remaining dough and filling to make 20 kolaches. Brush the tops of kolaches with remaining melted butter."
        },
        {
            "7": "Bake in the preheated oven until golden, 12 to 15 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 1 hrs 10 mins"
        },
        {
            "Total Time": " 2 hrs 10 mins"
        },
        {
            "Servings": "20 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "264"
        },
        {
            "Fat": "13g"
        },
        {
            "Carbs": "27g"
        },
        {
            "Protein": "9g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F18d5ba26641e54238f83a7aef0347ba8%2F1666845963927268998-texas-sausage-kolaches-klobasneks-humblepieliving-003.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F44af6032c27eda3f66090e408cfb3405%2F165395964379ACE8A6-461E-4E0A-B300-018A24092013.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9173574.jpg"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8859065.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}