{
    "title": "Crispy (No-Fry) Potato Pancake Poppers",
    "Category": "Breakfast Potatoes",
    "Ingredients": [
        {
            "1": "3 tablespoons butter, melted"
        },
        {
            "2": "2 large russet potatoes, peeled"
        },
        {
            "3": "0.5 tablespoon garlic powder"
        },
        {
            "4": "0.5 teaspoons kosher salt"
        },
        {
            "5": "0.25 teaspoon ground black pepper"
        },
        {
            "6": "1 pinch cayenne pepper, or to taste"
        },
        {
            "7": "1 tablespoon olive oil"
        },
        {
            "8": "1 tablespoon all-purpose flour"
        },
        {
            "9": "0.5 cup finely grated Parmigiano-Reggiano cheese"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 450 degrees F (230 degrees C). Very generously brush melted butter into the bottom and sides of 24 mini muffin cups. Place the tin(s) on a baking sheet and set aside until needed."
        },
        {
            "2": "Add cold water to a large bowl until 1/3 full. Grate potatoes into the cold water, then fill the bowl almost to the top with more cold water. Swish the potatoes around with your hands to rinse off the starch, then pour off most of the water and refill with more cold water. Continue this process until the water runs almost clear. Pour potatoes into a colander and let drain for a few minutes."
        },
        {
            "3": "Transfer grated potatoes to a clean kitchen towel. Wrap potatoes in the towel and squeeze over a bowl until no more liquid comes out."
        },
        {
            "4": "Transfer potatoes to a clean bowl and add garlic powder, salt, pepper, cayenne, and olive oil. Sprinkle flour over top, then add Parmigiano-Reggiano. Mix and toss gently with your hands until thoroughly combined and mixture feels damp."
        },
        {
            "5": "Grab potato mixture from the bottom of the bowl to get as much moisture as possible, and fill the prepared muffin cups. It's okay if the mixture comes up above the pan by 1/2 to 1 inch."
        },
        {
            "6": "Bake in the center of the preheated oven until golden brown on top, caramelized on the bottom, and crispy all over, 40 to 45 minutes."
        },
        {
            "7": "Remove from the oven and let sit in the pan for 5 minutes before flipping them over onto the baking sheet."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "24 poppers"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "204"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "24g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/oSHKWrl53SXmt7oisWjUQWa9ZY0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_1168-2000-a997a250e54b49f5b62477ae8876c75b.jpg"
        }
    ],
    "main category": "breakfast"
}