{
    "title": "Instant Pot® Make-Ahead Breakfast Burritos",
    "Category": "Meal Prep",
    "Ingredients": [
        {
            "1": "3 silicone ice cube trays for water bottles"
        },
        {
            "2": "1 cooking spray"
        },
        {
            "3": "12 slices bacon, cooked and crumbled"
        },
        {
            "4": "0.75 cup shredded Cheddar cheese"
        },
        {
            "5": "0.5 cup chopped green bell pepper"
        },
        {
            "6": "3  green onions, chopped"
        },
        {
            "7": "12 large eggs"
        },
        {
            "8": "0.25 cup half-and-half"
        },
        {
            "9": "1 salt and ground black pepper to taste"
        },
        {
            "10": "3 sheets aluminum foil"
        },
        {
            "11": "12 (8 inch) flour tortillas"
        }
    ],
    "Directions": [
        {
            "1": "Spray ice cube trays with nonstick cooking spray. Divide bacon, Cheddar cheese, bell pepper, and green onions among the molds."
        },
        {
            "2": "Whisk eggs, half-and-half, salt, and pepper together in a measuring glass with a pour spout. Slowly pour egg mixture into the molds until they are full but not overflowing. Spray foil sheets with cooking spray and seal each mold individually."
        },
        {
            "3": "Pour 1 1/4 cups water into the bottom of a multi-functional pressure cooker (such as Instant Pot®) and place a trivet inside. Carefully stack all 3 molds on top of the trivet."
        },
        {
            "4": "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 30 minutes. Allow 10 minutes for pressure to build."
        },
        {
            "5": "Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Unlock and remove the lid. Transfer molds to a clean work surface, remove foil, and let sit for 5 minutes."
        },
        {
            "6": "Turn molds over to release the cooked filling. Place one in the center of each flour tortilla and roll into burritos. Let burritos cool. Wrap in parchment paper, place in a large resealable plastic bag, and freeze."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "20 mins"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 burritos"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "333"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "29g"
        },
        {
            "Protein": "17g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8213633.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "side_dishes"
}