{
    "title": "Cinnamon Roll Monkey Bread",
    "Category": "Monkey Bread",
    "Ingredients": [
        {
            "1": "1 butter-flavored nonstick cooking spray"
        },
        {
            "2": "0.75 cup white sugar"
        },
        {
            "3": "0.25 cup light brown sugar"
        },
        {
            "4": "2 tablespoons ground cinnamon"
        },
        {
            "5": "0.5 teaspoon ground nutmeg"
        },
        {
            "6": "4 (12.4 ounce) packages refrigerated cinnamon roll dough with icing (such as Pillsbury® Grands!®)"
        },
        {
            "7": "0.75 cup chopped pecans"
        },
        {
            "8": "0.25 cups unsalted butter, at room temperature, divided"
        },
        {
            "9": "0.5 cup confectioners' sugar"
        },
        {
            "10": "0.25 cup lemon-lime flavored carbonated beverage (such as 7-Up®)"
        },
        {
            "11": "0.25 cup rolled oats"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C). Spray a fluted tube pan (such as Bundt®) with butter-flavored cooking spray."
        },
        {
            "2": "Mix white sugar, brown sugar, cinnamon, and nutmeg together in a bowl."
        },
        {
            "3": "Open the refrigerated cinnamon rolls. Divide rolls by package, then cut into quarters with a pizza/dough cutter."
        },
        {
            "4": "Place each package of cut cinnamon roll pieces in the sugar mixture and toss until covered, keeping them separated. Do not discard excess sugar mixture."
        },
        {
            "5": "Layer each separate portion of sugar-coated cinnamon roll pieces in the bottom of the prepared pan, sprinkling with pecans as you go, ending with pecans on top."
        },
        {
            "6": "Combine excess sugar mixture with 3/4 cup of butter in a saucepan over medium-low heat; bring to a boil. Pour butter mixture over the cinnamon roll pieces."
        },
        {
            "7": "Bake in the preheated oven until the top is crispy, about 40 minutes. Remove and allow to cool for 10 minutes."
        },
        {
            "8": "While cooling, mix confectioners' sugar, lemon-lime beverage, oats, and remaining 1/2 cup of room temperature butter together for icing."
        },
        {
            "9": "Remove the bread from the Bundt® pan, then drizzle the icing over the bread to taste."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "1 Bundt(R) pan"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "709"
        },
        {
            "Fat": "39g"
        },
        {
            "Carbs": "86g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [],
    "main category": "flour"
}