{
    "title": "Homemade Smash Burgers",
    "Category": "Burgers",
    "Ingredients": [
        {
            "1": "4  hamburger buns"
        },
        {
            "2": "2 tablespoons butter, softened, or as needed"
        },
        {
            "3": "1 pound ground chuck beef (80% lean)"
        },
        {
            "4": "24.0squares parchment paper"
        },
        {
            "5": "1 salt to taste"
        },
        {
            "6": "4 slices American cheese"
        },
        {
            "7": "1 burger toppings of choice"
        }
    ],
    "Directions": [
        {
            "1": "Preheat an outdoor grill for high heat and lightly oil the grate. Set a cast iron flat-top griddle or large cast iron skillet onto the grill and preheat until smoking."
        },
        {
            "2": "Spread butter on the inside of the buns and toast on the flat-top until lightly browned. Set aside."
        },
        {
            "3": "Form meat into 8 loosely-packed balls, 2 ounces each. Do not pack the meat tightly, as this will prevent it from smashing properly. Place each ball on the hot flat-top, cover with a piece of parchment (to prevent sticking to the spatula; re-use each parchment square on a second patty) and immediately smash down to a 1/4 inch thickness using 2 stiff, sturdy spatulas that are criss-crossed to get proper leverage as you press down. You may also use the bottom of small skillet. Sprinkle the meat with salt."
        },
        {
            "4": "Grill for about 45 seconds, until the edges are dark brown and the centers are a light pink color. Using a bench scraper or firm spatula, gently scrape up the patties, flip over and immediately cover 4 of them with cheese. Grill an additional 15 to 20 seconds; stack the plain patties over the cheese-covered patties so you have 4 stacks. Move each stack to a bun and serve with your favorite toppings."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "2 mins"
        },
        {
            "Total Time": "17 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 burgers"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "632"
        },
        {
            "Fat": "47g"
        },
        {
            "Carbs": "22g"
        },
        {
            "Protein": "29g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F494503744120e878618bb7147fe41946%2F1666593446836554E02A6-743C-4E83-B165-DAF7CA4CBC21.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}