{
    "title": "Vegan Butternut Squash Soup with Almond Milk",
    "Category": "Butternut Squash Soup",
    "Ingredients": [
        {
            "1": "3 cloves garlic"
        },
        {
            "2": "2 tablespoons olive oil, plus more for brushing"
        },
        {
            "3": "1  sweet onion, chopped"
        },
        {
            "4": "3 cups peeled and cubed butternut squash"
        },
        {
            "5": "3 cups vegetable broth"
        },
        {
            "6": "1 salt and ground black pepper to taste"
        },
        {
            "7": "1 cup unsweetened vanilla-flavored almond milk, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Cut off the top 1/4-inch of the garlic cloves and brush the cut cloves with a small amount of olive oil. Wrap in aluminum foil."
        },
        {
            "3": "Bake in the preheated oven until cloves are tender and browned, about 45 minutes. Let cool until safe to handle, about 5 minutes; chop."
        },
        {
            "4": "Heat olive oil in a 5-quart pot over medium-high heat. Add garlic and onion; saute until onion is translucent, about 5 minutes. Add butternut squash and broth. Season with salt and pepper. Bring to a boil, reduce heat, and simmer until squash is soft, about 30 minutes. Remove soup from heat and let cool slightly, about 30 minutes."
        },
        {
            "5": "Fill blender halfway with soup. Add about 1/2 cup of almond milk. Cover and hold lid down with a potholder; pulse a few times before leaving on to blend for 1 minute. Pour into a pot. Repeat with remaining soup and almond milk. Return soup to the stove over low heat before serving; cook until heated through, about 3 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs 23 mins"
        },
        {
            "Additional Time": "35 mins"
        },
        {
            "Total Time": " 2 hrs 18 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "4 quarts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "115"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "16g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F718889.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "soups"
}