{
    "title": "Chicken Chilaquiles Casserole",
    "Category": "Chilaquiles",
    "Ingredients": [
        {
            "1": "10 (6 inch) corn tortillas, each cut into 8 wedges"
        },
        {
            "2": "1 Vegetable oil spray"
        },
        {
            "3": "2  poblano chiles, steamed, seeded, and chopped coarse"
        },
        {
            "4": "2  onions, minced"
        },
        {
            "5": "2 teaspoons Melt® Organic Buttery Spread"
        },
        {
            "6": "1 Salt"
        },
        {
            "7": "0.25 cup minced fresh cilantro"
        },
        {
            "8": "6 cloves garlic, minced"
        },
        {
            "9": "2 teaspoons minced canned chipotle peppers in adobo sauce"
        },
        {
            "10": "1 (14.5 ounce) can whole peeled tomatoes"
        },
        {
            "11": "0.75 cup low-sodium chicken broth"
        },
        {
            "12": "0.5 pounds boneless chicken breasts, trimmed"
        },
        {
            "13": "1 Pepper"
        },
        {
            "14": "3 ounces crumbled queso fresco or feta cheese"
        },
        {
            "15": "0.25 cup low-fat sour cream"
        },
        {
            "16": "1 tablespoon fresh lime juice"
        },
        {
            "17": "1  tomato, cored, seeded and chopped medium"
        }
    ],
    "Directions": [
        {
            "1": "Adjust the oven racks to the upper-middle and lower-middle positions and heat the oven to 350 degrees. Spread the tortilla wedges on 2 rimmed baking sheets. Lightly coat both sides of the tortilla with vegetable oil spray."
        },
        {
            "2": "Bake the tortilla wedges until they are lightly browned and begin to crisp, 8 to 12 minutes. Flip the tortilla wedges and continue to bake until the chips are fully toasted, 8 to 12 minutes longer. Set the tortilla wedges aside and turn the oven to 500 degrees."
        },
        {
            "3": "Combine the poblano chiles, 1 cup of the onions, Melt®, and 1/8 teaspoon salt in a 12-inch skillet. Cover and cook over medium-low heat until the vegetables are softened, 8 to 10 minutes. Uncover, increase the heat to medium-high, and continue to cook, stirring occasionally, until the vegetables are lightly browned, 4 to 6 minutes longer."
        },
        {
            "4": "Stir in 2 tablespoons of the cilantro, garlic, and chipotles and cook until fragrant, about 30 seconds. Stir in the tomatoes with their juice and the broth. Pat the chicken breasts dry with paper towels and season with 1/8 teaspoon pepper. Nestle the chicken breasts into the sauce and bring to a simmer over medium-low heat, about 5 minutes. When the sauce simmers, flip the chicken, cover, and continue to cook until the chicken registers 160 to 165 degrees on an instant-read thermometer, 10 to 12 minutes longer."
        },
        {
            "5": "Transfer the chicken to a plate. When cool enough to handle, shred the meat into bite-sized pieces. Process the sauce in a blender until completely smooth, about 1 minute. Return the sauce to the skillet, season with salt and pepper to taste, bring to a simmer over medium heat."
        },
        {
            "6": "Stir in the tortillas and cook until they begin to soften, about 2 minutes. Stir in the shredded chicken, then transfer the mixture to an 8-inch square baking dish. Sprinkle with the cheese and bake on the lower-middle rack until hot throughout, 5 to 10 minutes."
        }
    ],
    "Details": [
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "474"
        },
        {
            "Fat": "11g"
        },
        {
            "Carbs": "52g"
        },
        {
            "Protein": "44g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fdbd8947979c5b4b5f079ebd642005e37%2F5767065.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F992077.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}