{
    "title": "Jalisco-Style Chilaquiles",
    "Category": "Chilaquiles",
    "Ingredients": [
        {
            "1": "6 cups water, divided"
        },
        {
            "2": "3 medium tomatoes, halved"
        },
        {
            "3": "10  dried red chile peppers, or more to taste"
        },
        {
            "4": "2  pasilla chile peppers - stems, seeds, and veins removed"
        },
        {
            "5": "1 salt to taste"
        },
        {
            "6": "15  corn tortillas"
        },
        {
            "7": "2 cups vegetable oil for frying"
        },
        {
            "8": "0.5  onion, finely chopped"
        },
        {
            "9": "0.25 cup crumbled queso fresco, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Combine 3 cups water, tomatoes, and chile peppers in a saucepan and bring to a boil. Reduce heat and simmer until softened, about 8 minutes."
        },
        {
            "2": "Heat remaining 3 cups water in a separate saucepan."
        },
        {
            "3": "Drain tomato-pepper mixture and transfer to a blender. Blend until sauce is smooth, adding about 1/2 cup hot water if needed. Season with salt."
        },
        {
            "4": "Cut tortillas into medium chip-sized pieces using kitchen shears."
        },
        {
            "5": "Heat oil in a heavy-bottomed pot over medium-high heat. Fry tortilla chips in batches until firm and crispy, about 1 minute per batch. Drain on paper towels and let cool."
        },
        {
            "6": "Spread about 1 teaspoon of the hot oil in a large pan. Carefully pour in tomato-pepper sauce. Add 2 1/2 cups hot water and bring to a simmer. Stir in tortilla chips and reduce heat to medium-low. Stir gently until chips are bright orange but still somewhat crunchy, about 1 minute."
        },
        {
            "7": "Transfer to serving plates and garnish with onion and queso fresco."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "407"
        },
        {
            "Fat": "17g"
        },
        {
            "Carbs": "60g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}