{
    "title": "Green Tomato and Pepper Relish",
    "Category": "Relishes",
    "Ingredients": [
        {
            "1": "12 large green tomatoes, cut into large chunks"
        },
        {
            "2": "6 large green bell peppers, cut into large chunks"
        },
        {
            "3": "6 large red bell peppers, cut into large chunks"
        },
        {
            "4": "10 large onions, cut into large chunks"
        },
        {
            "5": "4 cups boiling water, or as needed"
        },
        {
            "6": "4 cups vinegar"
        },
        {
            "7": "5 cups white sugar"
        },
        {
            "8": "1 tablespoon salt"
        },
        {
            "9": "2 teaspoons ground turmeric"
        },
        {
            "10": "1 (8 ounce) jar mustard"
        },
        {
            "11": "6  (1 pint) canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Place green tomatoes, green bell peppers, red bell peppers, and onions in a food processor; pulse until coarsely chopped. Transfer to a large bowl. Pour boiling water over vegetable mixture; drain. Transfer vegetable mixture to a large pot. Add vinegar, sugar, salt, turmeric, and mustard; stir to combine. Bring mixture to a boil until vegetables are softened, 10 minutes."
        },
        {
            "2": "Sterilize the jars, lids, and rings in boiling water for at least 5 minutes. Pack the relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "3": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes."
        },
        {
            "4": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 2 hrs 20 mins"
        },
        {
            "Total Time": " 3 hrs 15 mins"
        },
        {
            "Servings": "64 "
        },
        {
            "Yield": "6 pints"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "88"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "21g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7030379.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fa5efd6e1fbfa2b082a70ca9f8ae33401%2F5865733.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5658286.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4222005.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "dips"
}