{
    "title": "Homemade Sweet Zucchini Relish",
    "Category": "Relishes",
    "Ingredients": [
        {
            "1": "10 small zucchini, ends trimmed"
        },
        {
            "2": "1  red bell pepper, stemmed and seeded"
        },
        {
            "3": "4  onions, peeled"
        },
        {
            "4": "3 tablespoons salt"
        },
        {
            "5": "4 cups white sugar"
        },
        {
            "6": "0.5 cups vinegar"
        },
        {
            "7": "1 teaspoon celery seed"
        },
        {
            "8": "1 teaspoon ground turmeric"
        },
        {
            "9": "0.25 cup cornstarch"
        },
        {
            "10": "12  half pint canning jars with lids and rings"
        }
    ],
    "Directions": [
        {
            "1": "Run zucchini, red bell pepper, and onions through a meat grinder. Transfer ground zucchini mixture to a large bowl; sprinkle with salt. Refrigerate zucchini mixture, overnight or at least 10 hours."
        },
        {
            "2": "Pour zucchini mixture into a large pot; add sugar, vinegar, celery seed, and turmeric. Bring to a boil, stirring constantly, for 15 to 20 minutes. Stir cornstarch into mixture; continue boiling until thickened, about 5 more minutes."
        },
        {
            "3": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings."
        },
        {
            "4": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes."
        },
        {
            "5": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 10 hrs"
        },
        {
            "Total Time": " 10 hrs 50 mins"
        },
        {
            "Servings": "192 "
        },
        {
            "Yield": "12 half-pint jars"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "20"
        },
        {
            "Carbs": "5g"
        },
        {
            "Protein": "0g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1035667.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4463995.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "dips"
}