{
    "title": "Prosciutto-Wrapped Pork Tenderloin with Crispy Sage",
    "Category": "Whole30 Recipes",
    "Ingredients": [
        {
            "1": "1 pound pork tenderloin"
        },
        {
            "2": "1 salt and ground black pepper to taste"
        },
        {
            "3": "1 bunch fresh sage, leaves removed and stems discarded, divided"
        },
        {
            "4": "6 ounces prosciutto"
        },
        {
            "5": "1 tablespoon olive oil, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oven to 350 degrees F (175 degrees C)."
        },
        {
            "2": "Lightly season pork with salt and black pepper. Arrange about 6 sage leaves over tenderloin. Wrap prosciutto around tenderloin and sage, overlapping prosciutto slightly; wrap in plastic wrap and refrigerate to allow prosciutto to set on pork tenderloin, 5 to 10 minutes. Remove plastic wrap."
        },
        {
            "3": "Heat olive oil in a skillet over medium heat. Fry wrapped tenderloin in the hot oil until prosciutto is crispy and lightly browned on all sides, 8 to 10 minutes. Transfer wrapped tenderloin to a baking dish, reserving oil in the skillet."
        },
        {
            "4": "Bake tenderloin in the preheated oven until pork is cooked through, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C)."
        },
        {
            "5": "Heat reserved oil in the skillet over medium heat; fry remaining sage leaves until crispy, adding more oil as needed, about 5 minutes."
        },
        {
            "6": "Slice tenderloin and serve with crispy sage leaves."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "1 pound pork tenderloin"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "294"
        },
        {
            "Fat": "20g"
        },
        {
            "Carbs": "1g"
        },
        {
            "Protein": "26g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9165725.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2930533.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}