{
    "title": "Sheet Pan Chicken Fajita Quesadillas",
    "Category": "Allrecipes Allstars",
    "Ingredients": [
        {
            "1": "1 tablespoon olive oil"
        },
        {
            "2": "1  onion, chopped"
        },
        {
            "3": "1  green bell pepper, chopped"
        },
        {
            "4": "1  red bell pepper, chopped"
        },
        {
            "5": "1 pound skinless, boneless chicken breast, chopped"
        },
        {
            "6": "2 tablespoons water"
        },
        {
            "7": "1 (1.12 ounce) package fajita seasoning mix"
        },
        {
            "8": "8  flour tortillas"
        },
        {
            "9": "2 cups shredded Mexican cheese blend"
        },
        {
            "10": "4 tablespoons sour cream, for serving"
        },
        {
            "11": "4 tablespoons pico de gallo, or to taste"
        },
        {
            "12": "2 tablespoons chopped fresh cilantro, for garnish"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C)."
        },
        {
            "2": "Heat olive oil in a large skillet over medium heat. Add onion and bell peppers and cook until they are just beginning to soften, about 3 minutes. Remove from skillet with a slotted spoon and set aside."
        },
        {
            "3": "Add chicken to the same skillet and cook until no longer pink on the outside, about 5 minutes. Return onion and bell peppers to the skillet. Stir in water and fajita seasoning. Cook and stir until the chicken has cooked completely, about 3 minutes."
        },
        {
            "4": "On a half sheet pan, place 6 tortillas around the edges of the pan so that about half of each tortilla hangs over the side. Place another tortilla in the center to cover the pan completely."
        },
        {
            "5": "Using a slotted spoon, top with the chicken, onion, and pepper mixture in an even layer (being careful not to add too much liquid from the skillet). Finally, sprinkle cheese evenly over the chicken mixture."
        },
        {
            "6": "Place another tortilla in the center on top of all fillings, then fold each tortilla over the toppings towards the center. Place a second half baking sheet on top of tortillas (this will help the quesadilla hold its shape)."
        },
        {
            "7": "Bake in the pre-heated oven for 10 minutes. Remove the top baking sheet and continue baking until the tortillas are golden and crispy, 8 to 12 more minutes."
        },
        {
            "8": "Slice into rectangles and serve topped with sour cream, pico de gallo, and cilantro, if desired."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "8 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "407"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "26g"
        }
    ],
    "Images": [],
    "main category": "cooking_technique_&_channels"
}