{
    "title": "Dutch Oven Macaroni and Cheese",
    "Category": "Macaroni and Cheese",
    "Ingredients": [
        {
            "1": "1 (12 ounce) package seashell pasta"
        },
        {
            "2": "4 tablespoons salted butter"
        },
        {
            "3": "4 tablespoons all-purpose flour"
        },
        {
            "4": "1 cup milk"
        },
        {
            "5": "1 cup heavy cream"
        },
        {
            "6": "1 cup shredded sharp Cheddar cheese"
        },
        {
            "7": "1 cup shredded medium Cheddar cheese"
        },
        {
            "8": "1 cup grated Parmesan cheese, or to taste"
        },
        {
            "9": "1 cup panko bread crumbs, or as needed"
        },
        {
            "10": "0.5 teaspoon salt"
        },
        {
            "11": "0.5 teaspoon garlic salt"
        },
        {
            "12": "0.5 teaspoon ground black pepper"
        },
        {
            "13": "0.25 teaspoon onion powder"
        },
        {
            "14": "0.25 teaspoon taco seasoning mix"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 400 degrees F (200 degrees C)."
        },
        {
            "2": "Bring a large pot of salted water to a boil. Add shells and cook, stirring occasionally, until tender yet firm to the bite, about 9 minutes. Drain and set aside."
        },
        {
            "3": "Heat an oven-safe Dutch oven over medium heat. Melt butter and flour in the hot pot, stirring, until blended; pour in milk and heavy cream, whisking continuously, until mixture comes to a boil. Continue to boil, stirring continuously, for 2 minutes. Reduce heat to medium-low; continue to stir until sauce thickens, about 10 minutes."
        },
        {
            "4": "Slowly fold in cheeses until melted and smooth. It is okay to raise the heat if you have to, just remember to keep stirring while the heat is on. Fold in cooked pasta until it is coated with cheese."
        },
        {
            "5": "Combine panko bread crumbs, salt, garlic salt, black pepper, onion powder, and taco seasoning in a bowl. Sprinkle macaroni mixture with just enough of the bread crumbs to coat most of the surface; you should still see some pasta underneath the bread crumbs."
        },
        {
            "6": "Bake in the preheated oven for 20 minutes. Turn on the oven's broiler and continue to cook until crust is golden brown and crisp, about 10 minutes. Remove from the oven and let sit for at least 15 to 20 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": " 1 hrs 5 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 30 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "551"
        },
        {
            "Fat": "33g"
        },
        {
            "Carbs": "46g"
        },
        {
            "Protein": "22g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1041952.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "dairy"
}