{
    "title": "Gingerbread Cinnamon Rolls",
    "Category": "Bread Recipes",
    "Ingredients": [
        {
            "1": "1 Dough-"
        },
        {
            "2": "0.5 cup warm whole milk (110 degrees F (43 degrees C))"
        },
        {
            "3": "3 tablespoons molasses"
        },
        {
            "4": "1 (.25 ounce) envelope active dry yeast"
        },
        {
            "5": "0.25 cup granulated sugar"
        },
        {
            "6": "2 teaspoons kosher salt"
        },
        {
            "7": "3.0 cups all-purpose flour, divided, or more as needed"
        },
        {
            "8": "0.5 cup sour cream"
        },
        {
            "9": "6 tablespoons unsalted butter, softened"
        },
        {
            "10": "1 large egg, lightly beaten"
        },
        {
            "11": "1 cooking spray"
        },
        {
            "12": "1 Filling-"
        },
        {
            "13": "0.5 cup unsalted butter, at room temperature"
        },
        {
            "14": "1 cup firmly packed light brown sugar"
        },
        {
            "15": "1 tablespoon molasses"
        },
        {
            "16": "2 teaspoons ground cinnamon"
        },
        {
            "17": "2 teaspoons ground ginger"
        },
        {
            "18": "0.5 teaspoon ground cloves"
        },
        {
            "19": "1 Glaze-"
        },
        {
            "20": "4 ounces cream cheese, at room temperature"
        },
        {
            "21": "4 tablespoons unsalted butter, at room temperature"
        },
        {
            "22": "0.5 cups powdered sugar"
        },
        {
            "23": "0.5 teaspoon vanilla extract"
        },
        {
            "24": "1 tablespoon whole milk, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine warm milk, molasses, and yeast in a small bowl and stir together until combined. Let sit until foamy, about 5 minutes."
        },
        {
            "2": "Add sugar, salt, and 4 1/2 cups of the flour to the work bowl of a stand mixer fitted with the paddle attachment. Beat on low speed until just combined, about 15 seconds. With mixer running on low speed, add milk mixture, sour cream, butter, and egg. Continue beating until dough forms, 1 to 2 minutes. Switch to a dough hook attachment. Beat on medium-low speed until dough is smooth and elastic, 6 to 9 minutes; add remaining 1/4 cup flour 1/2 to 1 teaspoon at a time, if necessary."
        },
        {
            "3": "Place dough in a large bowl greased with cooking spray and turn to coat. Cover with a clean kitchen towel. Let rise in a warm draft-free place until dough has doubled in size, 1 hour 30 minutes to 2 hours."
        },
        {
            "4": "Spray a 13x 9-inch pan with cooking spray. Lightly punch down dough. On a lightly floured surface, roll dough into an 18x10-inch rectangle."
        },
        {
            "5": "Spread 1/2 cup butter over dough for the filling. In a small bowl, stir together brown sugar, molasses, cinnamon, ginger, and cloves until well combined. Sprinkle evenly over butter. Starting with one long side, roll dough into a log, pinching seam to seal. Slice into 12 rolls. Place rolls in the prepared pan. Cover, and let rise in a warm draft-free place until doubled in size, 45 to 60 minutes."
        },
        {
            "6": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "7": "Bake in the preheated oven, uncovered, until golden brown, 25 to 30 minutes. Let cool in the pan on a wire rack for 15 minutes."
        },
        {
            "8": "Add cream cheese and 4 tablespoons butter to the bowl of a stand mixer fitted with the paddle attachment; beat on medium speed until smooth, 1 to 2 minutes. Add powdered sugar, vanilla, and milk. Beat on medium speed until smooth, about 1 minute. If desired, add more milk, 1 teaspoon at a time, until desired consistency is reached. Spread glaze over warm rolls."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Rise Time": " 2 hrs 25 mins"
        },
        {
            "Bake Time": "25 mins"
        },
        {
            "Cool Time": "15 mins"
        },
        {
            "Total Time": " 3 hrs 50 mins"
        },
        {
            "Servings": "12 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "530"
        },
        {
            "Fat": "24g"
        },
        {
            "Carbs": "73g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [],
    "main category": "flour"
}