{
    "title": "Squash Blossom Chile Relleno with Walnut Cream Sauce",
    "Category": "Chile Rellenos",
    "Ingredients": [
        {
            "1": "1 cup shelled walnut halves"
        },
        {
            "2": "2 cups milk, or more as needed, divided"
        },
        {
            "3": "0.25 pound crumbled queso fresco"
        },
        {
            "4": "0.5 cups sour cream"
        },
        {
            "5": "0.5 tablespoons white sugar"
        },
        {
            "6": "0.25 teaspoon ground cinnamon"
        },
        {
            "7": "6  poblano peppers"
        },
        {
            "8": "1 pound chorizo sausage"
        },
        {
            "9": "1 cup squash blossoms, chopped"
        },
        {
            "10": "0.5 cup black beans, rinsed and drained"
        },
        {
            "11": "0.5 cup whole kernel corn, drained"
        },
        {
            "12": "0.5 cups shredded Mexican cheese blend"
        },
        {
            "13": "3  eggs, separated"
        },
        {
            "14": "1 tablespoon all-purpose flour"
        },
        {
            "15": "1 cup all-purpose flour"
        },
        {
            "16": "1 vegetable oil for frying"
        },
        {
            "17": "1 teaspoon pomegranate seeds, or to taste"
        },
        {
            "18": "1 teaspoon chopped fresh cilantro, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Place walnuts into a bowl and cover with milk; soak in the refrigerator 3 to 4 hours to overnight."
        },
        {
            "2": "Drain walnuts and place into a food processor. Add queso fresco, sour cream, sugar, and cinnamon. Puree until completely smooth. Add milk to the food processor as necessary to make creamy. Set sauce aside."
        },
        {
            "3": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil."
        },
        {
            "4": "Place poblano peppers onto the prepared baking sheet."
        },
        {
            "5": "Broil peppers in the preheated oven until skins blacken and blister, about 10 minutes, making sure to turn peppers halfway through cooking time. Remove from the oven and place peppers directly into a plastic resealable bag. Seal and allow to sit and steam for 15 minutes."
        },
        {
            "6": "Remove skins from peppers carefully by scraping them using a spoon or your fingers. Cut a slit down the long side of each pepper. Remove and discard seeds and veins and set peppers aside."
        },
        {
            "7": "Heat a skillet over medium heat. Saute chorizo in the skillet for 2 to 3 minutes. Add squash blossoms and continue cooking until meat is browned and crumbly and blossoms are wilted, 5 to 7 minutes. Stir in black beans and corn; cook 1 to 2 minutes more. Turn off heat and mix in Mexican cheese."
        },
        {
            "8": "Stuff peppers carefully with chorizo mixture, making sure not to overstuff so that peppers can be closed completely. Set aside."
        },
        {
            "9": "Place egg whites and yolks into 2 separate bowls. Whisk 1 tablespoon flour into yolks to make a paste. Beat egg whites using an electric mixer until stiff peaks form. Fold beaten egg whites into yolk mixture very gently to preserve volume of egg whites."
        },
        {
            "10": "Place 1 cup flour onto a plate. Dredge stuffed peppers into flour, covering all sides completely. Dip flour-covered stuffed peppers into egg mixture; entire peppers should be completely covered."
        },
        {
            "11": "Heat oil in a deep-fryer or a deep, heavy pan to 350 degrees F (175 degrees C)."
        },
        {
            "12": "Deep-fry each pepper in the hot oil until golden, 2 to 4 minutes. Transfer to a wire rack to drain grease."
        },
        {
            "13": "Place cooked poblanos onto plates; pour walnut sauce over. Top with pomegranate seeds and cilantro. Serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 3 hrs 15 mins"
        },
        {
            "Total Time": " 4 hrs 25 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 peppers"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "647"
        },
        {
            "Fat": "54g"
        },
        {
            "Carbs": "22g"
        },
        {
            "Protein": "22g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6971486.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}