{
    "title": "Grilled Steak Fajitas",
    "Category": "Fajitas",
    "Ingredients": [
        {
            "1": "1 (1 1/4 pound) flank steak"
        },
        {
            "2": "1 tablespoon salt, divided"
        },
        {
            "3": "1 tablespoon ground black pepper, divided"
        },
        {
            "4": "2  limes"
        },
        {
            "5": "0.5 teaspoon chili powder"
        },
        {
            "6": "1 large green bell pepper, cut into strips"
        },
        {
            "7": "1 large red onion, cut into strips"
        },
        {
            "8": "1 pinch salt and ground black pepper to taste"
        },
        {
            "9": "1 (15 ounce) can black beans, rinsed and drained"
        },
        {
            "10": "1  serving olive oil cooking spray"
        },
        {
            "11": "1 (8 ounce) package shredded Mexican cheese blend"
        },
        {
            "12": "1 (10 ounce) package flour tortillas"
        }
    ],
    "Directions": [
        {
            "1": "Coat both sides of the flank steak with 1 tablespoon each salt and pepper, pressing into the steak. Place in a large freezer bag. Cut both limes in half and squeeze juice into the bag; add chili powder. Make sure all is mixed well and remove the air from the bag. Place in a refrigerator and marinate for about 3 hours."
        },
        {
            "2": "Preheat an outdoor grill for medium-high heat and lightly oil the grate."
        },
        {
            "3": "Season bell pepper and red onion with salt and pepper. Place in a grill pan and set aside."
        },
        {
            "4": "Put black beans in a small pot on the stove over medium heat to heat through."
        },
        {
            "5": "Cook steak on the preheated grill until browned on one side, 5 to 7 minutes. Spray vegetables with cooking spray and place them on the grill. Cook until vegetables begin to caramelize, turning often so they don't burn, and steak is beginning to firm and is hot and slightly pink in the center, 5 to 7 minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C) for medium doneness. Remove steak and vegetables from the grill."
        },
        {
            "6": "Slice steak into thin strips. Place beans, steak, vegetables, and Mexican cheese onto the tortillas and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 3 hrs"
        },
        {
            "Total Time": " 3 hrs 40 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "467"
        },
        {
            "Fat": "20g"
        },
        {
            "Carbs": "44g"
        },
        {
            "Protein": "29g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8711569.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "main_dishes"
}