{
    "title": "Homemade Chicken Fajitas",
    "Category": "Fajitas",
    "Ingredients": [
        {
            "1": "1 Fajita Seasoning-"
        },
        {
            "2": "1 tablespoon chili powder"
        },
        {
            "3": "1 teaspoon ground cumin"
        },
        {
            "4": "1 teaspoon ground paprika"
        },
        {
            "5": "1 teaspoon salt"
        },
        {
            "6": "1 teaspoon ground black pepper"
        },
        {
            "7": "0.25 teaspoon cayenne pepper"
        },
        {
            "8": "0.25 teaspoon garlic powder"
        },
        {
            "9": "0.5 pounds skinless, boneless chicken breast, cut into strips"
        },
        {
            "10": "4 tablespoons olive oil, or more as needed"
        },
        {
            "11": "2  bell peppers, sliced"
        },
        {
            "12": "1  onion, thinly sliced"
        },
        {
            "13": "8 (6 inch) flour tortillas"
        }
    ],
    "Directions": [
        {
            "1": "Whisk chili powder, paprika, salt, pepper, cayenne pepper, and garlic powder for fajita seasoning together in a small bowl."
        },
        {
            "2": "Trim chicken of any excess fat and place in a large, lidded bowl. Add 2 tablespoons olive oil and sprinkle with about 3/4 of the fajita seasoning. Toss, adding more oil if necessary, until coated. Poke chicken with a knife to allow penetration of seasoning and oil. Place the lid on the bowl and shake until chicken is thoroughly coated. Marinate in the refrigerator, shaking every couple of hours, for 4 to 6 hours."
        },
        {
            "3": "Remove the marinating bowl from the refrigerator and let sit on the counter until chicken is room temperature, about 1 hour."
        },
        {
            "4": "Preheat an outdoor grill for medium heat and lightly oil the grate. Preheat the oven to 350 degrees F (175 degrees C). Make 2 stacks of 4 tortillas, and wrap each one in aluminum foil."
        },
        {
            "5": "Heat remaining 2 tablespoons olive oil in a large skillet over medium heat. Add peppers and onion. Stir in remaining fajita seasoning and cook, stirring occasionally, until vegetables are soft, 8 to 10 minutes."
        },
        {
            "6": "While vegetables are cooking, place tortillas in the oven to warm. At the same time, grill chicken, turning halfway through, until no longer pink in the center and the juices run clear, 2 to 3 minutes per side."
        },
        {
            "7": "To assemble fajitas, fill warmed tortillas with chicken, peppers, and onions."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 5 hrs"
        },
        {
            "Total Time": " 5 hrs 35 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "8 fajitas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "560"
        },
        {
            "Fat": "23g"
        },
        {
            "Carbs": "44g"
        },
        {
            "Protein": "42g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9190832.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "main_dishes"
}