{
    "title": "Air Fryer Mini Croissants with Nutella and Jam",
    "Category": "Breakfast and Brunch",
    "Ingredients": [
        {
            "1": "1 sheet frozen puff pastry, thawed"
        },
        {
            "2": "1 large egg"
        },
        {
            "3": "1 tablespoon water"
        },
        {
            "4": "8 teaspoons chocolate-hazelnut spread (such as Nutella®)"
        },
        {
            "5": "4 teaspoons strawberry jam"
        },
        {
            "6": "1 teaspoon cinnamon sugar, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Preheat air fryer to 300 degrees F (150 degrees C)."
        },
        {
            "2": "Roll out puff pastry on a lightly floured surface into a large square, about 12 inches. Cut into 4 equal squares, and then cut each square in half diagonally, making 8 triangles."
        },
        {
            "3": "Position the triangle so the wide end is facing you, and the point is away from you. Dip your finger tip in some water, and moisten the edges of each triangle. Whisk the egg and tablespoon of water in a small bowl, and set aside."
        },
        {
            "4": "Add about 1 teaspoon Nutella to the center, and top with about 1/2 teaspoon strawberry jam. Starting on the wide end, roll up dough over the filling toward the point, pinching in the dough, so the filling doesn't ooze out, and shaping the ends into a crescent shape. Brush each crescent with egg wash and sprinkle with cinnamon sugar."
        },
        {
            "5": "Line your air fryer basket with a parchment liner or spray with cooking spray. Place the croissants into your air fryer basket, seam side down, so they're not touching."
        },
        {
            "6": "Cook in the air fryer until golden brown,11 to 14 minutes. Your cooking time may vary depending on the size and brand of your air fryer."
        },
        {
            "7": "Transfer to a wire rack and cool for 5 minutes. Serve warm."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "14 mins"
        },
        {
            "Total Time": "29 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 mini croissants"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "211"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [],
    "main category": "breakfast"
}