{
    "title": "Spicy Gluten-Free Chicken and Cheddar Waffles with Blackberry-Maple Syrup",
    "Category": "Breakfast and Brunch",
    "Ingredients": [
        {
            "1": "1 Syrup-"
        },
        {
            "2": "4  fresh blackberries"
        },
        {
            "3": "1 teaspoon ancho chile powder"
        },
        {
            "4": "0.25 teaspoon red pepper flakes"
        },
        {
            "5": "1 cup pure maple syrup"
        },
        {
            "6": "1 Chicken-"
        },
        {
            "7": "2 pounds chicken tenders"
        },
        {
            "8": "1  orange, zested and juiced"
        },
        {
            "9": "1 salt and ground black pepper to taste"
        },
        {
            "10": "0.5 cup coconut flour"
        },
        {
            "11": "0.5 cup almond flour"
        },
        {
            "12": "1 teaspoon minced garlic"
        },
        {
            "13": "1 teaspoon smoked paprika"
        },
        {
            "14": "0.5 cups gluten-free all purpose baking flour"
        },
        {
            "15": "1 tablespoon baking powder"
        },
        {
            "16": "0.5 teaspoon dried rosemary"
        },
        {
            "17": "0.5 teaspoon ground thyme"
        },
        {
            "18": "0.25 teaspoon sea salt"
        },
        {
            "19": "1 cooking spray"
        },
        {
            "20": "1 stick butter, softened"
        },
        {
            "21": "1 tablespoon maple syrup"
        },
        {
            "22": "1 cup shredded sharp Cheddar cheese"
        },
        {
            "23": "3  eggs"
        },
        {
            "24": "0.75 cups almond milk"
        },
        {
            "25": "0.25 cup blackberries for garnish"
        }
    ],
    "Directions": [
        {
            "1": "Muddle 4 blackberries in the bottom of a microwave-safe glass serving jar. Add chile powder and red pepper flakes, then maple syrup; stir syrup briskly until well combined."
        },
        {
            "2": "Place chicken in a large, shallow baking dish. Drizzle with orange juice and season liberally with salt and pepper. Refrigerate until needed. Whisk orange zest with coconut flour, almond flour, garlic, and paprika. Set dredging mixture aside."
        },
        {
            "3": "Mix gluten-free flour, baking powder, rosemary, thyme, and sea salt together in another bowl to start the waffle batter."
        },
        {
            "4": "Preheat the oven to 400 degrees F (200 degrees C). Preheat a waffle iron according to manufacturer's instructions and spray with cooking spray."
        },
        {
            "5": "Beat butter and maple syrup together in a bowl using an electric mixer until creamy. Add eggs 1 at a time. Gradually add the gluten-free flour mixture and milk in 3 alternating batches. Stir in Cheddar cheese just until combined. Pour batter into the preheated waffle iron. Cook until crisp and deeply brown, 6 to 8 minutes per waffle. Place waffles on a baking sheet and keep warm in the preheating oven while preparing chicken."
        },
        {
            "6": "Line another baking sheet with parchment paper. Gently shake excess orange juice off each chicken tender and press all sides into the reserved coconut flour mixture. Place coated chicken on the prepared baking sheet. Remove waffles from oven and keep warm."
        },
        {
            "7": "Bake chicken in the preheated oven, flipping halfway, until browned on both sides, about 20 minutes total. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        },
        {
            "8": "Microwave syrup until warm, about 1 minute. Top each waffle with a warm chicken tender or two and a handful of blackberries. Drizzle with the warmed spicy maple syrup."
        }
    ],
    "Details": [
        {
            "Prep Time": "35 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "678"
        },
        {
            "Fat": "30g"
        },
        {
            "Carbs": "68g"
        },
        {
            "Protein": "39g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5887501.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "breakfast"
}