{
    "title": "Ekmek Turkish Bread",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "0.5 cups bread flour, divided"
        },
        {
            "2": "0.75 cup water, divided"
        },
        {
            "3": "5 teaspoons active dry yeast"
        },
        {
            "4": "1 teaspoon white sugar"
        },
        {
            "5": "2 cups warm water (110 degrees F/45 degrees C)"
        },
        {
            "6": "6 cups bread flour"
        },
        {
            "7": "2 teaspoons salt"
        }
    ],
    "Directions": [
        {
            "1": "To make the starter: Place 1/2 cup flour and 1/4 cup water in a bowl with a lid; stir well. Cover and let sit at room temperature overnight. The next day, add 1/2 cup flour and 1/4 cup water to the bowl. Cover and let sit at room temperature overnight. On the third day, add 1/2 cup flour and 1/4 cup water to the bowl. Cover and let sit at room temperature overnight."
        },
        {
            "2": "To make the dough: In a large bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes."
        },
        {
            "3": "Break the starter into small pieces and add it to the yeast mixture. Stir in 4 cups of flour and salt. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Sprinkle a little flour over the dough and cover it with a dry cloth. Let it rise until doubled in size."
        },
        {
            "4": "Put the dough back onto a lightly floured work surface and punch out the air. Divide the dough in half and knead each piece for 2 to 3 minutes. Shape each piece into a tight oval loaf. Sprinkle two sheet pans with corn meal. Roll and stretch the two loaves until they are 15x12-inch ovals. Dust the tops of the loaves with flour. Cover with a dry cloth and let them rise in a warm place until doubled in size. Meanwhile, preheat the oven to 425 degrees F (220 degrees C)."
        },
        {
            "5": "Bake in the preheated oven for 30 to 40 minutes. Mist with water 3 times in the first 15 minutes. Loaves are done when their bottoms sound hollow when tapped. Let cool on wire racks before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "4 days 2 hrs"
        },
        {
            "Total Time": "4 days 3 hrs 30 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "2 loaves"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "6"
        },
        {
            "Fat": "0g"
        },
        {
            "Carbs": "1g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fbae8513378bb4996a66f2bb7f46aa328%2F4535470.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4535471.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F322792.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}