{
    "title": "Focaccia Barese al Pomodoro e Olive (Homemade Italian Focaccia with Tomatoes and Olives)",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "1  potato, unpeeled"
        },
        {
            "2": "6 cups bread flour"
        },
        {
            "3": "2 cups lukewarm water, divided"
        },
        {
            "4": "1 tablespoon active dry yeast"
        },
        {
            "5": "2 teaspoons white sugar"
        },
        {
            "6": "0.5 cup extra-virgin olive oil, divided"
        },
        {
            "7": "2 tablespoons salt, divided"
        },
        {
            "8": "8  vine tomatoes, halved"
        },
        {
            "9": "1 (6 ounce) can pitted black olives in brine"
        },
        {
            "10": "2 tablespoons water"
        },
        {
            "11": "1 tablespoon dried oregano"
        }
    ],
    "Directions": [
        {
            "1": "Place potato into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and rinse under cold running water."
        },
        {
            "2": "Peel potato; mash in a large bowl with a fork. Pour in flour and mix well with your fingertips. Rub together until mixture is even and free of lumps."
        },
        {
            "3": "Combine 1 cup water, yeast, and sugar in a bowl. Mix well and let stand until frothy, about 5 minutes. Stir in 5 tablespoons olive oil."
        },
        {
            "4": "Pour yeast mixture over flour mixture; mix, adding remaining 1 cup water a little at a time, until a soft dough forms. Mix in 1 tablespoon salt."
        },
        {
            "5": "Knead dough on a clean work surface until smooth and soft, 8 to 10 minutes. Transfer dough to a greased bowl. Cover with a damp cloth; let rise in a warm place until doubled, about 2 hours."
        },
        {
            "6": "Grease a large rimmed baking sheet with 2 tablespoons olive oil. Place dough on the baking sheet; stretch into the corners. Arrange tomatoes and olives over dough."
        },
        {
            "7": "Mix remaining 1 tablespoon olive oil and 2 tablespoons water together in a bowl. Brush mixture over dough. Sprinkle remaining 1 tablespoon salt on top. Cover with a damp cloth; let rise for 30 minutes."
        },
        {
            "8": "Preheat oven to 400 degrees F (200 degrees C)."
        },
        {
            "9": "Bake focaccia on the lower rack of the preheated oven for 15 minutes. Lift up with a fork to check bottom is golden brown. Transfer to the middle rack and bake until top is golden, 10 to 15 minutes more. Sprinkle oregano on top."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 2 hrs 35 mins"
        },
        {
            "Total Time": " 3 hrs 30 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "1 9x13-inch focaccia"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "386"
        },
        {
            "Fat": "12g"
        },
        {
            "Carbs": "59g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5128110.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}