{
    "title": "Focaccia Alla Genovese",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "0.5 cup warm water"
        },
        {
            "2": "0.5 teaspoon active dry yeast"
        },
        {
            "3": "1.0 cups unbleached bread flour"
        },
        {
            "4": "0.5 teaspoon salt"
        },
        {
            "5": "0.5 cup cold water"
        },
        {
            "6": "1 tablespoon extra-virgin olive oil"
        },
        {
            "7": "0.25 cup Biga"
        },
        {
            "8": "1 tablespoon additional extra-virgin olive oil for brushing"
        },
        {
            "9": "2 teaspoons cornmeal for dusting"
        }
    ],
    "Directions": [
        {
            "1": "Place 1/2 cup warm water in a small bowl, and sprinkle yeast over the surface. Let stand until yeast is absorbed, about 10 minutes."
        },
        {
            "2": "Combine flour and salt in a large bowl. Make a well in the center, and pour in the cold water, yeast mixture, 1 tablespoon olive oil, and biga. Stir together using a sturdy wooden spoon."
        },
        {
            "3": "When the dough comes together, turn out onto a floured surface, and knead vigorously for about 20 minutes. Take a few 1 to 2 minute breaks if you like. The dough will be somewhat sticky until it is fully kneaded. Form dough into a ball. Rub the inside of a clean bowl with oil, and place the dough in it. Turn to coat the ball with oil. Cover with a towel and let rise at room temperature until doubled in size. This will take about 1 1/2 hours."
        },
        {
            "4": "Punch down the dough by folding the edges into the center and turning it over so the top is once again smooth. Cover the bowl again, and let the dough rise a second time until doubled, about 45 minutes."
        },
        {
            "5": "Turn the dough out onto a floured surface and gently flatten into an 8 inch square using the palms of your hands. Cover and let rise again."
        },
        {
            "6": "Preheat the oven to 425 degrees F (220 degrees C). Place a baking stone in the oven while it preheats. Dust a bakers peel with cornmeal, and gently slide it under the dough square. Use your fingers to make a dimpled surface by pressing them about 3/4 of the way down into the dough. Mist with water."
        },
        {
            "7": "Sprinkle a little cornmeal over the surface of the baking stone. Slide the square off of the peel onto the baking stone. Mist some water into the hot oven, and quickly shut the door."
        },
        {
            "8": "Bake for 30 minutes in the preheated oven, until the top is golden brown. Remove from the oven to cool on a wire rack. Brush the surface with remaining olive oil while the foccacia is still hot."
        }
    ],
    "Details": [
        {
            "Prep Time": " 3 hrs 30 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Total Time": " 4 hrs 5 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "1 - 8x8 inch loaf"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "377"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "63g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8991532.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F856121.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}