{
    "title": "Gluten-Free Pita Flatbread",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "1 cup lukewarm water, divided, or as needed"
        },
        {
            "2": "1 tablespoon active dry yeast"
        },
        {
            "3": "1 teaspoon honey"
        },
        {
            "4": "1 cup gluten-free bread flour"
        },
        {
            "5": "0.75 cup gluten-free whole grain flour"
        },
        {
            "6": "2 teaspoons extra-virgin olive oil"
        },
        {
            "7": "0.25 teaspoon salt"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 100 degrees F (38 degrees C)."
        },
        {
            "2": "Combine 1/2 cup lukewarm water with yeast and honey. Mix and set aside to proof, 5 to 10 minutes."
        },
        {
            "3": "Combine both gluten-free flours in a stand mixer fitted with the dough hook. Turn mixer to low and while mixing, add oil and salt. Slowly add the yeast mixture; allow to mix. Add remaining lukewarm water, little by little, until all the flour comes together. Depending on your flour mix, you may not need all of the water or you may need more to create a soft dough. Once a ball forms, knead on low speed for exactly 1 minute; the dough will be sticky but manageable."
        },
        {
            "4": "Use your hands to form dough into a ball. Put it back into the mixing bowl and cover with a warm, damp towel. Turn off the oven and put the bowl in the warm oven. Let rise until almost doubled in size, about 45 minutes."
        },
        {
            "5": "Use a kitchen scale and divide the dough into 6 equal balls. Cover again with the damp towel and return to the turned-off oven; let rise for 15 minutes."
        },
        {
            "6": "Roll 1 dough ball between 2 sheets of parchment paper into a 6-inch round pita; avoid using flour or pitas will dry out or burn. Peel the parchment paper away from the dough (not the dough away from the parchment or it will stretch)."
        },
        {
            "7": "Heat a cast iron griddle or comal pan over medium-high heat (7 out of 9 on an electric stovetop). Place the pita on the hot pan and cook until one side has browned slightly and begins to puff up, 2 to 3 minutes. Flip pita and cook until puffy on the other side, another 2 to 3 minutes. Use tongs to press down on the dough; it will continue to puff up."
        },
        {
            "8": "Roll remaining pitas and cook the same way. Pitas are ready to serve when cool to the touch, but still warm."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 1 hrs 5 mins"
        },
        {
            "Total Time": " 1 hrs 45 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 pitas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "156"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "31g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9096806.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "flour"
}