{
    "title": "How To Make Focaccia",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "1 (.25 ounce) package active dry yeast"
        },
        {
            "2": "1 cup warm water (105 degrees F/41 degrees C)"
        },
        {
            "3": "6 tablespoons extra-virgin olive oil, divided"
        },
        {
            "4": "0.75 teaspoon salt"
        },
        {
            "5": "0.25 cup semolina flour"
        },
        {
            "6": "2 teaspoons minced fresh rosemary (Optional)"
        },
        {
            "7": "1.5 cups bread flour, divided"
        },
        {
            "8": "1 teaspoon extra-virgin olive oil"
        },
        {
            "9": "3 tablespoons extra-virgin olive oil, divided"
        },
        {
            "10": "2 teaspoons minced fresh rosemary (Optional)"
        },
        {
            "11": "1 teaspoon coarse sea salt, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Whisk yeast with warm water in a mixing bowl; whisk in 2 tablespoons olive oil, salt, semolina flour, and 2 teaspoons rosemary until thoroughly combined. Mix in 2 1/2 cups bread flour, using a wooden spoon, until dough is too stiff and sticky to mix."
        },
        {
            "2": "Turn dough out onto a floured work surface. Knead, dusting with remaining 1/4 cup bread flour as needed, until dough is soft, smooth, and slightly elastic, 2 to 3 minutes."
        },
        {
            "3": "Drizzle dough with 1 tablespoon olive oil, spreading oil over the dough. Knead briefly, about 2 minutes, to incorporate olive oil. Repeat with 1 more tablespoon oil. Knead 2 or 3 more minutes to incorporate olive oil. Drizzle dough with 1 more tablespoon oil and knead in as before. If dough seems too sticky, knead in a little more flour. Knead until dough is soft, smooth, and elastic, 1 to 2 more minutes (7 to 8 minutes total kneading time)."
        },
        {
            "4": "Drizzle 1 more tablespoon olive oil into a large bowl, place dough into bowl, and turn dough in bowl several times to coat with oil. Cover bowl with aluminum foil and let rise in a warm place until doubled, 1 to 2 hours."
        },
        {
            "5": "Coat a sheet pan lightly with 1 teaspoon olive oil. Turn dough into pan and press gently into a rough rectangular shape using your fingers, pressing out air bubbles. Cover sheet pan loosely with plastic wrap and let rest 15 to 20 minutes to relax the gluten."
        },
        {
            "6": "Drizzle 1 tablespoon more olive oil onto the dough, spread oil onto dough, and poke 3 or 4 oil-covered fingers deeply into the dough to make dimples all over the surface. Poke holes all the way down to the bottom of the pan. Fill in any spaces with holes until entire surface is covered with dimples. Let rise until nearly doubled, about 45 minutes."
        },
        {
            "7": "Preheat oven to 475 degrees F (245 degrees C)."
        },
        {
            "8": "Sprinkle 2 teaspoons minced rosemary over top of dough. Drizzle 1 more tablespoon olive oil onto the surface of the dough and brush on very lightly to avoid moving the rosemary. Sprinkle with sea salt."
        },
        {
            "9": "Bake in the preheated oven until focaccia loaf is lightly golden brown, about 15 minutes. Brush 1 last tablespoon olive oil onto the loaf. Transfer to a rack and let cool before cutting."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 2 hrs 15 mins"
        },
        {
            "Total Time": " 3 hrs"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "1 flat loaf"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "193"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "1g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fd20de4f00b61f59bc23308564840f44a%2F1650159378700ABCCD-D087-4B01-9506-826DA450505C_1_105_c.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9428478.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9089688.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8729140.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/l94wJUo4YvDcc-0eWYdwPQaARmk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8156637-how-to-make-focaccia-Ashley-Hurd-1x1-1-3211183573c24c6b8feed288a9b6f290.jpg"
        }
    ],
    "main category": "flour"
}