{
    "title": "Lebanese Mountain Bread",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "0.5 cups bread flour, divided, or more as needed"
        },
        {
            "2": "1 teaspoon active dry yeast"
        },
        {
            "3": "1 teaspoon white sugar"
        },
        {
            "4": "0.5 cup warm water"
        },
        {
            "5": "1 tablespoon olive oil, plus extra to coat bowl"
        },
        {
            "6": "0.75 teaspoon kosher salt"
        }
    ],
    "Directions": [
        {
            "1": "Place 1/2 cup flour, yeast, and sugar in a mixing bowl. Pour in warm water. Whisk together thoroughly, 2 to 3 minutes. Cover bowl and let sit until mixture gets bubbly, 30 to 60 minutes."
        },
        {
            "2": "Drizzle in olive oil; add salt and remaining 1 cup flour. Mix together until mixture forms a sticky (not wet) dough ball that pulls away from the sides of the bowl. If mixture seems too wet, add a bit more flour."
        },
        {
            "3": "Lightly flour a work surface. Knead dough until it is soft, supple, and slightly elastic, about 2 minutes. Pour a few drops of olive oil in a bowl. Transfer dough ball to the bowl and turn to coat surface with oil."
        },
        {
            "4": "Cover bowl and place in a warm spot. Let dough rise until it has doubled in size, 60 to 90 minutes."
        },
        {
            "5": "Transfer dough to a work surface and knead to remove air bubbles, about 1 minute. Transfer to a resealable plastic bag; refrigerate, 8 hours or overnight."
        },
        {
            "6": "Lightly flour a work surface; dough may be sticky so make sure you use enough flour to keep dough from sticking to the surface or your hands (but less flour is best). Break off a piece of dough slightly smaller than a golf ball. Roll into a smooth ball. Flatten and roll out into a circle about 1/8-inch thick."
        },
        {
            "7": "Invert a smooth mixing bowl on the work surface; lightly flour the bottom. Lightly stretch the dough and place the dough circle on the floured surface of the inverted bowl. Gently stretch dough evenly down the sides of the bowl, working your way around the edges, until it is very thin and translucent, or as thin as you can get it without tearing it."
        },
        {
            "8": "Heat a cast iron skillet over high heat. Flour your hands and carefully remove the dough circle from the bottom of the bowl. Transfer to hot skillet. Cook until blisters form and begin to brown, about 45 to 60 seconds per side."
        },
        {
            "9": "Transfer to a dish and cover to allow bread to steam and stay moist and supple."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 9 hrs 30 mins"
        },
        {
            "Total Time": " 10 hrs"
        },
        {
            "Servings": "8 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "47"
        },
        {
            "Fat": "2g"
        },
        {
            "Carbs": "6g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8367238.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8367247.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8028572.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8001388.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/xvES9FlzJs_1zDpQ9F-prJDFcTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/4535952-8112d00174cf4ce4924b135a1b3d0a82.jpg"
        }
    ],
    "main category": "flour"
}