{
    "title": "Zainab's Homemade Pita Bread",
    "Category": "Flat Bread",
    "Ingredients": [
        {
            "1": "0.5 teaspoons instant dry yeast"
        },
        {
            "2": "1 cup warm water, or more as needed"
        },
        {
            "3": "1 tablespoon white sugar"
        },
        {
            "4": "2 cups all-purpose flour, or more as needed"
        },
        {
            "5": "2 tablespoons olive oil, divided, or as needed"
        },
        {
            "6": "1 tablespoon milk powder"
        },
        {
            "7": "0.5 teaspoon salt"
        }
    ],
    "Directions": [
        {
            "1": "Sprinkle yeast over 1 cup warm water, then add sugar. Let sit until bubbles form in the water, 5 to 10 minutes."
        },
        {
            "2": "Mix 2 cups flour, 1 1/2 tablespoons olive oil, milk powder, and salt together in a stand mixer fitted with the dough hook attachment until combined. Add yeast mixture and knead on low speed; it may look unmanageable at first but in a few minutes it will leave the sides of the bowl and form a ball. Continue to knead gently until ball is soft and smooth. If dough is too dry and hard, add 1 to 2 tablespoons warm water. If dough is too wet, add a little flour."
        },
        {
            "3": "Cover the dough with plastic wrap and leave in a warm place until it has doubled in size, 2 to 3 hours."
        },
        {
            "4": "Transfer dough to a floured work surface. Roll into a cylinder shape or flatten it with your hands and divide into 10 equal pieces. Form each piece into a ball, cover with greased plastic wrap, and let rise for 8 to 10 minutes."
        },
        {
            "5": "Sprinkle a small amount of flour onto the work surface. Take one dough ball and gently flatten it with your fingers or a rolling pin into a 6- to 8-inch circle, about 1/4 inch thick. Repeat with remaining balls. Cover and let rise one more time, 8 to 10 minutes."
        },
        {
            "6": "Heat a large skillet over medium-low heat. Lightly grease with remaining olive oil and place pitas into the skillet. Cook until bubbles form and pitas puff up, 2 to 3 minutes. Flip and cook, without turning, until completely puffed up, another 2 to 3 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "5 mins"
        },
        {
            "Additional Time": " 2 hrs 25 mins"
        },
        {
            "Total Time": " 2 hrs 50 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 pita breads"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "124"
        },
        {
            "Fat": "3g"
        },
        {
            "Carbs": "21g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [],
    "main category": "flour"
}