{
    "title": "Chocolate and Orange Tiramisu",
    "Category": "Tiramisu",
    "Ingredients": [
        {
            "1": "1 pound mascarpone cheese, room temperature"
        },
        {
            "2": "0.25 cup orange-flavored liqueur (such as Grand Marnier), divided"
        },
        {
            "3": "2 cups heavy whipping cream"
        },
        {
            "4": "0.25 cup white sugar"
        },
        {
            "5": "1 teaspoon vanilla extract"
        },
        {
            "6": "2 cups orange juice (such as Simply®)"
        },
        {
            "7": "3 (3 ounce) packages soft ladyfingers"
        },
        {
            "8": "0.25 cup unsweetened cocoa powder, or as needed, divided"
        }
    ],
    "Directions": [
        {
            "1": "Stir mascarpone and 2 tablespoons orange liqueur together in a large bowl until smooth."
        },
        {
            "2": "Beat cream, sugar, and vanilla together with an electric mixer in a separate bowl until soft peaks form. Fold about 1/4 of the whipped cream into the mascarpone mixture with a large rubber spatula until smooth; add remaining whipped cream and fold until the color of the mixture is consistent."
        },
        {
            "3": "Mix orange juice and remaining orange-flavored liqueur together in a shallow bowl. Separate ladyfingers. Quickly dip two or three ladyfingers at a time in the orange juice mixture just long enough to absorb a small amount of liquid. Arrange soaked cookies into the bottom of a 9x13-inch baking dish. Repeat soaking and placing cookies until you cover the bottom of the dish in a single layer. Spread about half the mascarpone mixture over the layer of cookies. Sprinkle about half the cocoa powder over the mascarpone. Repeat soaking and layering with remaining cookies, orange juice mixture, mascarpone mixture, and cocoa powder."
        },
        {
            "4": "Cover baking dish with plastic wrap and refrigerate until chilled completely, at least 5 hours to overnight."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Additional Time": " 5 hrs"
        },
        {
            "Total Time": " 5 hrs 45 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "1 9x13-inch dish"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "433"
        },
        {
            "Fat": "35g"
        },
        {
            "Carbs": "25g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4470340.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}