{
    "title": "Aloo Paratha",
    "Category": "Diwali Recipes",
    "Ingredients": [
        {
            "1": "3 medium potatoes, peeled and cubed"
        },
        {
            "2": "4 teaspoons vegetable oil, divided, or as needed"
        },
        {
            "3": "0.25 teaspoon cumin seeds"
        },
        {
            "4": "2  green chile peppers, minced"
        },
        {
            "5": "6  fresh curry leaves"
        },
        {
            "6": "0.5 teaspoon minced fresh ginger"
        },
        {
            "7": "1 pinch ground turmeric, or to taste"
        },
        {
            "8": "1 salt to taste"
        },
        {
            "9": "5 cups whole wheat flour, divided"
        },
        {
            "10": "0.25 cups water"
        }
    ],
    "Directions": [
        {
            "1": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add potatoes, cover, and steam until tender, 10 to 15 minutes. Remove from the heat."
        },
        {
            "2": "Heat 1 1/2 teaspoons vegetable oil in a medium skillet over medium heat. Add cumin seeds and cook until light brown, 2 to 3 minutes. Add chile peppers, curry leaves, and ginger; cook and stir for about 1 minute. Add potatoes, turmeric, and salt; cook and stir carefully for about 5 minutes."
        },
        {
            "3": "Transfer potatoes to a bowl and allow to cool, about 15 minutes."
        },
        {
            "4": "Place 1/2 cup flour into a shallow bowl. Combine the remaining flour and 1 1/2 teaspoons oil in a large mixing bowl; salt to taste. Mix with your hands while gradually adding water. Knead dough until a smooth ball forms. Divide into 6 evenly round balls."
        },
        {
            "5": "Roll each dough ball into a thick, circular shape. Form the cooled potato mixture into 6 round balls and place a potato ball on top of each dough circle. Fold all the dough sides over the potato filling to cover. Flatten each stuffed dough slightly while dipping both sides into the bowl of flour."
        },
        {
            "6": "Roll each dough to a thin, circular shape and set a few inches apart on parchment paper."
        },
        {
            "7": "Set a large skillet over medium heat and lightly spread with remaining oil. Place a stuffed paratha on the hot skillet and cook for 2 to 3 minutes. Flip over and cook the other side for 2 to 3 minutes. Remove to a serving plate and continue this same process for all the parathas. Serve hot."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 parathas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "457"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "93g"
        },
        {
            "Protein": "16g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1072803.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}