{
    "title": "Authentic Indian Vegetarian Samosas",
    "Category": "Diwali Recipes",
    "Ingredients": [
        {
            "1": "1 Filling-"
        },
        {
            "2": "4 medium potatoes, peeled and cubed"
        },
        {
            "3": "0.5 cup frozen peas, thawed"
        },
        {
            "4": "0.5 cup raisins"
        },
        {
            "5": "1  green chile pepper, finely chopped"
        },
        {
            "6": "1 tablespoon garam masala"
        },
        {
            "7": "1 teaspoon finely grated fresh ginger"
        },
        {
            "8": "1 pinch red chile powder, or to taste"
        },
        {
            "9": "1 salt to taste"
        },
        {
            "10": "1 Shell-"
        },
        {
            "11": "1 cup all-purpose flour"
        },
        {
            "12": "2 tablespoons vegetable oil"
        },
        {
            "13": "1 pinch ground cinnamon"
        },
        {
            "14": "1 salt to taste"
        },
        {
            "15": "1 cup water, or as needed"
        },
        {
            "16": "1 vegetable oil for frying"
        }
    ],
    "Directions": [
        {
            "1": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain, return to the pot, and mash."
        },
        {
            "2": "Combine mashed potatoes, peas, raisins, green chile, garam masala, ginger, chile powder, and salt in a large bowl. Set filling aside."
        },
        {
            "3": "Combine flour, oil, cinnamon, and salt on a flat surface and knead to combine. Slowly knead in a small amount of water at a time, using just enough to form a soft dough that is pliable and even in color."
        },
        {
            "4": "Divide dough into 4 balls; roll each into a thin circle and cut in half. Place dough half-circles into an airtight container."
        },
        {
            "5": "Place 1 half-circle on a flat surface with the straight edge toward you and the rounded side facing away. Pour a small amount of water into a bowl. Dip a finger in the water and lightly moisten the right side of the rounded edge of the dough; fold wet edge over the left rounded side to create a cone. Press rounded edge to seal and leave straight edge open. Fill with filling and seal open edge by wetting dough with water and pressing together. Repeat with remaining dough and fillings."
        },
        {
            "6": "Heat oil in a deep fryer to 400 degrees F (200 degrees C). Deep fry samosas until golden brown, 3 to 5 minutes each."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 samosas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "303"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "40g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}