{
    "title": "Cream Cheese Danish Coffeecake",
    "Category": "Danishes",
    "Ingredients": [
        {
            "1": "1 Dough-"
        },
        {
            "2": "4 cups all-purpose flour, or more as needed, divided"
        },
        {
            "3": "0.5 cup white sugar"
        },
        {
            "4": "0.5 teaspoons active dry yeast"
        },
        {
            "5": "0.5 teaspoon salt"
        },
        {
            "6": "1 cup milk"
        },
        {
            "7": "0.5 cup butter"
        },
        {
            "8": "1  egg"
        },
        {
            "9": "1 Filling-"
        },
        {
            "10": "2 (8 ounce) packages cream cheese, softened"
        },
        {
            "11": "1 cup confectioners' sugar"
        },
        {
            "12": "1  egg"
        },
        {
            "13": "1 tablespoon lemon juice"
        },
        {
            "14": "2 tablespoons milk"
        }
    ],
    "Directions": [
        {
            "1": "Combine 1 cup flour, sugar, yeast, and salt in the bowl of a stand mixer."
        },
        {
            "2": "Combine 1 cup milk and butter in a 2-quart saucepan over low heat; heat until very warm (120 to 130 degrees F (40 to 54 degrees C)), about 5 minutes."
        },
        {
            "3": "Beat milk-butter mixture gradually into flour mixture on low speed. Increase speed to medium; beat for 2 minutes, stopping occasionally to scrape the bowl with a spatula. Beat in 1 cup flour and egg, occasionally scraping the bowl. Switch to the dough hook attachment; mix in remaining 2 cups flour until a soft dough forms."
        },
        {
            "4": "Turn dough out on a lightly floured work surface. Knead until smooth and elastic, about 10 minutes. Shape into a ball. Transfer to a greased bowl. Turn over to coat top with grease. Cover and let rise in a warm place until doubled, about 1 hour."
        },
        {
            "5": "Punch down dough and turn out on a lightly floured surface. Divide into 2 pieces. Place each piece in a separate bowl. Cover and refrigerate, 2 hours to overnight."
        },
        {
            "6": "Combine cream cheese, confectioners' sugar, 1 egg, and lemon juice in the clean bowl of a stand mixer. Beat on low speed until evenly blended. Increase speed to medium; beat until fluffy, about 3 minutes."
        },
        {
            "7": "Grease 2 baking sheets. Roll 1 piece of dough into a 12x15-inch rectangle. Transfer to a baking sheet. Repeat with remaining dough."
        },
        {
            "8": "Spread cream cheese filling in a 4-inch strip down the center of each rectangle. Cut dough on both sides of the filling into 1-inch-wide strips. Fold strips alternately over the filling to create a braid. Cover braided dough and let rise in a warm, draft-free place until doubled, about 1 hour."
        },
        {
            "9": "Preheat oven to 375 degrees F (190 degrees C). Brush tops of braids with 2 tablespoons milk."
        },
        {
            "10": "Bake in the preheated oven until golden brown, about 20 minutes. Transfer to a wire rack to cool."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Additional Time": " 4 hrs"
        },
        {
            "Total Time": " 4 hrs 55 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "2 danish braids"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "336"
        },
        {
            "Fat": "17g"
        },
        {
            "Carbs": "40g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7080374.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4557130.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}