{
    "title": "Swedish Tea Ring with Pecans",
    "Category": "Danishes",
    "Ingredients": [
        {
            "1": "1 tablespoon active dry yeast"
        },
        {
            "2": "0.25 cup warm water (110 degrees F/45 degrees C)"
        },
        {
            "3": "1  lemon, juiced and zested"
        },
        {
            "4": "1 cup milk"
        },
        {
            "5": "0.5 cup margarine, softened"
        },
        {
            "6": "1 teaspoon salt"
        },
        {
            "7": "0.5 cup white sugar"
        },
        {
            "8": "2  eggs, beaten"
        },
        {
            "9": "2.0 cups all-purpose flour"
        },
        {
            "10": "2 teaspoons ground cinnamon"
        },
        {
            "11": "0.25 cup white sugar"
        },
        {
            "12": "0.75 cup chopped pecans"
        },
        {
            "13": "0.25 teaspoon vanilla extract"
        },
        {
            "14": "1 cup confectioners' sugar"
        }
    ],
    "Directions": [
        {
            "1": "In a small bowl, dissolve yeast in the warm water and let stand until creamy, about 15 minutes. Zest and juice the lemon; set juice aside for later use."
        },
        {
            "2": "In a large mixing bowl, combine the yeast mixture, milk, butter, salt, sugar, eggs, lemon zest, and 2 cups of the flour. Stir until smooth and well combined. Mix in the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has come together, turn it out onto a lightly floured surface and knead until smooth and satiny; about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume; about 1 hour."
        },
        {
            "3": "Punch down the dough and turn out onto a lightly floured surface. Roll the dough out into a rectangle approximately 12x24 inches."
        },
        {
            "4": "In a small bowl, mix together the cinnamon, 1/4 cup sugar and pecans; spread this mixture evenly across the dough. Roll the dough into a long roll and press the seam closed. With the seam turned downward, seal the two ends together to make a ring. Use a little water to help you seal the ends."
        },
        {
            "5": "Place the ring on a lightly greased cookie pan. Using a sharp knife or kitchen shears, make cuts every inch or so along the ring, cutting only three quarters of the way through. Twist each piece slightly so that the rolls fan out from the center of the ring. Cover the roll with greased plastic wrap and let rise in a warm place until nearly doubled in volume, about 1 hour."
        },
        {
            "6": "Preheat oven to 375 degrees F (190 degrees C)."
        },
        {
            "7": "Bake until golden brown, 25 to 30 minutes. Remove the ring from the oven, place on a rack to cool."
        },
        {
            "8": "Place the lemon juice in a small bowl along with the vanilla. Add 1/4 cup of powdered sugar and stir until the sugar is dissolved. Continue adding powdered sugar, 1 tablespoon at a time, until the mixture is fairly thick but still pourable. Drizzle the lemon-sugar topping over the ring."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": " 2 hrs 25 mins"
        },
        {
            "Total Time": " 3 hrs 15 mins"
        },
        {
            "Servings": "15 "
        },
        {
            "Yield": "1 round loaf"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "324"
        },
        {
            "Fat": "12g"
        },
        {
            "Carbs": "50g"
        },
        {
            "Protein": "6g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F810047.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F740350.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F465f8365b4c8e8e999bee844f08015b4%2F533286.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F320605.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}