{
    "title": "Instant Pot Split Pea and Ham Soup",
    "Category": "Split Pea Soup",
    "Ingredients": [
        {
            "1": "0.5 tablespoons salted butter"
        },
        {
            "2": "0.5 tablespoons olive oil"
        },
        {
            "3": "2 medium carrots, sliced"
        },
        {
            "4": "1 large stalk celery, diced"
        },
        {
            "5": "0.5 large onion, diced"
        },
        {
            "6": "0.5 pound diced cooked ham"
        },
        {
            "7": "1  potato, peeled and diced"
        },
        {
            "8": "1 salt and ground black pepper to taste"
        },
        {
            "9": "4 cups chicken broth, divided"
        },
        {
            "10": "0.5 pound dried split peas"
        },
        {
            "11": "2  bay leaves"
        },
        {
            "12": "0.25 cup shredded Cheddar cheese, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Turn on a multi-functional pressure cooker (such as Instant Pot), and select Saute function. Add butter and olive oil; heat until butter is melted. Add carrots, celery, and onion; cook until onion is nearly translucent, about 3 minutes. Add ham and cook for 1 minute."
        },
        {
            "2": "Add potato; cook and stir to prevent anything from sticking to the bottom of the pot, for 2 minutes. Season with salt and pepper. Add 3 cups chicken broth, split peas, and bay leaves. Turn Saute function off."
        },
        {
            "3": "Close and lock the lid and seal the valve. Select high pressure according to manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "4": "Release pressure using the natural-release method according to manufacturer's instructions, 10 to 12 minutes. Release remaining pressure carefully using the quick-release method, 2 to 3 minutes. Unlock and remove the lid."
        },
        {
            "5": "Unlock and remove the lid. Taste and adjust with salt and pepper as desired. If soup is too thick, select Saute function and add remaining 1 cup chicken broth. Stir until heated through and desired consistency, about 5 minutes. Adjust seasonings if necessary. Serve immediately with Cheddar cheese sprinkled over top."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "526"
        },
        {
            "Fat": "24g"
        },
        {
            "Carbs": "50g"
        },
        {
            "Protein": "29g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8000614.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "soups"
}