{
    "title": "Rick's Yummy Split Pea Soup with Ham",
    "Category": "Split Pea Soup",
    "Ingredients": [
        {
            "1": "1 (14 ounce) bag green split peas, rinsed"
        },
        {
            "2": "2 tablespoons olive oil"
        },
        {
            "3": "0.5 cups finely chopped onion"
        },
        {
            "4": "0.5 cups finely chopped carrots"
        },
        {
            "5": "1 cup finely chopped celery"
        },
        {
            "6": "1 teaspoon minced garlic, or to taste"
        },
        {
            "7": "7 cups chicken broth, or more as needed, divided"
        },
        {
            "8": "1  bay leaf, or more to taste"
        },
        {
            "9": "0.5 teaspoon freshly ground black pepper"
        },
        {
            "10": "0.25 teaspoon ground thyme"
        },
        {
            "11": "2 pounds smoked pork neck bones (such as Smithfield®)"
        },
        {
            "12": "10 ounces cubed smoked ham (such as Carolina Pride®)"
        }
    ],
    "Directions": [
        {
            "1": "Place the split peas into a large container and cover with several inches of cool water; let stand for at least 3 hours. Rinse peas until the water runs clear; drain."
        },
        {
            "2": "Heat olive oil in a large skillet over medium-high heat. Saute onion, carrots, and celery in hot oil until soft, 8 to 12 minutes. Add garlic and saute until fragrant, about 1 minute."
        },
        {
            "3": "Combine peas, onion mixture, 6 cups chicken broth, bay leaf, black pepper, and thyme together in a large pot. Stir neck bones into chicken broth mixture, adding more chicken broth as necessary to cover bones completely. Bring mixture to a boil, reduce heat to medium-low, cover the pot, and simmer until peas have dissolved and meat is falling from the bones, 2 to 3 hours. Transfer bones to a plate to cool."
        },
        {
            "4": "Stir cubed ham into soup. When neck bones are cool enough to handle, remove remaining meat from the bones; discard bones and stir meat into soup. Continue to simmer until ham and meat are heated through, about 5 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 2 hrs 15 mins"
        },
        {
            "Additional Time": " 3 hrs"
        },
        {
            "Total Time": " 5 hrs 45 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "562"
        },
        {
            "Fat": "22g"
        },
        {
            "Carbs": "37g"
        },
        {
            "Protein": "53g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1097746.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "soups"
}