{
    "title": "Snert (Dutch Split Pea Soup)",
    "Category": "Split Pea Soup",
    "Ingredients": [
        {
            "1": "1 pound bone-in gammon (cured pork leg)"
        },
        {
            "2": "2 (14 ounce) bags dried split peas"
        },
        {
            "3": "8 ounces pork belly"
        },
        {
            "4": "1 small celeriac (celery root), peeled and chopped"
        },
        {
            "5": "2  leeks, sliced into 1/2-inch rings"
        },
        {
            "6": "2 small onions, chopped"
        },
        {
            "7": "1  carrot, chopped"
        },
        {
            "8": "1  smoked sausage"
        },
        {
            "9": "1 bunch fresh celery leaves, chopped"
        },
        {
            "10": "1 salt and ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Place gammon in a large pot; cover with cold water and bring to a boil. Add split peas and pork belly; simmer for 10 minutes. Skim off any foam that rises to the surface of the water."
        },
        {
            "2": "Transfer gammon and pork belly to a plate using a slotted spoon. Strain split peas through a sieve, discarding water."
        },
        {
            "3": "Place gammon, split peas, and pork belly back into the pot; cover with fresh water. Bring to a boil; reduce heat and simmer gently until gammon and pork belly are tender, 2 to 3 hours."
        },
        {
            "4": "Transfer gammon and pork belly to a plate using a slotted spoon; cool until easily handled, about 10 minutes. Remove gammon from the bone and slice. Slice the meatiest parts off the pork belly."
        },
        {
            "5": "Stir the chopped meat back into the pot. Add celeriac, leeks, onions, and carrot; simmer until softened, about 15 minutes. Add whole sausage link; simmer until heated through, 10 to 15 minutes. Remove sausage link and slice into small pieces; stir back into the soup."
        },
        {
            "6": "Sprinkle celery leaves, salt, and pepper over soup. Simmer until celery leaves are warmed through, 1 to 2 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 2 hrs 46 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 3 hrs 26 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "539"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "75g"
        },
        {
            "Protein": "42g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9436078.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "soups"
}