{
    "title": "Vegan Puerto Rican Empanadas",
    "Category": "TVP Recipes",
    "Ingredients": [
        {
            "1": "1 Vegan Meat Filling-"
        },
        {
            "2": "2 cups water"
        },
        {
            "3": "1 cup textured vegetable protein (TVP) granules"
        },
        {
            "4": "2 tablespoons soy sauce"
        },
        {
            "5": "3 cloves garlic, minced"
        },
        {
            "6": "1 (1.41 ounce) package sazon seasoning (such as Goya®)"
        },
        {
            "7": "1 teaspoon adobo sauce from canned chipotles, or to taste"
        },
        {
            "8": "0.5 teaspoon dried oregano"
        },
        {
            "9": "0.5 teaspoon ground cumin"
        },
        {
            "10": "0.25 teaspoon cayenne pepper, or to taste"
        },
        {
            "11": "2 dashes liquid smoke, or to taste (Optional)"
        },
        {
            "12": "2 tablespoons tomato paste"
        },
        {
            "13": "1 Dough-"
        },
        {
            "14": "3 cups all-purpose flour"
        },
        {
            "15": "1 teaspoon salt"
        },
        {
            "16": "0.5 teaspoon baking powder"
        },
        {
            "17": "0.5 teaspoon baking soda"
        },
        {
            "18": "1 cup warm water"
        },
        {
            "19": "0.25 cup vegetable oil"
        },
        {
            "20": "1 (8 ounce) package shredded vegan white cheese, or to taste (Optional)"
        },
        {
            "21": "1 cup vegetable oil"
        }
    ],
    "Directions": [
        {
            "1": "Combine water, TVP, and soy sauce in a large pan over high heat. Cook and stir until water is mostly evaporated. Reduce heat to medium. Add garlic, sazon, adobo sauce, oregano, and cumin. Continue cooking until TVP starts to firm up, about 5 minutes, increasing heat if necessary. Add cayenne and liquid smoke and cook until the mixture starts sticking to the pan, about 5 minutes. Stir in tomato paste and mix vegan meat well."
        },
        {
            "2": "Mix flour, salt, baking powder, and baking soda together in a large bowl. Make a well in the center and add water and 1/4 cup vegetable oil. Mix with your hands and knead until all flour is incorporated. Cut dough into 12 pieces and roll into balls. Place dough balls in the bowl and cover; let sit for 3 to 4 minutes. Roll a dough ball out into a 6-inch circle and fill with vegan meat and shredded cheese. Dip a finger in water and moisten the edges of the dough before folding over and crimping empanada edges using a fork. Repeat with remaining dough balls and fillings."
        },
        {
            "3": "Heat 1 cup vegetable oil in a deep pan over medium-high heat. Add 2 or 3 empanadas as a time to the hot oil and fry until both sides are a light golden color, about 5 minutes total. Transfer fried empanadas to a plate lined with paper towels to absorb any excess oil."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 empanadas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "437"
        },
        {
            "Fat": "28g"
        },
        {
            "Carbs": "32g"
        },
        {
            "Protein": "14g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9150117.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}