{
    "title": "Alfajores",
    "Category": "Sandwich Cookies",
    "Ingredients": [
        {
            "1": "1 Filling-"
        },
        {
            "2": "2 (14 ounce) cans sweetened condensed milk"
        },
        {
            "3": "1 tablespoon unsalted butter"
        },
        {
            "4": "1 Cookies-"
        },
        {
            "5": "4 cups all-purpose flour"
        },
        {
            "6": "0.5 cups unsalted butter, softened"
        },
        {
            "7": "6 tablespoons powdered sugar"
        },
        {
            "8": "1 tablespoon pisco or other brandy"
        },
        {
            "9": "0.5 teaspoon baking powder"
        },
        {
            "10": "0.5 teaspoon salt"
        },
        {
            "11": "1 Topping-"
        },
        {
            "12": "1 cup powdered sugar, or more as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine condensed milk and butter for filling in a pot over medium-low heat. Simmer, stirring occasionally, until it coats the back of a spoon and becomes caramelized, about 2 hours."
        },
        {
            "2": "While the filling is simmering, mix flour, butter, powdered sugar, pisco, baking powder, and salt for cookies in a stand mixer fitted with the paddle attachment until a dough forms."
        },
        {
            "3": "Shape dough into a disc and wrap in plastic wrap. Refrigerate for 15 to 30 minutes."
        },
        {
            "4": "Preheat the oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper."
        },
        {
            "5": "Roll dough on a lightly floured surface to a thickness of 1/8 inch or 3/16 inch. Use a small cookie cutter to cut approximately 80 circles. Transfer cookies to the prepared baking sheets; prick each cookie once with the tines of a fork."
        },
        {
            "6": "Bake cookies in the preheated oven until edges are just golden, about 12 minutes, switching racks halfway through; do not let them brown. Remove oven and transfer to a wire rack. Repeat to cook remaining cookies."
        },
        {
            "7": "When the filling has finished simmering, let it cool slightly, about 15 minutes."
        },
        {
            "8": "Spread filling over one side of 2 cookies, and press together like sandwiches. Roll in powdered sugar to coat. Repeat to fill and coat remaining cookies."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 2 hrs 15 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 3 hrs 15 mins"
        },
        {
            "Servings": "40 "
        },
        {
            "Yield": "40 filled sandwich cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "127"
        },
        {
            "Fat": "7g"
        },
        {
            "Carbs": "14g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [],
    "main category": "snacks_&_sweets"
}