{
    "title": "Vanilice (Serbian Sandwich Cookies)",
    "Category": "Sandwich Cookies",
    "Ingredients": [
        {
            "1": "0.5 cups vegetable shortening (such as Butter Flavor Crisco®)"
        },
        {
            "2": "1 cup white sugar, divided, or as needed"
        },
        {
            "3": "1 large egg"
        },
        {
            "4": "1 teaspoon vanilla extract"
        },
        {
            "5": "2 cups all-purpose flour, plus more as needed"
        },
        {
            "6": "0.25 cup apricot jam, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Combine shortening and 1/2 cup sugar in a bowl; cut with a pastry knife until crumbly. Add egg and vanilla; beat with an electric mixer until well combined. Work in 2 cups flour with your hands; knead until stiff and similar in consistency to pie dough."
        },
        {
            "2": "Preheat the oven to 300 degrees F (150 degrees C). Line 2 baking sheets with parchment paper or Silpat® mats."
        },
        {
            "3": "Dust a work surface generously with flour and set dough on top. Roll dough with a floured rolling pin to a thickness of 1/8 inch. Cut into rounds with a 1 3/4-inch cookie cutter or the rim of a glass. For every 2 cookies you cut, use a smaller cookie cutter to cut a hole or shape out of the second cookie; the cut-out cookies will be placed on top of the whole cookies when filled."
        },
        {
            "4": "Re-roll the dough and continue cutting out cookies until all the dough is used up. You should have an equal number of whole and cut-out cookies. Transfer to the prepared baking sheets."
        },
        {
            "5": "Bake in the preheated oven for 10 minutes; do not let the cookies brown. Remove from oven and allow to cool on the baking sheet for a few minutes before carefully transferring onto wire racks. The cookies will be crumbly and fragile while still hot so handle carefully. Let cool completely."
        },
        {
            "6": "Place remaining 1/2 cup sugar into a bowl. Spread 1/4 to 1/2 teaspoon apricot jam onto each whole cookie, then place a cut-out cookie on top. Dip the filled cookies in sugar until well coated on both sides."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "20 "
        },
        {
            "Yield": "20 sandwich cookies"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "234"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "22g"
        },
        {
            "Protein": "2g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F484390.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}