{
    "title": "Individual Honeycrisp Apple Tarts",
    "Category": "Apple Pie",
    "Ingredients": [
        {
            "1": "1 sheet frozen puff pastry"
        },
        {
            "2": "2 tablespoons packed brown sugar"
        },
        {
            "3": "1 tablespoon white sugar"
        },
        {
            "4": "1 pinch ground cinnamon"
        },
        {
            "5": "1 pinch salt"
        },
        {
            "6": "4 teaspoons unsalted butter, divided"
        },
        {
            "7": "1 teaspoon lemon juice"
        },
        {
            "8": "2 large Honeycrisp apples"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. Set out two 6-ounce ramekins."
        },
        {
            "2": "Place puff pastry sheet on a work surface and let thaw for just 5 minutes; it should still be partially frozen and very firm. Use a round pastry cutter the same diameter as your ramekins to cut out 2 rounds of dough. Transfer to the prepared baking sheet. Prick each pastry round all over with a fork."
        },
        {
            "3": "Bake in the preheated oven until the pastries are puffed up and the bottoms are golden brown, about 15 minutes. Remove from the oven and slide parchment paper off the baking pan onto a work surface; press warm pastries down lightly with the back of a fork to deflate them a bit. Let cool."
        },
        {
            "4": "Increase the oven temperature to 425 degrees F (220 degrees C)."
        },
        {
            "5": "Mix brown sugar, white sugar, a pinch of cinnamon, and a very small pinch of salt together in a bowl."
        },
        {
            "6": "Use 1 1/2 teaspoons butter to generously grease the bottom and sides of each ramekin. Spoon the sugar mixture evenly into each ramekin, reserving about 1 1/2 teaspoons for later. Shake ramekins gently to settle and flatten the sugar mixture."
        },
        {
            "7": "Fill a bowl with 3 cups cold water. Add lemon juice."
        },
        {
            "8": "Turn one apple on its side; trim about 1/4 inch off the top and bottom of the apple, then cut it in half through the center. Repeat with the second apple."
        },
        {
            "9": "Peel around the apple halves to remove the peel; discard. Continue to peel the flesh, making ribbons as long and as thick as possible until you reach the core, letting the ribbons drop into the water. As long as your ribbons are 3- to 4-inches long, that's fine."
        },
        {
            "10": "Pull out 3 to 4 of the longest ribbons and line them up on a work surface into one long ribbon, overlapping the ends an inch or so. Roll the ribbon up tightly to form the center of the tart, then turn it up on its end. Coil more ribbons around the center, overlapping as you go, until you have a coil that's the same diameter as your ramekin. Pick up the apple coil and place it into the ramekin, with the flat side on top of the sugar. Repeat to make the second tart."
        },
        {
            "11": "Dot 1/2 teaspoon butter over each tart, then sprinkle with the remaining sugar mixture. Top each tart with a pastry round, placing the fork-poked side down on the apples."
        },
        {
            "12": "Bake in the preheated oven until pastries have browned and juices are bubbling, about 30 minutes. Remove from the oven and press the hot pastries down gently with a fork. Let cool for about 10 minutes."
        },
        {
            "13": "Run a knife around each pastry, then turn over onto serving plates. Use a spoon to go around each tart to separate the layers and create more definition, if desired."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 35 mins"
        },
        {
            "Servings": "2 "
        },
        {
            "Yield": "2 individual tarts"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "919"
        },
        {
            "Fat": "54g"
        },
        {
            "Carbs": "104g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9407263.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9425781.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9415423.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9405977.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/9nIlm54AeMM-jLDV5ZIGSe-Vls0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_0509_individual-honeycrisp-apple-tarts_chef-john-ccf5fb081acc4088b0184242eda17f33.jpg"
        },
        {
            "img6": "https://www.allrecipes.com/thmb/pbzMoECH7NJDSRNkrFWb-M3llCI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-503-f41c062acbc44c789d60dbce1af1351d.jpg"
        }
    ],
    "main category": "pies"
}