{
    "title": "Chicken Spaghetti with White Sauce",
    "Category": "Spaghetti",
    "Ingredients": [
        {
            "1": "1 (16 ounce) package spaghetti"
        },
        {
            "2": "4 (5 ounce) skinless, boneless chicken breast halves, pounded to an even thickness"
        },
        {
            "3": "1 teaspoon salt, or to taste"
        },
        {
            "4": "0.5 teaspoon freshly ground black pepper, or to taste"
        },
        {
            "5": "1 tablespoon olive oil"
        },
        {
            "6": "3 slices bacon"
        },
        {
            "7": "0.5 (8 ounce) jar sun-dried tomatoes packed in oil, drained and chopped"
        },
        {
            "8": "4 cloves garlic, minced"
        },
        {
            "9": "1 teaspoon dried basil"
        },
        {
            "10": "1 pinch red pepper flakes, or more as needed"
        },
        {
            "11": "1 cup milk"
        },
        {
            "12": "1 tablespoon cornstarch"
        },
        {
            "13": "2 cups chicken broth"
        },
        {
            "14": "1 (8 ounce) package shredded mozzarella cheese"
        },
        {
            "15": "1 cup grated Parmesan cheese"
        }
    ],
    "Directions": [
        {
            "1": "Bring a large pot of water to a boil. Add spaghetti and a liberal amount of salt to the boiling water and cook, stirring occasionally, until tender yet firm to the bite, about 10 minutes. Drain pasta and transfer to a large serving bowl. Reserve 1 cup pasta water."
        },
        {
            "2": "While pasta is cooking, coat chicken with salt and pepper on both sides."
        },
        {
            "3": "Heat olive oil in a large pan over medium-high heat. Add chicken and cook until browned, about 3 minutes per side. Remove chicken and chop into bite-sized pieces. Set aside."
        },
        {
            "4": "Add bacon to the same pan and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and cut into small pieces."
        },
        {
            "5": "Add sun-dried tomatoes, garlic, basil, and red pepper flakes to the bacon fat and cook for 1 minute. Add chicken and bacon and reduce heat to just above a simmer. Stir in milk and cornstarch. Add chicken broth, mozzarella cheese, and Parmesan cheese; stir and simmer until well mixed and cheeses have melted."
        },
        {
            "6": "Slowly add 1/2 cup pasta water to the sauce; stir and allow the sauce to thicken up to desired consistency, adding more pasta water as needed. Pour sauce over pasta to serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "490"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "50g"
        },
        {
            "Protein": "36g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4582673.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}