{
    "title": "Chantilly Mashed Potato Casserole",
    "Category": "Mashed Potatoes",
    "Ingredients": [
        {
            "1": "4 large russet potatoes, peeled and quartered"
        },
        {
            "2": "6 tablespoons unsalted butter, cubed"
        },
        {
            "3": "1 kosher salt to taste"
        },
        {
            "4": "0.5 cup grated Gruyere cheese"
        },
        {
            "5": "1 pinch cayenne pepper, or more to taste"
        },
        {
            "6": "1 cup finely grated Parmigiano-Reggiano cheese, divided"
        },
        {
            "7": "0.5 cup buttermilk"
        },
        {
            "8": "0.75 cup cold heavy cream"
        },
        {
            "9": "2 tablespoons sliced green onions (Optional)"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 475 degrees F (245 degrees C)."
        },
        {
            "2": "Place potatoes into a pot, cover with fresh, cold water by 2 inches, and add 2 tablespoons kosher salt. Set heat to high and bring to a boil. Reduce heat to medium and simmer until tender, testing by poking potatoes with a knife. The time will depend on the size of your potatoes but could be between 15 and 20 minutes."
        },
        {
            "3": "Remove from the heat and let drain in a colander for 5 to 10 minutes."
        },
        {
            "4": "Transfer into a large bowl and mash thoroughly with a potato masher until no lumps remain. Add butter, kosher salt, and Gruyere cheese. Mix and mash until everything has been incorporated."
        },
        {
            "5": "Add cayenne, 3/4 cup Parmigiano-Reggiano cheese, and buttermilk, and mash until well combined. Taste and adjust for salt."
        },
        {
            "6": "Whisk cream in a metal bowl until thick and fairly stiff peaks form, 1 to 2 minutes. Pour 1/2 of the whipped cream onto the potatoes and cut it in with the side of a spatula to lighten the mixture. Repeat with remaining whipped cream but do it carefully to preserve the maximum amount of volume, cutting in until just barely mixed."
        },
        {
            "7": "Transfer into a well-buttered casserole dish and distribute gently with a fork. Smooth the top with a spoon if desired. Sprinkle remaining 1/4 cup Parmigiano-Reggiano on top and dust lightly with cayenne."
        },
        {
            "8": "Place the baking dish on a pan and bake in the center of the preheated oven until beautifully browned, 15 to 20 minutes."
        },
        {
            "9": "Remove from the oven and sprinkle with green onions before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "35 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "376"
        },
        {
            "Fat": "22g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "11g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/RtUTnAh9cjJPoLONxpMjuD-IpPw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_2015-2000-8e0793db7e324c85a099cec9e9d74874.jpg"
        },
        {
            "img2": "https://www.allrecipes.com/thmb/RtUTnAh9cjJPoLONxpMjuD-IpPw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/IMG_2015-2000-8e0793db7e324c85a099cec9e9d74874.jpg"
        }
    ],
    "main category": "cakes"
}