{
    "title": "Lobster Mashed Potatoes",
    "Category": "Mashed Potatoes",
    "Ingredients": [
        {
            "1": "1 Lobster-"
        },
        {
            "2": "2 quarts water"
        },
        {
            "3": "2 tablespoons salt"
        },
        {
            "4": "1 (2 pound) lobster"
        },
        {
            "5": "1 Mashed Potatoes-"
        },
        {
            "6": "2 pounds russet potatoes, peeled and cut into 2-inch pieces"
        },
        {
            "7": "4 cups water, or more as needed"
        },
        {
            "8": "1 teaspoon salt"
        },
        {
            "9": "0.25 cup butter"
        },
        {
            "10": "0.5 cup cream, or more as needed"
        },
        {
            "11": "0.25 teaspoon paprika"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 200 degrees F (95 degrees C)."
        },
        {
            "2": "Cook lobster: Combine water and salt in a large pot; bring to a boil. Plunge lobster into boiling water, cover the pot, and return to a boil. Reduce heat to medium-low and cook at a simmer until lobster turns bright red, about 10 minutes. Remove lobster from water and set aside to cool."
        },
        {
            "3": "When cool enough to handle, clean lobster and pull out tail meat, reserving the tail shell. Crack claws and remove meat. Chop tail meat coarsely and reserve with the intact claw meat in a covered dish; keep warm in the preheated oven."
        },
        {
            "4": "Make potatoes: Add potatoes to a large saucepan and cover with water by 1 inch. Add salt; bring to a boil. Lay intact lobster tail shell over potatoes, then reduce heat to medium-low, cover, and cook at a simmer until potatoes are easily pierced with a fork, 20 to 30 minutes."
        },
        {
            "5": "Remove lobster shell and discard. Drain water from the saucepan. Reduce heat to low. Gently shake the pan over low heat to dry potatoes. Mash butter into potatoes until no lumps remain. Add cream until desired consistency is reached."
        },
        {
            "6": "Fold warm lobster meat into potatoes. Sprinkle with paprika to serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "503"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "44g"
        },
        {
            "Protein": "40g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F784946.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "cakes"
}