{
    "title": "Brining and Cooking the Perfect Turkey with Delicious Gravy",
    "Category": "Turkey Brine",
    "Ingredients": [
        {
            "1": "1 Brine-"
        },
        {
            "2": "4 (32 ounce) cartons low-sodium chicken broth"
        },
        {
            "3": "1 cup kosher salt"
        },
        {
            "4": "2 tablespoons dried savory"
        },
        {
            "5": "2 tablespoons dried thyme"
        },
        {
            "6": "2 tablespoons dried sage"
        },
        {
            "7": "2 tablespoons dried rosemary"
        },
        {
            "8": "1 gallon apple juice"
        },
        {
            "9": "1 gallon water, or as needed to cover"
        },
        {
            "10": "1 Roast Turkey-"
        },
        {
            "11": "1 (22 pound) whole turkey"
        },
        {
            "12": "4 large onions, chopped"
        },
        {
            "13": "8 stalks celery, chopped"
        },
        {
            "14": "8  carrots, chopped"
        },
        {
            "15": "0.25 cup butter, melted"
        },
        {
            "16": "2 cups white cooking wine"
        },
        {
            "17": "2 (32 ounce) cartons chicken broth"
        },
        {
            "18": "0.25 cup butter, melted"
        },
        {
            "19": "1 Gravy-"
        },
        {
            "20": "2 cups water"
        },
        {
            "21": "1 (32 ounce) carton turkey broth"
        },
        {
            "22": "0.25 cup cornstarch"
        }
    ],
    "Directions": [
        {
            "1": "Pour 4 32-ounce cartons of low-sodium chicken broth into a large stock pot and stir in kosher salt, savory, thyme, sage, and rosemary. Bring to a boil, reduce heat to medium, and cook the brine for 7 minutes to blend flavors. Cool. Pour the mixture into a 5-gallon food-grade bucket, large cooler, or large brining bag. Stir apple juice and 1 gallon of water into the mixture. Place turkey, breast side down, into the brine, and pour in more water if needed to cover. Place in refrigerator and brine for at least 36 hours."
        },
        {
            "2": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "3": "Remove turkey and discard used brine. Rinse turkey and pat dry with paper towels. Place the turkey, breast side down, on a roasting rack set into a roasting pan. Stuff the bird with 2 onions, 4 stalks of celery, and 4 carrots; place remaining 2 onions, 4 stalks of celery, and 4 carrots into the roasting pan surrounding the turkey. Brush outside of the turkey with 1/4 cup melted butter and pour white cooking wine and 2 32-ounce cartons of chicken broth into the pan."
        },
        {
            "4": "Roast in the preheated oven for 30 minutes; baste with pan juices. If skin begins to darken too quickly, place a tent of aluminum foil over the bird. Continue roasting for 1 1/2 more hours, basting every 30 minutes. Turn the turkey over so it is breast side up; brush with remaining 1/4 cup melted butter. Continue roasting, basting every 30 minutes, until an instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, reads 180 degrees F (80 degrees C), about 1 more hour (3 hours roasting time in all)."
        },
        {
            "5": "Remove turkey and set aside while you make the gravy. Strain all the pan drippings through a mesh strainer into a large saucepan. Bring to a boil, reduce heat to medium-low, and simmer. Whisk 2 cups water, 1 32-ounce carton turkey broth, and cornstarch together in a bowl until smooth. Whisk the cornstarch mixture into the hot pan drippings and cook until thickened, whisking constantly, about 5 minutes. Let gravy cool to thicken slightly. If desired, use a gravy separator to remove excess fat. Serve turkey with gravy."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 3 hrs 15 mins"
        },
        {
            "Additional Time": "3 days"
        },
        {
            "Total Time": "3 days 3 hrs 45 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "1 roast turkey with gravy"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "796"
        },
        {
            "Fat": "34g"
        },
        {
            "Carbs": "29g"
        },
        {
            "Protein": "88g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4479003.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1711500.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}