{
    "title": "Brined Thanksgiving Turkey",
    "Category": "Turkey Brine",
    "Ingredients": [
        {
            "1": "4 (32 ounce) containers chicken broth"
        },
        {
            "2": "1 cup apple juice (Optional)"
        },
        {
            "3": "1 cup light brown sugar"
        },
        {
            "4": "1 cup kosher salt"
        },
        {
            "5": "2 tablespoons dried sage"
        },
        {
            "6": "4  peppercorns"
        },
        {
            "7": "4  red apples, halved"
        },
        {
            "8": "5 cloves garlic, crushed"
        },
        {
            "9": "10 pounds ice cubes, or as needed"
        },
        {
            "10": "1 (20 pound) turkey whole turkey - thawed, neck and giblets removed"
        },
        {
            "11": "3  apples, cored and quartered"
        },
        {
            "12": "1  onion, cut into 8 wedges"
        },
        {
            "13": "3 cloves garlic"
        },
        {
            "14": "6  fresh sage leaves"
        },
        {
            "15": "3 tablespoons olive oil, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Stir chicken broth, apple juice, brown sugar, salt, dried sage, and peppercorns together in a large stock pot; add apple halves and crushed garlic cloves. Bring the mixture just to a boil, stirring to dissolve sugar and salt. Remove from heat immediately."
        },
        {
            "2": "Pour enough ice into a large food-safe container to be about half full. Pour chicken broth mixture over the ice; stir to cool liquid completely and evenly."
        },
        {
            "3": "Gently lower turkey into the liquid with the breast facing down."
        },
        {
            "4": "Brine turkey 24 to 36 hours, adding ice as needed to keep the brine and turkey cold."
        },
        {
            "5": "Preheat oven to 500 degrees F (260 degrees C)."
        },
        {
            "6": "Remove turkey from the brine and rinse well with cold water. Pat turkey dry with paper towels."
        },
        {
            "7": "Mix apple quarters, onion wedges, whole garlic cloves, and fresh sage leaves in a bowl; loosely stuff into cavity of turkey. Move the turkey to a shallow roasting pan. Lightly coat the turkey's skin with olive oil."
        },
        {
            "8": "Bake the turkey in the preheated oven until the skin on the breast of the turkey is golden brown, about 30 minutes."
        },
        {
            "9": "Reduce heat to 350 degrees F (175 degrees C), cover turkey with aluminum foil, and continue roasting the turkey until no longer pink at the bone and the juices run clear, about 6 hours. An instant-read thermometer inserted into the thickest part of the thigh should read 180 degrees F (85 degrees C). Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 6 hrs 30 mins"
        },
        {
            "Additional Time": "1 day"
        },
        {
            "Total Time": "1 day 7 hrs"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "1 20-pound turkey"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "1320"
        },
        {
            "Fat": "57g"
        },
        {
            "Carbs": "36g"
        },
        {
            "Protein": "155g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6042550.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4585584.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "holidays_and_traditional_food"
}