{
    "title": "Stuffed Chicken Cordon Bleu with Prosciutto",
    "Category": "Chicken Cordon Bleu",
    "Ingredients": [
        {
            "1": "1 nonstick cooking spray"
        },
        {
            "2": "2 (5 ounce) skinless, boneless chicken breast halves"
        },
        {
            "3": "2 slices Swiss cheese"
        },
        {
            "4": "4 slices prosciutto"
        },
        {
            "5": "0.5 cup seasoned bread crumbs"
        },
        {
            "6": "1 salt and ground black pepper to taste"
        },
        {
            "7": "1 tablespoon butter"
        },
        {
            "8": "1 (10.75 ounce) can  condensed cream of mushroom soup"
        },
        {
            "9": "0.25 cup sour cream"
        },
        {
            "10": "2 tablespoons lemon juice"
        },
        {
            "11": "1 tablespoon water, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Coat a 7x11-inch baking dish with cooking spray."
        },
        {
            "2": "Place chicken on a cutting board. Holding a sharp knife horizontal to the board, cut a 3-inch deep pocket lengthwise in the thick side of each breast. Place a slice of Swiss cheese and two slices of prosciutto in the pocket of each chicken breast. Place in the prepared baking dish and sprinkle chicken evenly with breadcrumbs, salt, and pepper. Place 1/2 tablespoon of butter on top of each chicken breast."
        },
        {
            "3": "Bake in the preheated oven until chicken is no longer pink in the center and juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        },
        {
            "4": "While chicken bakes, prepare sauce by mixing soup, sour cream, and lemon juice together in a pot. Heat over medium heat until sauce thins a bit. Add water, 1 tablespoon at a time, to thin sauce to desired consistency (should be slightly runny to pour over chicken)."
        },
        {
            "5": "Top chicken with sauce and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "2 "
        },
        {
            "Yield": "2 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "731"
        },
        {
            "Fat": "43g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "50g"
        }
    ],
    "Images": [],
    "main category": "meat_&_chicken"
}