{
    "title": "Algerian Couscous",
    "Category": "Lamb Recipes",
    "Ingredients": [
        {
            "1": "0.25 cup olive oil, or more as needed, divided"
        },
        {
            "2": "8  mutton chops, fat removed"
        },
        {
            "3": "4  chicken drumsticks"
        },
        {
            "4": "1 pinch salt and ground black pepper to taste"
        },
        {
            "5": "3  onions, quartered"
        },
        {
            "6": "1 water to cover"
        },
        {
            "7": "2 tablespoons ground turmeric"
        },
        {
            "8": "2 tablespoons ground cumin"
        },
        {
            "9": "2 tablespoons ground coriander"
        },
        {
            "10": "3  potatoes, cut into chunks"
        },
        {
            "11": "3  turnips, cut into chunks"
        },
        {
            "12": "3  carrots, sliced lengthwise and cut into chunks"
        },
        {
            "13": "1 (6 ounce) can tomato paste"
        },
        {
            "14": "2 tablespoons ras el hanout"
        },
        {
            "15": "1 (7 ounce) can chickpeas, drained"
        },
        {
            "16": "2  zucchini, sliced lengthwise and cut into chunks"
        },
        {
            "17": "5 sprigs cilantro, chopped"
        },
        {
            "18": "1 Couscous-"
        },
        {
            "19": "3 cups water"
        },
        {
            "20": "2 cups couscous"
        },
        {
            "21": "1 tablespoon butter"
        },
        {
            "22": "3 tablespoons harissa"
        }
    ],
    "Directions": [
        {
            "1": "Heat 3 tablespoons olive oil in a large pot over medium-high heat. Season mutton chops and chicken drumsticks with salt and pepper; cook in batches with onions in the hot oil until browned, about 2 minutes per side. Transfer to a large plate."
        },
        {
            "2": "Scrape the bottom of the pot with a wooden spoon to release browned bits. Return mutton chops and chicken to the pot. Pour in enough water to cover; add turmeric, cumin, and coriander. Cover and bring to a boil. Reduce heat to medium; simmer for 20 minutes."
        },
        {
            "3": "Stir potatoes, turnips, and carrots into the pot. Simmer, covered, until vegetables start to soften, about 10 minutes. Mix in tomato paste and ras el hanout; cook for 10 minutes. Stir in chickpeas, zucchini, and cilantro; continue cooking, covered, until zucchini is tender, about 5 minutes."
        },
        {
            "4": "Bring 3 cups water to a boil in a saucepan; remove from heat and stir in couscous and butter. Cover saucepan and let stand until water is absorbed completely, 5 to 10 minutes. Fluff couscous with a fork and stir in 1 tablespoon olive oil. Transfer to a serving dish."
        },
        {
            "5": "Ladle 2 scoops of cooking liquid into a bowl; mix in harissa until smooth."
        },
        {
            "6": "Scoop vegetables onto a serving plate. Scoop mutton and chicken onto a separate plate. Serve alongside couscous, harissa sauce, and remaining cooking liquid in the pot."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs 7 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 42 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "492"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "57g"
        },
        {
            "Protein": "31g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4477315.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}