{
    "title": "Broiled and Slow-Roasted Butterflied Leg of Lamb With Cumin and Garlic",
    "Category": "Lamb Recipes",
    "Ingredients": [
        {
            "1": "0.25 cup olive oil"
        },
        {
            "2": "8 cloves garlic, minced"
        },
        {
            "3": "1.0 teaspoons salt"
        },
        {
            "4": "1 teaspoon pepper"
        },
        {
            "5": "2 tablespoons ground cumin"
        },
        {
            "6": "1 tablespoon dried oregano"
        },
        {
            "7": "1 (8 pound) leg of lamb, boned and butterflied to a more or less even thickness, 4 3/4 to 5 1/2 pounds trimmed weight, fell and most fat removed"
        },
        {
            "8": "1  lemon, juiced"
        },
        {
            "9": "0.5 cup Minced fresh parsley, cilantro or mint"
        }
    ],
    "Directions": [
        {
            "1": "Mix oil, garlic, salt, pepper, cumin and oregano; spread paste on both sides of the lamb and let stand for an hour until meat comes to room temperature."
        },
        {
            "2": "Adjust oven rack to upper or upper-middle position (depending on lamb's thickness) and preheat broiler on high for at least 10 minutes."
        },
        {
            "3": "Place lamb, cut side up, on a large wire rack set over a foil-lined roasting pan. Broil, moving pan so entire surface browns evenly, about 8 minutes. Turn lamb over; continue to broil until well browned on the other side, about 8 minutes longer. Turn off broiler, remove lamb from oven and let rest for 10 minutes."
        },
        {
            "4": "Heat oven to 325 degrees. Stick a meat thermometer into the thickest portion of the lamb; return it to the oven. Roast for a total of 50 minutes to 1 hour, until thermometer registers a rosy-pink 140 degrees. Check lamb several times after 30 minutes. If lamb gets done sooner, simply turn down oven to 170 degrees until ready to serve."
        },
        {
            "5": "As soon as lamb comes out of the oven, squeeze on lemon juice and sprinkle with fresh herbs. Carve, slicing across the grain when possible. Arrange on a platter, drizzle with accumulated juices, and serve."
        }
    ],
    "Details": [
        {
            "Servings": "14 "
        },
        {
            "Yield": "12 to 14 - servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "336"
        },
        {
            "Fat": "23g"
        },
        {
            "Carbs": "2g"
        },
        {
            "Protein": "30g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8516168.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F362221.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}