{
    "title": "Chef John's Chicken Kiev",
    "Category": "Food Wishes®",
    "Ingredients": [
        {
            "1": "2 cloves garlic, minced"
        },
        {
            "2": "1 pinch salt"
        },
        {
            "3": "2 tablespoons chopped fresh flat-leaf parsley"
        },
        {
            "4": "6 tablespoons unsalted butter"
        },
        {
            "5": "4 (8 ounce) skinless, boneless chicken breast halves, pounded to 1/4-inch thickness"
        },
        {
            "6": "1 salt and pepper to taste"
        },
        {
            "7": "1 cup all-purpose flour"
        },
        {
            "8": "2 teaspoons salt"
        },
        {
            "9": "2  eggs, beaten"
        },
        {
            "10": "2 cups panko bread crumbs"
        },
        {
            "11": "1 pinch cayenne pepper"
        },
        {
            "12": "2 cups vegetable oil for frying, or as needed"
        }
    ],
    "Directions": [
        {
            "1": "Grind garlic and pinch of salt together in a mortar and pestle until smooth; add parsley and mix well. Pound butter into garlic mixture with the pestle until well combined. Wrap butter mixture in plastic wrap; refrigerate until cold, at least 15 minutes."
        },
        {
            "2": "Season chicken breasts with salt and pepper. Place 1/4 of the butter mixture in the center of the wider end of each chicken breast. Fold the narrower end of each chicken breast up over the butter to form a tight pocket around the butter; gather the sides of each chicken breast to the center to form a round ball. The top of each chicken ball will be smooth and the bottom will be gathered. Tightly wrap each chicken ball in plastic wrap; transfer to a plate and chill in the freezer until the gathered bottoms hold together and are slightly firm, about 30 minutes."
        },
        {
            "3": "Whisk flour and 2 teaspoons salt together in a shallow bowl. Whisk eggs together in another shallow bowl. Pour panko bread crumbs into third bowl."
        },
        {
            "4": "Remove chicken breast balls from plastic wrap. Gently press them into the flour mixture to coat; shake off any excess flour. Dip into beaten eggs, then press into bread crumbs. Place breaded chicken on a plate; cover with plastic wrap, and return to the freezer to chill until firm, about 15 minutes."
        },
        {
            "5": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil."
        },
        {
            "6": "Working in batches, place chicken, gathered-side down, in the hot oil and cook until lightly golden, about 1 minute per side. Transfer chicken to the prepared baking sheet; sprinkle salt and cayenne pepper over the top."
        },
        {
            "7": "Bake in the preheated oven until you can hear the butter start to sizzle on the baking sheet, 15 to 17 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let rest for 5 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 35 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "790"
        },
        {
            "Fat": "38g"
        },
        {
            "Carbs": "62g"
        },
        {
            "Protein": "60g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F6e184c5de82bf94fe8baf52dc8e26b04%2F1657487849D451BD51-15DD-4B14-BF9F-D911F4861866.jpeg&q=60&c=sc&orient=true&w=160&poi=auto&h=90.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2F6e184c5de82bf94fe8baf52dc8e26b04%2F165486829220220609_181939.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9443055.jpg"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9209708.jpg"
        },
        {
            "img5": "https://www.allrecipes.com/thmb/h5g-DyyDlqZ_gvZokEzmtnMoHUc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/236703_ChefJohnsChickenKiev_MFS-1x1-1-b87f215958864a5e83bea31b3de84e4b.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}