{
    "title": "Green Onion Garlic Naan Bread",
    "Category": "Food Wishes®",
    "Ingredients": [
        {
            "1": "0.5 cups bread flour, plus more as needed"
        },
        {
            "2": "0.5 teaspoon kosher salt"
        },
        {
            "3": "2 teaspoons baking powder"
        },
        {
            "4": "1 cup plain Greek yogurt"
        },
        {
            "5": "4 cloves garlic, crushed"
        },
        {
            "6": "0.5 cup thinly sliced green onions"
        },
        {
            "7": "2 tablespoons melted butter"
        }
    ],
    "Directions": [
        {
            "1": "Place bread flour in a bowl. Add salt and baking powder and give it a good whisk until evenly combined."
        },
        {
            "2": "Add in Greek yogurt gently, followed by garlic and green onions. Take a wooden spoon and slowly start mixing everything together. Keep mixing, stirring, and pressing until a shaggy dough forms."
        },
        {
            "3": "Transfer dough to a work surface and use your hands to press dough together. Knead for a few minutes until dough becomes elastic and a little bit sticky. Add a bit more flour as necessary but try to keep extra flour at an absolute minimum. Knead until dough is a little bit stretchy, 3 to 5 minutes."
        },
        {
            "4": "Wrap in plastic and allow to rest on the counter for 15 to 20 minutes."
        },
        {
            "5": "Take a bench scraper and cut into 6 equal pieces. Take 1 portion and roll into a ball. Place onto a generously floured surface. Use a rolling pin to roll out nice and thin, about 1/8 inch or less. It's ok if the naan is not a perfect circle. You will need extra flour for rolling out as the dough is sticky, but try to use as little as possible."
        },
        {
            "6": "Heat a cast iron skillet over medium-high heat until hot. Transfer dough circles into the hot dry skillet and cook until little bubbles form on the surface and the underside is lightly browned, about 1 minute. Flip naan over and cook for 1 more minute. Press down slightly with a spatula to increase the heat during cooking. Flip over twice more and cook for an additional 15 seconds per side, but make sure not to overcook to preserve the texture. Naan should still be flexible when you remove it from the skillet onto a plate."
        },
        {
            "7": "Cover with a kitchen towel to keep warm and moist while you cook the other naan breads. Stack all 6 naan breads on top of each other and keep covered with a kitchen towel."
        },
        {
            "8": "When you are finished cooking all 6 naan breads, unstack breads and brush the first naan bread on both sides with a little bit of melted butter. Stack second piece of naan on top and only brush the top side. Keep stacking and buttering all the naan breads. Fold each naan into a triangle and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "3 mins"
        },
        {
            "Rest Time": "15 mins"
        },
        {
            "Total Time": "38 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 naan breads"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "282"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "53g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/FjnGuWBtl9Oe9Etl1TPp6G5BwVE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Green-Onion-Garlic-Naan-1x1-1-2000-74d1d2d5f5224354990602475103a53d.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}