{
    "title": "Tiramoussa Semifreddo – Frozen Italian Coffee Dessert",
    "Category": "Food Wishes®",
    "Ingredients": [
        {
            "1": "4 large eggs, separated"
        },
        {
            "2": "1.0 teaspoons  instant dark roast coffee"
        },
        {
            "3": "0.5 cup white sugar"
        },
        {
            "4": "1 tablespoon marsala wine"
        },
        {
            "5": "0.25 pinch salt"
        },
        {
            "6": "0.25 cups heavy cream"
        }
    ],
    "Directions": [
        {
            "1": "Combine egg yolks, instant dark roast coffee, marsala wine, and sugar in a metal bowl and whisk together until smooth."
        },
        {
            "2": "Place bowl in the top of a double boiler over lightly simmering water. Whisk constantly until mixture thickens and drippings from the whisk form ribbons on the surface that are visible for 1/2 second to 1 second, about 10 minutes. If you are brave, you can set the bowl directly over medium-low heat and thicken the egg cream that way, but you have to be careful so you don't end up with scrambled eggs. This last method is slightly faster and will take about 6 to 7 minutes."
        },
        {
            "3": "Beat egg whites in a glass, metal, or ceramic bowl until foamy. Gradually add salt and continue to beat until stiff peaks form. Set aside."
        },
        {
            "4": "Beat heavy cream in a chilled glass or metal bowl with an electric mixer until medium-stiff peaks form. Using a spatula, fold in egg yolk mixture until combined. Add half of the egg whites and fold in until combined. Then fold in remaining egg whites until well combined. Transfer mixture into small 4 ounce jam jars and close with lids."
        },
        {
            "5": "Freeze for 4 hours or overnight."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Freeze Time": " 4 hrs"
        },
        {
            "Total Time": " 4 hrs 30 mins"
        },
        {
            "Servings": "10 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "173"
        },
        {
            "Fat": "13g"
        },
        {
            "Carbs": "11g"
        },
        {
            "Protein": "3g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/6DSVBjmacA1IsvCjDfHgb9PT8KQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Tiramoussa-Semifreddo-1x1-1-2000-fdc0bef2c5954a3ba86079ce5b3453b2.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}