{
    "title": "Whole Shrimp Potstickers",
    "Category": "Food Wishes®",
    "Ingredients": [
        {
            "1": "1 For the Dough-"
        },
        {
            "2": "1.0 cups all-purpose flour, or more as needed"
        },
        {
            "3": "0.75 teaspoon kosher salt"
        },
        {
            "4": "1 cup hot water"
        },
        {
            "5": "1 For the Shrimp-"
        },
        {
            "6": "12  large shrimp, peeled and deveined"
        },
        {
            "7": "3 tablespoons finely sliced green onions"
        },
        {
            "8": "2 cloves minced garlic"
        },
        {
            "9": "2 teaspoons soy sauce"
        },
        {
            "10": "0.5 teaspoon sesame oil"
        },
        {
            "11": "0.5 teaspoon Sriracha sauce"
        },
        {
            "12": "1 For the Dipping Sauce-"
        },
        {
            "13": "0.5 cup seasoned rice vinegar"
        },
        {
            "14": "2 teaspoons soy sauce"
        },
        {
            "15": "2 teaspoons sambal chile sauce"
        },
        {
            "16": "2 tablespoons finely sliced green onions"
        },
        {
            "17": "1 For the Pan Frying-"
        },
        {
            "18": "4 teaspoons vegetable oil, divided"
        },
        {
            "19": "4 teaspoons unsalted butter, divided"
        }
    ],
    "Directions": [
        {
            "1": "Place 2 1/2 cups flour for dough in a bowl. Add salt and hot water and stir with a wooden spoon until it all comes together into a shaggy dough. Transfer to a work surface and knead until dough is very soft but not super sticky. Knead, roll, and stretch dough until smooth and fairly elastic, about 3 more minutes. Wrap dough with plastic wrap and let rest at room temperature for about 1 hour."
        },
        {
            "2": "Meanwhile, combine shrimp, green onions, garlic, soy sauce, sesame oil, and Sriracha in a non-reactive bowl; toss until shrimp are thoroughly and evenly covered. Cover with plastic wrap and marinate in the refrigerator for 30 minutes."
        },
        {
            "3": "Combine rice vinegar, soy sauce, chile sauce, and green onions for dipping sauce in a bowl. Stir and set aside until needed."
        },
        {
            "4": "Unwrap dough and cut off a small piece. Roll it into a ball and then press it into a flat disc on a floured surface. Use a rolling pin to roll it into a 3 1/2-inch circle, about 1/8 inch thick. Dip your finger into some cold, fresh water and moisten the edge of the circle. Spoon 1 shrimp into the center, along with a little bit of green onion and marinade. Fold dough around the shrimp and press edges together until perfectly sealed. Trim any excess dough from the ends and either discard or reuse. Crimp the edges a bit with your fingers, if desired. Transfer to a flour-dusted plate and refrigerate while you assemble the remaining potstickers."
        },
        {
            "5": "Brush a 10-inch nonstick pan with 2 teaspoons oil and place over medium-high heat. Once hot, place 6 potstickers in the pan with the flat sides down. Cook for 1 minute, then add 2 teaspoons butter to the pan. Tilt the pan as the butter melts to distribute it evenly and cook until the bottoms of the potstickers are golden brown, about 30 seconds. Add 2 to 3 tablespoons water and quickly cover with the lid. Steam dumplings until cooked through and most of the water has evaporated, 2 to 3 minutes. Remove from the heat and repeat to cook the remaining 6 potstickers with remaining oil and butter."
        },
        {
            "6": "Serve immediately with dipping sauce on the side."
        }
    ],
    "Details": [
        {
            "Prep Time": "40 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 50 mins"
        },
        {
            "Servings": "2 "
        },
        {
            "Yield": "2 entree servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "847"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "124g"
        },
        {
            "Protein": "38g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9098817.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9053447.jpg"
        },
        {
            "img3": "https://www.allrecipes.com/thmb/UQd2Wk9drF8ZrcVEbzk3fQaOR0k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/image-474-9a7c2aecc0e44de0ac21553b27b615bb.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}