{
    "title": "Poblano and Cheese Tamales (Tamales de Rajas con Queso)",
    "Category": "Dumplings",
    "Ingredients": [
        {
            "1": "1 corn husks"
        },
        {
            "2": "10 ounces poblano peppers"
        },
        {
            "3": "0.25 pounds fresh tomatillos, husks removed"
        },
        {
            "4": "11 ounces lard, divided"
        },
        {
            "5": "1  onion, chopped"
        },
        {
            "6": "1 salt and ground black pepper to taste"
        },
        {
            "7": "3 tablespoons chopped fresh cilantro"
        },
        {
            "8": "2.0 cups masa harina"
        },
        {
            "9": "2 teaspoons baking powder"
        },
        {
            "10": "0.75 cups chicken broth, or as needed"
        },
        {
            "11": "1.0 cups sliced Monterey Jack cheese"
        }
    ],
    "Directions": [
        {
            "1": "Place corn husks in a bowl, cover with boiling water, and soak for 30 to 60 minutes. Drain, place on a work surface, and cover with a clean, damp towel."
        },
        {
            "2": "Line a heavy cast iron grill pan or griddle with aluminum foil and place over high heat. Arrange poblano peppers in a single layer on top. Grill until chiles are blackened, turning as necessary, 3 to 5 minutes. Transfer into a resealable plastic bag and let them steam, 10 to 15 minutes. Peel off skin, seed, and cut them into strips."
        },
        {
            "3": "Place tomatillos in a pot and cover them with water. Bring to a boil and cook until they change color, about 5 minutes. Drain and place in a blender. Blend until smooth."
        },
        {
            "4": "Heat 1 tablespoon lard in a large pot over medium heat. Add onion and cook until soft and translucent, about 5 minutes. Add blended tomatillos and season with salt and pepper. Bring to a boil, reduce heat, and simmer until flavors are well combined, about 5 minutes. Add poblano peppers and cilantro and boil for an additional 5 minutes. Remove from heat and allow to cool, about 10 minutes."
        },
        {
            "5": "Beat remaining lard in a large bowl with an electric mixer until creamy. Add salt and continue beating for a few minutes. Add masa harina and baking powder and beat well until combined. Add chicken broth, 1/4 cup at a time, until the dough has a smooth and workable consistency that is not too wet, similar to cookie dough. Test if the masa is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready, if not, keep working the dough a little longer."
        },
        {
            "6": "Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto the corn husk, filling it up to 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon of the tomatillo sauce and a piece of Monterey Jack cheese in the center of the masa mixture. Fold sides of husk together, one over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks."
        },
        {
            "7": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the husk, about 1 hour 15 minutes. Let tamales rest for 15 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs"
        },
        {
            "Cook Time": " 1 hrs 43 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 2 hrs 58 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "24 tamales"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "252"
        },
        {
            "Fat": "18g"
        },
        {
            "Carbs": "19g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fe5c57e07ab361410c73713c008f94038%2F1650139677IMG_8109.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8997239.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Ff685095c36bf4bb3ab92d3396193c1d0%2F7299735.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F1ab6eb5603d05a467ecfaea1fe3ab3bb%2F5836010.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}