{
    "title": "Chocolate Lovers' Fudge with Jack Daniel's® Whiskey",
    "Category": "Fudge",
    "Ingredients": [
        {
            "1": "3 fluid ounces whiskey (such as Jack Daniel's®)"
        },
        {
            "2": "4 tablespoons Nuts, pecans"
        },
        {
            "3": "3 (4 ounce) bars Candies, milk chocolate"
        },
        {
            "4": "3 (3 ounce) bars dark chocolate, cut into chunks"
        },
        {
            "5": "1 (14 ounce) can sweetened condensed milk"
        },
        {
            "6": "2 tablespoons unsalted butter, melted"
        },
        {
            "7": "1 teaspoon kosher salt"
        }
    ],
    "Directions": [
        {
            "1": "Pour whiskey into a small bowl, add pecan halves, and allow them to soak in the whiskey for about 3 hours."
        },
        {
            "2": "Line 8-inch square pan with aluminum foil. Cut 2 pieces of foil about 14 inches long, and cut or fold each to an 8- inch width. Cover the bottom and 2 sides of the pan from left to right with 1 piece of foil. Use the remaining foil piece to cross the first layer of foil from top to bottom of the pan. Press foil firmly into the corners, and fold any excess over the sides of the pan. You will now have a double foil sling to lift the finished fudge from the pan."
        },
        {
            "3": "Drain pecans, reserving 2 ounces of the whiskey, and set aside."
        },
        {
            "4": "Place milk and dark chocolate in the top of a double boiler over 1 inch of simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, smooth, and shiny, about 5 minutes."
        },
        {
            "5": "Remove melted chocolate from the heat and slowly pour in sweetened condensed milk, stirring until well blended. Add melted butter and salt, stirring continuously. Mix in reserved whiskey and stir until mixture is creamy and smooth."
        },
        {
            "6": "Pour into the prepared pan. Use an offset spatula to spread smoothly and evenly. Arrange 16 pecans on top, in 4 rows of 4 pecans each. Refrigerate until firm, at least 2 hours."
        },
        {
            "7": "Use the foil sling to lift the fudge from the pan. Place the fudge on a cutting board and cut into 16 pieces with a bench scraper or sharp knife."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "5 mins"
        },
        {
            "Additional Time": " 5 hrs"
        },
        {
            "Total Time": " 5 hrs 15 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 pieces"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "315"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "36g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8897761.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}