{
    "title": "Sous Vide Prime Rib",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "1 (5 pound) three-bone standing rib roast, chine bone removed"
        },
        {
            "2": "2 tablespoons kosher salt, divided, or to taste"
        },
        {
            "3": "4 tablespoons unsalted butter, cut into 1/2-inch cubes"
        },
        {
            "4": "4  fresh thyme sprigs"
        },
        {
            "5": "3 cloves garlic, crushed"
        },
        {
            "6": "1 tablespoon ground black pepper"
        },
        {
            "7": "1 flaky sea salt to taste"
        },
        {
            "8": "6 ounces fresh shiitake mushrooms, stemmed and coarsely chopped"
        },
        {
            "9": "1 cup dry red wine"
        },
        {
            "10": "2 cups beef broth"
        }
    ],
    "Directions": [
        {
            "1": "Prepare a thermocirculator and water bath according to manufacturer's directions. Set thermocirculator to 135 degrees F (57 degrees C) and allow water bath to come up to temperature. Season rib roast evenly with 1 tablespoon salt and transfer to a large vacuum-sealable bag; arrange butter cubes, thyme sprigs, and crushed garlic around rib roast in bag."
        },
        {
            "2": "Seal bag with a vacuum sealer according to manufacturer's directions. Transfer vacuum-sealed rib roast to warm water bath with thermocirculator, cover vessel with aluminum foil to reduce evaporation, and cook for 6 hours. Remove rib roast from bag; roast will be at 135 degrees F (57 degrees C) when pulled from water bath. Transfer to a rimmed sheet pan lined with paper towels and gently pat dry; reserve contents remaining in bag."
        },
        {
            "3": "Preheat the oven to broil with an oven rack positioned about 10 inches below the heat source. Line a rimmed baking sheet with aluminum foil and fit with a wire rack."
        },
        {
            "4": "Season rib roast evenly with remaining tablespoon salt and pepper and place on the prepared baking pan."
        },
        {
            "5": "Cook rib roast in the preheated oven until fat cap is deeply caramelized, 8 to 10 minutes. Transfer rib roast to a large cutting board and let rest for 10 minutes before slicing against the grain into 1- to 1 1/2-inch thick slices; garnish sliced prime rib with flaky sea salt to taste."
        },
        {
            "6": "While rib roast is in the oven, combine reserved contents from vacuum bag and mushrooms in a medium saucepan and cook over medium-high heat, stirring occasionally, until mushrooms are mostly tender and liquid has reduced completely, 8 to 10 minutes. Add wine and continue cooking, stirring occasionally, until wine is almost completely reduced, about 5 minutes. Add beef broth and continue cooking, stirring occasionally, until sauce is thick enough to coat the back of a spoon, about 15 minutes; remove thyme sprigs and discard. Season mushroom sauce to taste with salt and serve alongside sliced prime rib."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 6 hrs 10 mins"
        },
        {
            "Total Time": " 6 hrs 30 mins"
        },
        {
            "Servings": "12 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "750"
        },
        {
            "Fat": "66g"
        },
        {
            "Carbs": "2g"
        },
        {
            "Protein": "31g"
        }
    ],
    "Images": [],
    "main category": "cooking_technique_&_channels"
}