{
    "title": "Instant Pot® Hungarian Goulash",
    "Category": "Goulash",
    "Ingredients": [
        {
            "1": "1 pound beef sirloin, cubed"
        },
        {
            "2": "0.25 cup all-purpose flour"
        },
        {
            "3": "1 tablespoon paprika"
        },
        {
            "4": "1 teaspoon cayenne pepper, divided"
        },
        {
            "5": "0.5 teaspoon ground white pepper, divided"
        },
        {
            "6": "2 teaspoons olive oil, divided"
        },
        {
            "7": "1 teaspoon bacon fat"
        },
        {
            "8": "2 cups water"
        },
        {
            "9": "2 teaspoons beef base"
        },
        {
            "10": "1  onion, chopped"
        },
        {
            "11": "1  red bell pepper, chopped"
        },
        {
            "12": "2 cloves garlic, chopped"
        },
        {
            "13": "1 tablespoon tomato paste"
        },
        {
            "14": "2 tablespoons red pepper paste"
        },
        {
            "15": "0.5 teaspoon dried minced shallot"
        },
        {
            "16": "0.25 cup sour cream"
        }
    ],
    "Directions": [
        {
            "1": "Combine sirloin, flour, paprika, 1/2 teaspoon cayenne, and 1/4 teaspoon white pepper in a bowl. Stir until the meat is completely covered."
        },
        {
            "2": "Heat 1 teaspoon olive oil and bacon fat in a Dutch oven over medium-high heat. Add the meat, shaking off any excess flour; saute until nicely browned on all sides, 5 to 7 minutes. Transfer to a multi-functional pressure cooker (such as Instant Pot®). Mix water and beef base together thoroughly in a bowl and pour over the beef."
        },
        {
            "3": "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "4": "Meanwhile, heat remaining olive oil in a pan over medium-high heat. Saute onion, bell pepper, and garlic in the hot oil until onion is translucent, 5 to 7 minutes. Add tomato paste and mix together. Reduce heat to low, cover, and set aside."
        },
        {
            "5": "Release Instant Pot® pressure using the natural-release method according to manufacturer's instructions for 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Carefully remove the inner pot and use a slotted spoon to transfer the meat to the Dutch oven."
        },
        {
            "6": "Turn the heat up under the Dutch oven to medium and let cook, stirring constantly, about 5 minutes. Add the liquid from the Instant Pot® carefully; mix to combine. Add pepper paste, dried shallot, remaining cayenne, and remaining white pepper. Taste for seasoning and cook over low heat until the mixture is thick, about 10 minutes. Garnish with sour cream and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "191"
        },
        {
            "Fat": "10g"
        },
        {
            "Carbs": "12g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7561975.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}