{
    "title": "Raspberry-White Chocolate Scones",
    "Category": "Scones",
    "Ingredients": [
        {
            "1": "2 (6 ounce) containers fresh raspberries"
        },
        {
            "2": "1.0 ounces white chocolate, or as needed"
        },
        {
            "3": "2 cups all-purpose flour, or more as needed"
        },
        {
            "4": "1 tablespoon white sugar, or more to taste"
        },
        {
            "5": "0.5 teaspoon kosher salt"
        },
        {
            "6": "4 teaspoons baking powder"
        },
        {
            "7": "5 tablespoons ice cold unsalted butter"
        },
        {
            "8": "0.75 cup milk"
        },
        {
            "9": "2 tablespoons sour cream"
        },
        {
            "10": "1 large egg"
        },
        {
            "11": "1 tablespoon milk"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 225 degrees F (110 degrees C)."
        },
        {
            "2": "Line a baking sheet with a silicone liner."
        },
        {
            "3": "Place fresh raspberries about 1 inch apart on the prepared baking sheet."
        },
        {
            "4": "Bake in the preheated oven for 4 hours, then turn oven off, leaving the berries inside for 8 hours, or overnight."
        },
        {
            "5": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with a silicone liner."
        },
        {
            "6": "Roughly chop dried raspberries into smaller pieces and measure out ½ cup for this recipe. Reserve any extra for another use."
        },
        {
            "7": "Grate white chocolate on the fine side of a grater until you have ½ cup."
        },
        {
            "8": "Whisk 2 cups flour, sugar, salt, and baking powder together in a mixing bowl. Grate cold butter into the flour mixture, tossing every so often to coat it with flour so it doesn't start to clump. When all butter has been added, work it into the flour with a pastry blender. Add grated white chocolate and toss with a fork to incorporate."
        },
        {
            "9": "Whisk ¾ cup milk and sour cream together in a liquid measure, then pour that into the flour mixture. Mix with a fork until everything just barely comes together to form a shaggy dough."
        },
        {
            "10": "Transfer dough to a generously floured work surface and without kneading, push and pack it together with your hands until it holds its shape, adding a little flour if it's too sticky. Press dough into a rectangle, about ¾-inch thick, and roughly twice as long as it is wide."
        },
        {
            "11": "Sprinkle dried raspberries evenly over the dough. Spread berries out almost to the edges and press them into the dough gently. Using a bench scraper, lift one third of the dough from one of the shorter edges and fold it in over the center third; press it down and square off the edges. Repeat with the other side so your scone dough is three layers thick."
        },
        {
            "12": "Cut the rectangle in half with the bench scraper, then cut each half into 2 triangles. Transfer scones to the prepared baking sheet."
        },
        {
            "13": "Whisk egg and 1 tablespoon milk together. Brush egg wash over each scone and sprinkle with sugar."
        },
        {
            "14": "Bake in the upper center of the preheated oven until browned, about 25 minutes."
        },
        {
            "15": "Quickly and carefully transfer to a rack and let cool completely before serving, about 30 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": " 4 hrs 25 mins"
        },
        {
            "Additional Time": " 8 hrs 30 mins"
        },
        {
            "Total Time": " 13 hrs 40 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 large scones"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "563"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "75g"
        },
        {
            "Protein": "12g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fa7dbff8004009085473a425c577ec478%2F1648847766image.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets.meredithcorp.io%2Fa7dbff8004009085473a425c577ec478%2F1646587427scones.jfif&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://www.allrecipes.com/thmb/0ZJDWE73eNIKJEJDG6UVov0Aei0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Raspberry-White-Chocolate-Scones-2000-728cf7bc501f4e509ea474e855093275.jpg"
        },
        {
            "img4": "https://www.allrecipes.com/thmb/0ZJDWE73eNIKJEJDG6UVov0Aei0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Raspberry-White-Chocolate-Scones-2000-728cf7bc501f4e509ea474e855093275.jpg"
        }
    ],
    "main category": "flour"
}