{
    "title": "Eggplant Parmesan with Fresh Basil and Smoked Mozzarella",
    "Category": "Eggplant Parmesan",
    "Ingredients": [
        {
            "1": "1 large unpeeled purple eggplant, trimmed and cut into 1/8-inch thick slices"
        },
        {
            "2": "1 teaspoon fine sea salt, or as needed"
        },
        {
            "3": "2  eggs"
        },
        {
            "4": "1 tablespoon whole milk"
        },
        {
            "5": "1 cup Italian-seasoned bread crumbs, or more as needed"
        },
        {
            "6": "0.75 cup extra-virgin olive oil, or as needed"
        },
        {
            "7": "1 (24 ounce) jar prepared marinara sauce (such as De Cecco®)"
        },
        {
            "8": "1 bunch fresh basil, coarsely chopped"
        },
        {
            "9": "1 (8 ounce) package smoked mozzarella cheese, very thinly sliced"
        },
        {
            "10": "0.5 cup freshly grated Parmesan cheese"
        }
    ],
    "Directions": [
        {
            "1": "Line a plate with a paper towel; place a layer of 2 or 3 slices of eggplant onto the towel. Sprinkle eggplant with sea salt. Repeat layers of eggplant sprinkled with salt until all eggplant slices are stacked. Place 2 paper towels onto the stack and place a plate on top of the towels. Lay a heavy book or can of food onto the plate to squeeze out moisture. Allow to drip for 20 minutes to 2 hours. Rinse and pat dry."
        },
        {
            "2": "Beat eggs with milk in a shallow bowl. Place bread crumbs into a separate bowl. Dip eggplant slices in the egg mixture and gently press into the crumbs to coat; set aside."
        },
        {
            "3": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish."
        },
        {
            "4": "Heat olive oil in a large skillet over medium-high heat; fry eggplant slices in the hot oil in small batches until golden brown, about 1 to 2 minutes per side. Drain on paper towels."
        },
        {
            "5": "Pour about 1/4 cup of marinara sauce into the bottom of the prepared baking dish and arrange a layer of eggplant slices to cover the sauce. Scatter basil and a few slices of smoked mozzarella cheese over eggplant; repeat layers, ending with a layer of sauce on top. Sprinkle Parmesan cheese over the top."
        },
        {
            "6": "Bake in the preheated oven until heated through and the cheese has melted, about 15 minutes. Serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "40 mins"
        },
        {
            "Additional Time": "20 mins"
        },
        {
            "Total Time": " 1 hrs 20 mins"
        },
        {
            "Servings": "5 "
        },
        {
            "Yield": "5 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "460"
        },
        {
            "Fat": "22g"
        },
        {
            "Carbs": "45g"
        },
        {
            "Protein": "21g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9266934.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8693992.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7970182.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7970122.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "breakfast"
}