{
    "title": "Instant Pot® Cranberry-Thyme Pot Roast",
    "Category": "Pot Roast",
    "Ingredients": [
        {
            "1": "1 (3 1/2) pound boneless beef chuck roast"
        },
        {
            "2": "1 pinch salt and ground black pepper to taste"
        },
        {
            "3": "2 tablespoons olive oil"
        },
        {
            "4": "2 cloves garlic, minced"
        },
        {
            "5": "1 (14 ounce) can beef broth"
        },
        {
            "6": "1 (14.5 ounce) can whole berry cranberry sauce"
        },
        {
            "7": "1 tablespoon balsamic vinegar"
        },
        {
            "8": "1 tablespoon Worcestershire sauce"
        },
        {
            "9": "1 large onion, cut into chunks"
        },
        {
            "10": "4 sprigs fresh thyme, or more to taste"
        },
        {
            "11": "2 tablespoons cornstarch"
        },
        {
            "12": "2 tablespoons cold water"
        }
    ],
    "Directions": [
        {
            "1": "Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function; pour olive oil into the pot. Sprinkle roast with salt and pepper and sear in the hot oil until well browned, 3 to 4 minutes per side. Transfer roast to a plate."
        },
        {
            "2": "Stir garlic into the pot and cook for 30 seconds. Pour in beef broth and scrape up all bits that have stuck to the pan. Stir in cranberry sauce, balsamic vinegar, and Worcestershire sauce. Place roast into the sauce and spoon some sauce over the top. Place onion and thyme around and on top of the roast."
        },
        {
            "3": "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 60 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "4": "Release pressure using the natural-release method according to manufacturer's instructions, at least 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid."
        },
        {
            "5": "Transfer roast to a serving plate. Remove onions and thyme sprigs from the pot. Select Saute function. Mix cornstarch and water together in a bowl and stir into the pot; let simmer until gravy starts to thicken, about 10 minutes. Serve gravy with roast."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": " 1 hrs 30 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 55 mins"
        },
        {
            "Servings": "10 "
        },
        {
            "Yield": "10 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "352"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "22g"
        },
        {
            "Protein": "20g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6968662.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}