{
    "title": "Beef Tamales",
    "Category": "Dumplings",
    "Ingredients": [
        {
            "1": "4 pounds boneless chuck roast"
        },
        {
            "2": "4 cloves garlic"
        },
        {
            "3": "3 (8 ounce) packages dried corn husks"
        },
        {
            "4": "4  dried ancho chiles"
        },
        {
            "5": "2 tablespoons vegetable oil"
        },
        {
            "6": "2 tablespoons all-purpose flour"
        },
        {
            "7": "1 cup beef broth"
        },
        {
            "8": "2 cloves garlic, minced"
        },
        {
            "9": "2 teaspoons chopped fresh oregano"
        },
        {
            "10": "1 teaspoon cumin seeds"
        },
        {
            "11": "1 teaspoon ground cumin"
        },
        {
            "12": "1 teaspoon red pepper flakes"
        },
        {
            "13": "1 teaspoon white vinegar"
        },
        {
            "14": "1 salt to taste"
        },
        {
            "15": "3 cups lard"
        },
        {
            "16": "1 tablespoon salt"
        },
        {
            "17": "9 cups masa harina"
        }
    ],
    "Directions": [
        {
            "1": "Place beef and garlic in a large pot. Cover with cold water and bring to a boil over high heat; reduce heat, cover, and simmer until beef is tender and shreds easily, about 3 1/2 hours. Remove beef from pot, reserving 5 cups cooking liquid and discarding garlic. Allow meat to cool slightly; shred finely with forks."
        },
        {
            "2": "Meanwhile, place corn husks in a large container and cover with warm water; soak, weighed down with an inverted plate and a heavy can, until soft and pliable, about 3 hours."
        },
        {
            "3": "Toast ancho chiles in a cast iron skillet; cool, then remove stems and seeds. Crumble and grind in a clean coffee grinder or with a mortar and pestle."
        },
        {
            "4": "Heat oil in a large skillet; stir in flour and allow to brown slightly. Pour in 1 cup beef broth and stir until smooth. Mix in ground chiles, garlic, oregano, cumin seeds, ground cumin, red pepper flakes, vinegar, and salt. Stir shredded beef into skillet and cover. Let simmer for 45 minutes."
        },
        {
            "5": "Place lard and salt in a large mixing bowl; beat with an electric mixer on high speed until fluffy. Add masa harina and beat at low speed until well mixed. Pour in reserved cooking liquid, a little at a time, until mixture is the consistency of soft cookie dough."
        },
        {
            "6": "Drain water from corn husks. One at a time, flatten out each husk, with the narrow end facing you, and spread approximately 2 tablespoons masa mixture onto the top 2/3 of the husk. Spread about 1 tablespoon of meat mixture down the middle of the masa. Roll up the corn husk starting at one of the long sides. Fold the narrow end of the husk onto the rolled tamale and tie with a piece of butchers' twine."
        },
        {
            "7": "Place tamales in a steamer basket. Steam over boiling water for approximately one hour, until masa is firm and holds its shape, adding more water if needed so the steamer does not boil dry. Serve immediately, allowing each person to unwrap their own tamales."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 4 hrs 30 mins"
        },
        {
            "Total Time": " 5 hrs"
        },
        {
            "Servings": "36 "
        },
        {
            "Yield": "6 dozen tamales"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "347"
        },
        {
            "Fat": "24g"
        },
        {
            "Carbs": "23g"
        },
        {
            "Protein": "9g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7563065.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2F6624a000e34d51877edae6efcc3dde45%2F4458345.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3368536.jpg"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3368545.jpg"
        }
    ],
    "main category": "carbs"
}