{
    "title": "Cherry-Almond Pie",
    "Category": "Cherry Pie",
    "Ingredients": [
        {
            "1": "1 Crust-"
        },
        {
            "2": "0.5 cups all-purpose flour"
        },
        {
            "3": "0.5 cup white sugar"
        },
        {
            "4": "0.5 cup butter, cubed"
        },
        {
            "5": "0.5 cup sliced almonds"
        },
        {
            "6": "1 ice water"
        },
        {
            "7": "1 Filling-"
        },
        {
            "8": "2 cups pitted fresh tart cherries, halved, or more to taste"
        },
        {
            "9": "0.5 cup white sugar, or more to taste"
        },
        {
            "10": "0.25 teaspoon salt"
        },
        {
            "11": "1 tablespoon almond extract, or more to taste"
        },
        {
            "12": "1 tablespoon amaretto liqueur, or more to taste (Optional)"
        },
        {
            "13": "1 tablespoon cornstarch"
        }
    ],
    "Directions": [
        {
            "1": "Combine flour and sugar for crust in a bowl. Cut in butter using hands to mix and mush until thoroughly combined and mixture resembles tiny pebbles or cornmeal. Stir in almonds. Sprinkle with ice water until dough holds together in a ball. Cover in plastic wrap and refrigerate at least 30 minutes."
        },
        {
            "2": "Preheat the oven to 350 degrees F (175 degrees C)."
        },
        {
            "3": "Toss cherries, sugar, and salt for filling together in a bowl."
        },
        {
            "4": "Combine almond extract, amaretto, and cornstarch in a separate bowl until smooth; add to cherry mixture and mix well."
        },
        {
            "5": "Roll out refrigerated crust dough using a lightly floured rolling pin on a lightly floured work surface to desired thickness. Press into the bottom of an 8-inch pie pan."
        },
        {
            "6": "Bake crust in the preheated oven until set, about 15 minutes."
        },
        {
            "7": "Remove crust from the oven and fill with cherry mixture. Increase the oven temperature to 400 degrees F (200 degrees C)."
        },
        {
            "8": "Bake pie in the hot oven until edges of dough are golden and filling is bubbly, 35 to 45 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 8-inch pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "361"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "52g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [],
    "main category": "pies"
}