{
    "title": "Fresh Cherry Pie",
    "Category": "Cherry Pie",
    "Ingredients": [
        {
            "1": "1 Crust-"
        },
        {
            "2": "2 cups all-purpose flour"
        },
        {
            "3": "1 cup shortening"
        },
        {
            "4": "0.25 cup cold water, or as needed"
        },
        {
            "5": "1 pinch salt"
        },
        {
            "6": "1 Cherry Filling-"
        },
        {
            "7": "2 pounds fresh Bing cherries, pitted"
        },
        {
            "8": "1 cup white sugar"
        },
        {
            "9": "2 tablespoons tapioca flour"
        },
        {
            "10": "1 teaspoon vanilla extract"
        },
        {
            "11": "1 teaspoon butter"
        }
    ],
    "Directions": [
        {
            "1": "Whisk flour and salt together in a bowl. Cut in shortening with 2 knives or pastry blender until the mixture resembles coarse crumbs. Add cold water, 1 tablespoon at a time, tossing with a fork, until flour mixture is moistened. Do not add more water than you need: when you squeeze a handful of the moistened pastry mixture, it should form a ball."
        },
        {
            "2": "Divide the dough in half and shape into balls. Wrap in plastic wrap and refrigerate, at least 1 hour or up to 3 days."
        },
        {
            "3": "Preheat oven to 375 degrees F (190 degrees C)."
        },
        {
            "4": "Mix cherries, sugar, and tapioca flour together in a saucepan; let sit until the sugar draws out the cherries' juices, about 10 minutes. Heat the cherry mixture over medium heat until the juices begin to thicken and run clear, about 5 minutes. Remove from heat; mix in butter and vanilla extract. Let sit until filling has cooled to lukewarm, 5 to 10 minutes."
        },
        {
            "5": "Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate. Spoon filling into crust using a slotted spoon to drain excess syrup; dot with butter. Cut left over dough into strips with a sharp paring knife or pastry wheel. Lay strips on top of the pie, pressing to seal the edges."
        },
        {
            "6": "Bake in the preheated oven until crust is a golden brown, 40 to 50 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": " 1 hrs 35 mins"
        },
        {
            "Total Time": " 2 hrs 40 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "532"
        },
        {
            "Fat": "28g"
        },
        {
            "Carbs": "69g"
        },
        {
            "Protein": "5g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fbce7a5a376b3bd70f54d412c2f3ad45f%2F6838725.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pies"
}