{
    "title": "Home Made Souse",
    "Category": "Meatloaf",
    "Ingredients": [
        {
            "1": "2  beef tongues"
        },
        {
            "2": "4  pig's ears"
        },
        {
            "3": "2  pig's feet"
        },
        {
            "4": "4  onions, chopped"
        },
        {
            "5": "2 tablespoons salt"
        },
        {
            "6": "1 teaspoon ground black pepper"
        },
        {
            "7": "15  whole black peppercorns"
        },
        {
            "8": "3 tablespoons dried sage"
        },
        {
            "9": "15  whole cloves"
        },
        {
            "10": "4  bay leaves"
        },
        {
            "11": "2 tablespoons pickling spice"
        },
        {
            "12": "0.5 teaspoon garlic powder"
        },
        {
            "13": "3 cups distilled white vinegar"
        },
        {
            "14": "2  pimentos, julienned"
        },
        {
            "15": "6  pepperoncini peppers, chopped"
        },
        {
            "16": "4 tablespoons dill pickle relish"
        },
        {
            "17": "5 tablespoons unflavored gelatin"
        },
        {
            "18": "1 cup water"
        }
    ],
    "Directions": [
        {
            "1": "Place tongues, pig's ears, pig's feet, and onions in a large stock pot; add water to cover. Season with salt, pepper, whole peppercorns, sage, cloves, bay leaves, pickling spice, garlic powder and vinegar. Bring to a boil, and cook until meat is cooked, about 2 1/2 hours."
        },
        {
            "2": "Remove meat; set aside to cool. Strain broth, and measure 8 cups into another pot. Return broth to stove, and let simmer."
        },
        {
            "3": "Peel skin from ears, leaving the ear as intact as possible. Place the ears aside. Remove gristle and fat from pig's feet, and combine with ear trimmings. Cut off large portion of tongue and set aside. Trim loose meat from remainder of tongue, and combine with other trimmings. Put trimmings through a coarse meat grinder, then stir into broth; continue to simmer."
        },
        {
            "4": "Slice tongues into thin strips, and place lengthwise into 2 glass loaf pans, 9x5x3 inches. Slice ears into thin strips, then cut the strips into 1/2 inch pieces. Arrange the ear pieces among the tongue strips. Divide the pimiento and pepperoncini between the two molds. Sprinkle with pickle relish."
        },
        {
            "5": "Dissolve gelatin in 1 cup water. Stir into the simmering broth. Carefully ladle enough broth into each mold to completely cover the meat. Prod with a fork to uniformly distribute. Let stand 15 minutes, then cover with remaining broth. Allow to cool at room temperature, until they begin to jell, 2 to 3 hours. Refrigerate for 8 to 10 hours."
        },
        {
            "6": "When cool, run a thin knife around the sides of the mold to release the souse. Remove any fat that has accumulated on the surface."
        }
    ],
    "Details": [
        {
            "Prep Time": " 2 hrs"
        },
        {
            "Cook Time": " 2 hrs 30 mins"
        },
        {
            "Additional Time": " 10 hrs"
        },
        {
            "Total Time": " 14 hrs 30 mins"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "2 loaves"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "599"
        },
        {
            "Fat": "41g"
        },
        {
            "Carbs": "13g"
        },
        {
            "Protein": "42g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8399577.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}