{
    "title": "Pot Pie with Leftover Pot Roast and Vegetables",
    "Category": "Pot Pie",
    "Ingredients": [
        {
            "1": "1 (14.1 ounce) package double-crust pie pastry, thawed"
        },
        {
            "2": "4 tablespoons butter"
        },
        {
            "3": "4 tablespoons all-purpose flour"
        },
        {
            "4": "0.5 (14.5 ounce) cans beef broth"
        },
        {
            "5": "1 dash hot pepper sauce, or more to taste"
        },
        {
            "6": "1 salt and ground black pepper to taste"
        },
        {
            "7": "2 cups shredded leftover pot roast"
        },
        {
            "8": "1 cup diced cooked potatoes"
        },
        {
            "9": "0.75 cup diced cooked carrots"
        },
        {
            "10": "0.5 cup diced cooked onions"
        },
        {
            "11": "0.5 cup frozen peas"
        },
        {
            "12": "0.5 cup frozen corn"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 400 degrees F (200 degrees C). Place one pie crust into a pie pan and press into place; prick bottom and sides with a fork. Set the second pie crust aside."
        },
        {
            "2": "Bake pie crust in the preheated oven for 3 to 5 minutes; it will still be pliable so you can seal it with the top crust later. Remove from the oven and lower temperature to 375 degrees F (190 degrees C)."
        },
        {
            "3": "Melt butter in a large pan over medium heat. Whisk in flour to make a roux; cook and whisk until golden, 3 to 4 minutes. Whisk in beef broth; continue to cook, whisking constantly, until thickened, 3 to 5 minutes. Add hot pepper sauce, salt, and pepper."
        },
        {
            "4": "Stir in shredded pot roast, potatoes, carrots, onions, peas, and corn. Pour into the partially baked pie crust and cover with the remaining pie crust. Fold the edges of the top crust under the bottom crust and press edges together to seal. Cut 3 to 4 slits in the top crust to allow steam to escape."
        },
        {
            "5": "Bake in the preheated oven until crust is golden brown, 35 to 45 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "497"
        },
        {
            "Fat": "33g"
        },
        {
            "Carbs": "31g"
        },
        {
            "Protein": "19g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6042870.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "pies"
}