{
    "title": "Seafood Pot Pie",
    "Category": "Pot Pie",
    "Ingredients": [
        {
            "1": "0.5 cup unsalted butter"
        },
        {
            "2": "0.5 cups thinly sliced yellow onion"
        },
        {
            "3": "1 cup thinly sliced fennel"
        },
        {
            "4": "1 cup thinly sliced celery"
        },
        {
            "5": "1 cup thinly sliced carrots"
        },
        {
            "6": "0.5 cup all-purpose flour"
        },
        {
            "7": "0.5 cup dry white wine"
        },
        {
            "8": "3 cups fish stock"
        },
        {
            "9": "0.25 cup heavy cream, divided"
        },
        {
            "10": "1 tablespoon kosher salt"
        },
        {
            "11": "0.5 teaspoon ground black pepper"
        },
        {
            "12": "1 (8 ounce) fillet halibut, skin removed, cut into 1-inch pieces"
        },
        {
            "13": "0.5 pound sea scallops, halved horizontally"
        },
        {
            "14": "0.5 pound peeled and deveined medium shrimp"
        },
        {
            "15": "1 pound jumbo lump crabmeat, picked over"
        },
        {
            "16": "1 cup frozen green peas"
        },
        {
            "17": "2 tablespoons chopped fresh parsley, plus more for garnish"
        },
        {
            "18": "1 large egg, lightly beaten"
        },
        {
            "19": "1 (17.3 ounce) package frozen puff pastry sheets, thawed"
        }
    ],
    "Directions": [
        {
            "1": "Melt butter in a large saucepan over medium-high heat. Add onion, fennel, celery, and carrots; cook, stirring often, until vegetables are softened and onion is translucent, about 8 minutes. Add flour and stir to coat vegetables well, stirring for 1 minute. Add wine, and stir until wine has evaporated and mixture creates a slurry, about 15 seconds. Add fish stock and 3 tablespoons cream, stirring until mixture thickens into a creamy sauce, about 5 minutes. Season with salt and pepper, then gently fold in seafood, green peas and parsley."
        },
        {
            "2": "Reduce heat to medium-low, and, gently stirring often, bring mixture to a low simmer until sauce is warm again but the seafood will not be completely cooked through, about 6-8 minutes. Ladle 2 cups mixture into each of 5 (18- to 20-ounce) ungreased ramekins or ovenproof bowls. Place bowls on a foil-lined rimmed baking sheet."
        },
        {
            "3": "Preheat oven to 375 degrees F (190 degrees C). Place an oven rack in middle position."
        },
        {
            "4": "Whisk egg and remaining 1 tablespoon heavy cream in a small bowl. Place defrosted puff pastry sheets on a lightly floured work surface. Roll each sheet into a 13 x 13 square and cut each square into quarters. Discard any extra pastry. Place a square of pastry over each bowl, decoratively folding corners in to fit the bowl, and brush the top with egg wash. Use the tip of a knife to create 3 small slits in the center of the pastry to allow steam to vent during cooking. You may place chopped fennel fronds or parsley leaves on the top of the pastry, lightly pressing leaves onto the pastry in the egg wash to adhere."
        },
        {
            "5": "Place baking sheet with individual portions in the preheated oven and bake until pastry is golden browned and filling is hot and bubbly, about 40 minutes. Let cool 10 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs"
        },
        {
            "Rest Time": "10 mins"
        },
        {
            "Total Time": " 1 hrs 40 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "940"
        },
        {
            "Fat": "55g"
        },
        {
            "Carbs": "59g"
        },
        {
            "Protein": "48g"
        }
    ],
    "Images": [],
    "main category": "pies"
}