{
    "title": "72-Hour Sous Vide Short Ribs",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "6 pounds beef short ribs"
        },
        {
            "2": "8 cloves garlic, crushed"
        },
        {
            "3": "2 tablespoons smoked salt"
        }
    ],
    "Directions": [
        {
            "1": "Heat water in a sous vide water bath to 133 degrees F (56 degrees C)."
        },
        {
            "2": "Trim any areas of fat left on short ribs; coat thoroughly with garlic and salt. Place ribs into a large, resealable plastic bag. (Use two bags if necessary to leave plenty of room between ribs.) Seal, on low pressure if using a vacuum sealer, removing as much air as possible."
        },
        {
            "3": "Submerge the bag fully into the water bath and cook, rotating every 12 to 18 hours, for 60 hours. Increase the heat to 144.5 degrees F (62.5 degrees C) and cook an additional 12 hours."
        },
        {
            "4": "Remove ribs from the water bath; let rest in the bag on a cooling rack placed over a baking sheet until cool enough to handle."
        },
        {
            "5": "Remove ribs from the bag and drain. Place ribs onto a work surface, turn so bones are facing up, and slice meat between the bones to separate. Cut membrane running along the length of each rib; slide the bone loose from the meat. Trim any excess fat and cut into serving portions. Pat ribs dry with paper towels; return to the cooling rack."
        },
        {
            "6": "Heat a skillet until smoking hot. Add ribs and brown quickly, 30 to 60 seconds per side."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "3 days 5 mins"
        },
        {
            "Total Time": "3 days 25 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "940"
        },
        {
            "Fat": "83g"
        },
        {
            "Carbs": "1g"
        },
        {
            "Protein": "43g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4509402.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4509396.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4509395.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}