{
    "title": "Bacon and Gruyere Sous Vide Egg Bites",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "4 slices bacon"
        },
        {
            "2": "6 large eggs"
        },
        {
            "3": "0.5 cup cottage cheese"
        },
        {
            "4": "0.5 cup shredded Gruyere cheese"
        },
        {
            "5": "2 tablespoons heavy cream"
        },
        {
            "6": "0.25 teaspoon salt"
        },
        {
            "7": "6 (4-ounce) mason jars"
        },
        {
            "8": "1  serving cooking spray"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with water and place a sous vide immersion cooker into the water. Set temperature to 170 degrees F (75 degrees C) according to manufacturer's directions."
        },
        {
            "2": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Cool and chop each slice into 4 to 5 pieces."
        },
        {
            "3": "Combine eggs, cottage cheese, Gruyere cheese, heavy cream, and salt in a blender; run blender until thoroughly blended, 15 to 20 seconds."
        },
        {
            "4": "Spray mason jars with cooking spray. Divide bacon between each jar. Carefully pour the egg mixture over the bacon. Screw on the lids until just barely tightened. Do not over-tighten as the jars can burst in the hot water."
        },
        {
            "5": "Submerge mason jars into the water bath and set timer for 55 minutes. When timer is up, remove jars and transfer to a cooling rack. If serving immediately, run a knife along the outer edge and invert onto a plate; you can also eat directly from the jar. Let any remaining jars cool, then refrigerate for up to 1 week."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": " 1 hrs 5 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 egg bites"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "186"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "1g"
        },
        {
            "Protein": "14g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7713811.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}