{
    "title": "Chili-Lime Sous Vide Chicken Thighs",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "2 medium limes"
        },
        {
            "2": "1 teaspoon garlic powder"
        },
        {
            "3": "1 teaspoon onion powder"
        },
        {
            "4": "1 teaspoon chili powder"
        },
        {
            "5": "0.75 teaspoon salt"
        },
        {
            "6": "0.5 teaspoon ground chipotle powder, or to taste"
        },
        {
            "7": "0.25 teaspoon ground paprika"
        },
        {
            "8": "0.25 teaspoon cayenne pepper"
        },
        {
            "9": "4 (6 ounce) bone-in, skin-on chicken thighs"
        },
        {
            "10": "1 tablespoon avocado oil"
        },
        {
            "11": "1 salt and freshly ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with water and place a sous vide immersion cooker into the water. Set temperature to 160 degrees F (71 degrees C) according to manufacturer's directions."
        },
        {
            "2": "Cut one lime into 8 slices. Cut second lime into 4 wedges. Combine garlic powder, onion powder, chili powder, salt, chipotle powder, paprika, and cayenne together in a small bowl."
        },
        {
            "3": "Place chicken thighs, skin-side down, on a cutting board. Carefully remove any excess fat and flaps of skin. Sprinkle seasoning over both sides of chicken, rubbing some under the skin. Place chicken thighs into a large vacuum bag and place a slice of lime on the top and bottom of each thigh. Seal bag using a vacuum sealer."
        },
        {
            "4": "Place bag into the water and set timer for 2 hours. When timer is up, remove chicken from bag and pat dry completely with paper towels. Discard lime slices and bag juices. Lightly flatten each thigh with your palm and a paper towel, using gentle pressure to create a flat searing surface."
        },
        {
            "5": "Heat oil in a skillet over high heat. Lightly season chicken with salt and pepper. Place chicken in the hot skillet, skin-side down, and sear until nicely browned, about 1 minute. Move chicken around the skillet using tongs, holding the chicken up against the side of the skillet to get an even brown color on all edges. Flip thighs over and brown for 30 seconds more. Remove from heat and let sit for 2 to 3 minutes before serving. Squeeze lime wedges over top."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 2 hrs 5 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 2 hrs 25 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "330"
        },
        {
            "Fat": "21g"
        },
        {
            "Carbs": "5g"
        },
        {
            "Protein": "29g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9081991.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}