{
    "title": "Sous Vide Chicken Thighs",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "0.5 teaspoon salt"
        },
        {
            "2": "0.5 teaspoon black pepper"
        },
        {
            "3": "0.5 teaspoon garlic powder"
        },
        {
            "4": "0.5 teaspoon paprika"
        },
        {
            "5": "6 (8 ounce) bone-in chicken thighs with skin"
        },
        {
            "6": "1 tablespoon olive oil"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with water. Place a sous vide immersion cooker into water and set temperature to 160 degrees F (71 degrees C) according to manufacturer's directions."
        },
        {
            "2": "Combine salt, pepper, garlic powder, and paprika in a small bowl; set aside."
        },
        {
            "3": "Place chicken thighs, skin-side down, on a cutting board. Carefully remove bone and any excess fat and flaps of skin. Sprinkle salt mixture over both sides of chicken, rubbing some under the skin. Tuck in sides of chicken to form original thigh shape, then place into 1 large or 2 small vacuum bags. Use a vacuum sealer to seal."
        },
        {
            "4": "Place the bag into preheated water and set the timer for 1 1/2 hours. When the timer is up, remove chicken from the bag and pat dry thoroughly with paper towels."
        },
        {
            "5": "Heat olive oil in a skillet over high heat. Sear chicken in hot oil, skin-side down, until nicely browned, about 1 minute. Move chicken around the skillet using tongs, holding chicken up against the side of the skillet to get an even brown color on all edges. Remove the skillet from heat and let sit for 2 to 3 minutes before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 1 hrs 35 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 55 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "376"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "0g"
        },
        {
            "Protein": "36g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6621979.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}