{
    "title": "Sous Vide and Smoked East Coast Pastrami",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "12 pounds beef brisket"
        },
        {
            "2": "1 Brine-"
        },
        {
            "3": "1 gallon water"
        },
        {
            "4": "2 cups white sugar"
        },
        {
            "5": "0.5 cups kosher salt"
        },
        {
            "6": "10 cloves garlic, crushed"
        },
        {
            "7": "4 teaspoons pink curing salt"
        },
        {
            "8": "1 gallon ice cubes"
        },
        {
            "9": "1 Pickling Spice-"
        },
        {
            "10": "1 tablespoon coriander seeds"
        },
        {
            "11": "1 tablespoon whole black peppercorns"
        },
        {
            "12": "1 tablespoon mustard seeds"
        },
        {
            "13": "1 tablespoon red pepper flakes"
        },
        {
            "14": "1 tablespoon whole cloves"
        },
        {
            "15": "1 teaspoon ground ginger"
        },
        {
            "16": "2  bay leaves"
        }
    ],
    "Directions": [
        {
            "1": "Trim off the fat cap of the brisket and poke some holes in the meat with a paring knife."
        },
        {
            "2": "Bring water to a boil in a large pot on the stovetop. Remove from heat; as it starts to cool down, add white sugar, kosher salt, garlic, and pink curing salt."
        },
        {
            "3": "Find a food-grade, nonreactive container with a lid; pour in brine and ice, then add the brisket. Keep brisket in brine for 5 to 7 days in the refrigerator. Flip the brisket every 24 hours."
        },
        {
            "4": "After brining, pull the brisket out of the container and rinse under cold water."
        },
        {
            "5": "Heat a pan over low heat. Toast coriander seeds, peppercorns, and mustard seeds in the hot pan, about 2 minutes. Remove and transfer to a food processor; add red pepper flakes, cloves, ginger, and bay leaves. Grind well."
        },
        {
            "6": "Use 1/2 of the spice mixture to coat the brisket; seal in a food saver bag. Reserve remaining spice mixture. Place brisket in a sous vide at 137 degrees F (58 degrees C) for 18 hours."
        },
        {
            "7": "Remove from sous vide, cut open the bag, and set out to dry and rest on a wire rack from a smoker for 30 minutes. Use remaining pickling spices to re-coat the brisket."
        },
        {
            "8": "Place a wire rack into the smoker. Add wood chips according to manufacturer's directions and heat to 225 degrees F (107 degrees C)."
        },
        {
            "9": "Smoke brisket until browned, tender, and no longer pink in the center, about 5 hours. Pull brisket from the smoker and let rest for 15 minutes before slicing."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 23 hrs 10 mins"
        },
        {
            "Additional Time": "5 days 45 mins"
        },
        {
            "Total Time": "6 days 25 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "1 12-pound brisket"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "204"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "20g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7913993.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}