{
    "title": "Sous Vide Flank Steak",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "0.5 cup chopped onion"
        },
        {
            "2": "2 tablespoons minced fresh rosemary"
        },
        {
            "3": "2 tablespoons minced garlic"
        },
        {
            "4": "1 tablespoon extra-virgin olive oil"
        },
        {
            "5": "1 tablespoon good quality balsamic vinegar"
        },
        {
            "6": "1 tablespoon Worcestershire sauce, or to taste"
        },
        {
            "7": "1 (1 pound) flank steak, cut in half"
        },
        {
            "8": "1 salt and freshly ground black pepper, to taste"
        }
    ],
    "Directions": [
        {
            "1": "Fill the water bath container, position circulator, and preheat to 130 degrees F (54 degrees C) according to manufacturer recommendations."
        },
        {
            "2": "Combine onion, rosemary, garlic, olive oil, balsamic vinegar, and Worcestershire sauce in a blender or small food processor; pulse ingredients until smooth."
        },
        {
            "3": "Pat flank steak pieces dry with paper towels and season with salt and pepper. Spread onion mixture on both sides of the flank steaks. Place each seasoned flank steak in a 2-quart zip-top freezer bag, squeeze out all the air, and seal the bags."
        },
        {
            "4": "When the bath has reached 130 degrees, place bags in the water bath. Secure bags to the side of the bath, so they will not overlap each other or come in contact with the circulator. Alternatively, use a rack in the bottom of the bath to hold the sealed bags. Bags should be in the circulating 130 degree F (54 degrees C) bath for 1 hour and 30 minutes."
        },
        {
            "5": "About 5 minutes prior to the end of the cook time, set an oven rack about 6 inches from the heat source and preheat the oven's broiler."
        },
        {
            "6": "When the cook time is complete, remove flank steak from the bags and place on a broiler pan."
        },
        {
            "7": "Broil in the preheated oven until they reach the desired browning, about 3 minutes per side. Remove from oven and tent with aluminum foil for 5 to 10 minutes. The broiler and the foil tent will allow the internal temperature to rise to 145 degrees F (63 degrees C), or medium doneness, when tested with an instant read thermometer."
        },
        {
            "8": "Slice steak across the grain of the meat into thin slices for serving. Season with additional Worcestershire sauce, if desired."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": " 1 hrs 36 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 51 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "152"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "5g"
        },
        {
            "Protein": "14g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9081470.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}