{
    "title": "Sous Vide Pork Back Ribs",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "2 tablespoons dark brown sugar"
        },
        {
            "2": "1 tablespoon kosher salt"
        },
        {
            "3": "0.5 tablespoon smoked paprika"
        },
        {
            "4": "0.5 tablespoon ground cumin"
        },
        {
            "5": "1 teaspoon cayenne pepper"
        },
        {
            "6": "2 (2 pound) rack of ribs"
        },
        {
            "7": "4 tablespoons barbeque sauce (such as Sweet Baby Ray's®), or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Place a heat-resistant pad underneath a large pot filled with water. Attach a sous vide precision cooker to the pot and set the temperature to 155 degrees F (68 degrees C)."
        },
        {
            "2": "Combine brown sugar, kosher salt, paprika, cumin, and cayenne in a small bowl; mix well. Remove rough membranes from ribs and cut each rack into thirds. Rub spice mixture onto meat's fleshy side. Place each rack into a plastic bag and seal."
        },
        {
            "3": "Once water temperature has reached 155 degrees F (68 degrees C), submerge both bags in water. Open the bag's seal and allow any air to escape. Reseal. Make sure the bags are completely submerged. Cover the pot with aluminum foil, so steam does not escape."
        },
        {
            "4": "Set the timer for 24 hours, checking water level occasionally. Add more water of the same temperature water if necessary."
        },
        {
            "5": "Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil."
        },
        {
            "6": "Remove ribs from the bags and pat dry. Place ribs on the prepared baking sheet and brush with barbecue sauce."
        },
        {
            "7": "Broil for 4 minutes. Remove ribs from the oven, brush with more barbecue sauce, and broil until sauce starts to caramelize, about 3 more minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "1 day 35 mins"
        },
        {
            "Total Time": "1 day 50 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "843"
        },
        {
            "Fat": "61g"
        },
        {
            "Carbs": "13g"
        },
        {
            "Protein": "58g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6323190.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}