{
    "title": "Sous Vide Turkey Breast",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "1 (2 pound) turkey breast half (with bones and skin)"
        },
        {
            "2": "2 teaspoons kosher salt, divided, or to taste"
        },
        {
            "3": "2  fresh thyme sprigs"
        },
        {
            "4": "2  fresh sage sprigs"
        },
        {
            "5": "2 tablespoons unsalted butter, cut into 1/2-inch cubes"
        },
        {
            "6": "0.5 cup white sugar"
        },
        {
            "7": "0.5 cup Champagne vinegar"
        },
        {
            "8": "2 cups blood orange juice"
        },
        {
            "9": "1 teaspoon grapeseed oil"
        },
        {
            "10": "0.75 teaspoon ground black pepper"
        }
    ],
    "Directions": [
        {
            "1": "Prepare a thermocirculator and water bath according to manufacturer's directions. Set thermocirculator to 145 degrees F (63 degrees C) and allow water bath to come up to temperature."
        },
        {
            "2": "Season turkey breast evenly with 1 teaspoon salt and transfer to a large vacuum-sealable bag; arrange thyme sprigs, sage sprigs, and butter cubes around turkey breast in the bag. Seal bag with a vacuum sealer according to manufacturer's directions. Transfer vacuum-sealed turkey breast to warm water bath with thermocirculator, cover vessel with aluminum foil to reduce evaporation, and cook for 2 hours."
        },
        {
            "3": "While turkey is cooking, cook sugar in a medium nonstick pan over medium heat, without stirring, until deeply caramelized, 6 to 8 minutes. Reduce heat to low and carefully add vinegar (mixture will begin to boil immediately and sugar will crystalize), and cook, stirring frequently, until sugar is completely dissolved, 3 to 4 minutes. Add blood orange juice, increase heat to medium-high, and continue cooking, stirring occasionally, until bubbles begin to thicken slightly and mixture becomes syrup-like in consistency, 10 to 12 minutes; season with salt to taste. Remove blood orange mixture (gastrique) from heat and set aside at room temperature to cool slightly until ready to use."
        },
        {
            "4": "Preheat the oven to 450 degrees F (230 degrees C) with an oven rack positioned in top third of oven."
        },
        {
            "5": "Remove turkey breast from bag and transfer to a rimmed sheet pan lined with aluminum foil and fitted with a wire rack; discard contents remaining in bag (the meat will be at 145 degrees F (63 degrees C) when pulled from water bath)."
        },
        {
            "6": "Gently pat turkey breast dry with paper towels and brush turkey skin with oil; season turkey breast evenly with remaining 1 teaspoon kosher salt and pepper. Place turkey breast, skin-side up, on the prepared sheet pan."
        },
        {
            "7": "Cook in the preheated oven until skin is crispy and golden brown, and a thermometer inserted into the thickest portion registers 155 degrees F (68 degrees C), 12 to 15 minutes. Remove turkey breast from oven and let rest at room temperature for 5 minutes."
        },
        {
            "8": "Using a knife, carefully remove turkey breast from bone; discard bones. Slice turkey breast against the grain into 1/4- to 1/2-inch thick pieces; serve with blood orange gastrique."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 2 hrs 15 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 2 hrs 35 mins"
        },
        {
            "Servings": "4 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "509"
        },
        {
            "Fat": "13g"
        },
        {
            "Carbs": "41g"
        },
        {
            "Protein": "55g"
        }
    ],
    "Images": [],
    "main category": "cooking_technique_&_channels"
}