{
    "title": "Sous Vide Chicken Breast with Lemon and Herbs",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "2 (10 ounce) split chicken breasts, bone-in and skin-on"
        },
        {
            "2": "1 salt and freshly cracked black pepper to taste"
        },
        {
            "3": "2 cloves garlic, sliced"
        },
        {
            "4": "6 sprigs thyme"
        },
        {
            "5": "2 slices  lemon"
        },
        {
            "6": "1 tablespoon olive oil"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with water and place a sous vide cooker into the water. Set temperature to 148 degrees F according to manufacturer's directions."
        },
        {
            "2": "Season chicken breast liberally with salt and pepper on both sides. Set garlic slices, thyme, and lemon on top of chicken skin. Place chicken into 1 large or 2 small vacuum bags. Seal using a vacuum sealer."
        },
        {
            "3": "Place bags into the water and set timer for 2 hours. When timer is up, remove chicken from bag. Remove garlic, thyme, and lemon slices and pat chicken dry with paper towels."
        },
        {
            "4": "Heat olive oil in a skillet over medium-high heat and cook chicken, skin-side down until nicely browned, about 1 minute. Move chicken around the skillet using tongs, holding the chicken up against the side of the skillet to get an even brown color on all edges. Remove from heat and let sit for 2 to 3 minutes. Flip chicken over and remove the bones. Slice chicken and serve immediately."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 2 hrs 5 mins"
        },
        {
            "Additional Time": "2 mins"
        },
        {
            "Total Time": " 2 hrs 22 mins"
        },
        {
            "Servings": "2 "
        },
        {
            "Yield": "2 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "382"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "3g"
        },
        {
            "Protein": "59g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6459889.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}