{
    "title": "Sous Vide Blade Roast with Au Jus",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "1 (3 pound) blade chuck roast"
        },
        {
            "2": "1 salt and freshly ground black pepper to taste"
        },
        {
            "3": "0.5 tablespoons olive oil"
        },
        {
            "4": "1 tablespoon garlic, finely grated"
        },
        {
            "5": "1 teaspoon salt"
        },
        {
            "6": "1 teaspoon ground black pepper"
        },
        {
            "7": "1 teaspoon ground thyme"
        },
        {
            "8": "1 teaspoon dried parsley"
        },
        {
            "9": "1 Au jus-"
        },
        {
            "10": "0.5 cups water"
        },
        {
            "11": "2 teaspoons beef base (such as Better than Bouillon®)"
        },
        {
            "12": "0.5 teaspoon low-sodium soy sauce (such as Bragg®)"
        },
        {
            "13": "0.25 teaspoon garlic granules"
        }
    ],
    "Directions": [
        {
            "1": "Place a heat-resistant pad underneath a large pot filled with warm water. Attach a sous vide precision cooker to the pot and set temperature to 135 degrees F (57°C). Set the timer to 24 hours."
        },
        {
            "2": "Remove all surface fat and silver skin from the roast. Truss the roast and generously season with salt and pepper on all sides."
        },
        {
            "3": "Place the roast in a large resealable bag and remove all the air with a vacuum sealer. Place bag in the pot once the right temperature is reached, making sure it is completely submerged. Cover pot with plastic wrap to ensure the water doesn't evaporate."
        },
        {
            "4": "Combine olive oil, garlic, 1 teaspoon salt, 1 teaspoon pepper, thyme, and parsley in a small bowl 1 hour before the timer goes off."
        },
        {
            "5": "Preheat the oven to 400 degrees F (200 degrees C) 20 minutes before the timer goes off. Line a baking sheet with aluminum foil."
        },
        {
            "6": "Remove the bag from the pot and transfer to a plate. Remove roast and pat dry using paper towels to remove as much moisture as possible. Place the roast on the prepared baking sheet and cover with olive oil mixture."
        },
        {
            "7": "Roast in the preheated oven for 20 minutes."
        },
        {
            "8": "While the roast is in the oven, combine water, beef base, soy sauce, and garlic granules in a saucepan over medium-high heat. Bring to a soft boil, then reduce heat, and simmer until sauce is reduced, 10 to 15 minutes."
        },
        {
            "9": "Remove roast from the oven, cover with foil, and let rest for 10 minutes."
        },
        {
            "10": "Slice roast and place on a platter. Drizzle au jus on top or serve sauce separately."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "1 day 20 mins"
        },
        {
            "Additional Time": "10 mins"
        },
        {
            "Total Time": "1 day 40 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "182"
        },
        {
            "Fat": "14g"
        },
        {
            "Carbs": "0g"
        },
        {
            "Protein": "14g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8289319.jpg"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fpublic-assets-ucg.meredithcorp.io%2Fbae5d4882bed662c6f21f5f71890afd6%2F6550340.jpg"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6465171.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}