{
    "title": "Sous Vide Cajun Boneless Chicken Breast with Creamy Pan Sauce",
    "Category": "Sous Vide Recipes",
    "Ingredients": [
        {
            "1": "4 (6 ounce) skinless, boneless chicken breast halves"
        },
        {
            "2": "4 teaspoons Cajun seasoning"
        },
        {
            "3": "1 tablespoon butter"
        },
        {
            "4": "1 tablespoon avocado oil"
        },
        {
            "5": "1 For Sauce-"
        },
        {
            "6": "1 tablespoon butter"
        },
        {
            "7": "2 cloves garlic, minced"
        },
        {
            "8": "0.75 cup unsalted chicken broth"
        },
        {
            "9": "0.25 cup heavy cream"
        },
        {
            "10": "0.25 teaspoon freshly cracked black pepper"
        },
        {
            "11": "2 tablespoons grated Parmesan cheese"
        },
        {
            "12": "1 salt to taste"
        },
        {
            "13": "1 tablespoon minced fresh thyme"
        }
    ],
    "Directions": [
        {
            "1": "Fill a large pot with water and place a sous vide cooker into the water. Set temperature to 140 degrees F (60 degrees C) according to manufacturer's directions."
        },
        {
            "2": "Pound chicken breasts with a meat mallet to an even 3/4- to 1-inch thickness. Season both sides with Cajun seasoning. Place chicken into vacuum bags and seal using a vacuum sealer."
        },
        {
            "3": "Lower bags into the water, making sure they are fully submerged, and set timer for 1 hour. When timer is up, remove chicken from water and immediately place into an ice bath for 5 minutes. Remove chicken from bag and pat completely dry with paper towels."
        },
        {
            "4": "Heat 1 tablespoon of butter and avocado oil in a large skillet over high heat until just smoking. Sear chicken for 30 to 45 seconds per side, moving the chicken around in the skillet to get all sides evenly browned. Remove to a plate and cover with foil to keep warm."
        },
        {
            "5": "Melt butter for sauce in the same skillet over medium heat. Add garlic and saute until fragrant, 15 to 30 seconds. Whisk in chicken broth and bring to a simmer. Cook until slightly reduced down, 3 to 4 minutes. Whisk in heavy cream and black pepper and return to a light simmer. Cook, whisking continually, until thickened. Stir in Parmesan cheese, 1 tablespoon at a time, until melted and combined. Taste sauce and adjust salt, if needed. Sprinkle in thyme and drizzle sauce over chicken."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": " 1 hrs 10 mins"
        },
        {
            "Additional Time": "5 mins"
        },
        {
            "Total Time": " 1 hrs 25 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "345"
        },
        {
            "Fat": "20g"
        },
        {
            "Carbs": "3g"
        },
        {
            "Protein": "38g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9309745.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}