{
    "title": "Spaghetti Squash Chicken Parm",
    "Category": "Chicken Parmesan",
    "Ingredients": [
        {
            "1": "1 (3 pound) spaghetti squash, halved lengthwise and seeded"
        },
        {
            "2": "1 extra-virgin olive oil cooking spray"
        },
        {
            "3": "2 large egg whites"
        },
        {
            "4": "0.5 cup blanched almond flour"
        },
        {
            "5": "2 tablespoons shredded Parmesan cheese"
        },
        {
            "6": "1 sea salt and ground black pepper to taste"
        },
        {
            "7": "5 (5 ounce) skinless, boneless chicken breasts, pounded flat"
        },
        {
            "8": "1 tablespoon extra-virgin olive oil"
        },
        {
            "9": "1 (28 ounce) can fire-roasted diced tomatoes"
        },
        {
            "10": "2 tablespoons minced garlic"
        },
        {
            "11": "1 tablespoon minced fresh parsley"
        },
        {
            "12": "1 teaspoon Italian seasoning"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper."
        },
        {
            "2": "Spray spaghetti squash flesh with cooking spray, then place cut-sides down on the prepared baking sheet. Cover with foil."
        },
        {
            "3": "Roast in the preheated oven until tender when pierced with a fork, 40 to 45 minutes."
        },
        {
            "4": "After the squash has been cooking for about 20 minutes, place egg whites in a shallow bowl. Combine almond flour, Parmesan cheese, salt, and pepper in a second bowl."
        },
        {
            "5": "Dip each chicken breast in egg whites, then move to flour mixture and coat completely."
        },
        {
            "6": "Heat olive oil in a large saute pan over medium heat. Add chicken breasts and cook until they begin to brown slightly, about 7 minutes. Flip and cook until golden brown on the other sides, 7 to 8 more minutes."
        },
        {
            "7": "As the chicken is cooking, combine tomatoes, garlic, parsley, and Italian seasoning in a large saucepan over medium-low heat; cook until hot, 7 to 10 minutes."
        },
        {
            "8": "Remove squash from the oven and use a fork to shred the flesh directly into the sauce. Mix until well coated and heated through, about 5 minutes."
        },
        {
            "9": "Spoon squash-sauce mixture onto 5 plates and top each with a chicken breast."
        }
    ],
    "Details": [
        {
            "Prep Time": "25 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "5 "
        },
        {
            "Yield": "5 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "382"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "29g"
        },
        {
            "Protein": "37g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3124198.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}