{
    "title": "Stuffed Chicken Parmesan Sub",
    "Category": "Chicken Parmesan",
    "Ingredients": [
        {
            "1": "2  skinless, boneless chicken breast halves"
        },
        {
            "2": "2 cups Italian-style salad dressing"
        },
        {
            "3": "2 cups all-purpose flour"
        },
        {
            "4": "1 tablespoon baking powder"
        },
        {
            "5": "0.5 cups milk"
        },
        {
            "6": "1  egg"
        },
        {
            "7": "3 cups Italian-seasoned bread crumbs"
        },
        {
            "8": "2 tablespoons butter, divided, or as needed"
        },
        {
            "9": "10 slices prosciutto, chopped into chunks"
        },
        {
            "10": "4 cups marinara sauce"
        },
        {
            "11": "1 canola oil as needed"
        },
        {
            "12": "1 cup shredded mozzarella cheese, or more to taste"
        },
        {
            "13": "4  Italian sub rolls"
        },
        {
            "14": "8 slices provolone cheese"
        },
        {
            "15": "1 cup grated Parmesan cheese"
        }
    ],
    "Directions": [
        {
            "1": "Slice each chicken breast down the center to make 4 cutlets. Place each between 2 pieces of plastic wrap and pound to about 1/2 inch thinness with a meat mallet."
        },
        {
            "2": "Marinate chicken breasts in Italian dressing in the refrigerator overnight."
        },
        {
            "3": "Remove chicken to bring to room temperature 1 hour before cooking."
        },
        {
            "4": "Combine flour and baking powder in one bowl, milk and egg in another bowl, and bread crumbs in a third bowl. Set aside."
        },
        {
            "5": "Heat 1 tablespoon butter in a pan over medium heat. Cook prosciutto in the hot butter until it starts to brown, about 5 minutes. Transfer to a paper towel-lined plate."
        },
        {
            "6": "Bring marinara sauce to a simmer in a saucepan."
        },
        {
            "7": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Preheat the oven to 450 degrees F (230 degrees C)."
        },
        {
            "8": "Lay chicken cutlets out flat. Line 1/4 of mozzarella cheese down the center of each and sprinkle 1/4 of prosciutto over cheese. Fold cutlets in half over the stuffing and secure edges together with toothpicks."
        },
        {
            "9": "Dunk rolled chicken into the flour mixture, then egg mixture, and finally bread crumbs."
        },
        {
            "10": "Drop chicken into the preheated fryer and cook until crumbs are golden brown, chicken floats, and is no longer pink in the center, 6 to 7 minutes. Transfer to a paper towel-lined plate to let grease run off."
        },
        {
            "11": "Cut sub rolls down the centers and spread remaining butter into interiors. Assemble sandwiches in the following manner: bottom sub half, chicken cutlet, marinara, provolone cheese, Parmesan cheese, and top sub half. Transfer subs to a baking pan."
        },
        {
            "12": "Toast in the preheated oven until bread is crisp and cheeses are melted, about 2 minutes. Serve hot."
        }
    ],
    "Details": [
        {
            "Prep Time": "45 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Additional Time": " 9 hrs"
        },
        {
            "Total Time": " 10 hrs 5 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "4 subs"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "1104"
        },
        {
            "Fat": "54g"
        },
        {
            "Carbs": "110g"
        },
        {
            "Protein": "43g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7086525.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}