{
    "title": "Southwest Chicken Panini",
    "Category": "Panini",
    "Ingredients": [
        {
            "1": "0.25 cup water"
        },
        {
            "2": "0.25 cup vegetable oil"
        },
        {
            "3": "1 (1.06 ounce) package mesquite marinade"
        },
        {
            "4": "2 (4 ounce) skinless, boneless chicken breast halves"
        },
        {
            "5": "1 teaspoon olive oil"
        },
        {
            "6": "0.5 medium red bell pepper, sliced"
        },
        {
            "7": "0.5 medium green bell pepper, sliced"
        },
        {
            "8": "0.5 medium onion, sliced"
        },
        {
            "9": "2 teaspoons salted butter, softened"
        },
        {
            "10": "4 slices sourdough bread"
        },
        {
            "11": "0.75 cup shredded Monterey Jack cheese"
        }
    ],
    "Directions": [
        {
            "1": "Whisk water, vegetable oil, and marinade mix together in a glass or ceramic bowl. Add chicken and toss to coat. Cover with plastic wrap and marinate in the refrigerator for 15 to 30 minutes, or overnight."
        },
        {
            "2": "Preheat an electric grill (such as George Foreman®) for medium heat and lightly oil the grate."
        },
        {
            "3": "Remove chicken from the marinade and shake off excess. Discard the remaining marinade."
        },
        {
            "4": "Place chicken on the preheated grill, close the lid, and cook until no longer pink in the center and the juices run clear, about 6 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        },
        {
            "5": "While chicken is cooking, heat olive oil in a skillet over medium heat. Add bell peppers and onion and saute until tender, 5 to 7 minutes."
        },
        {
            "6": "Butter one side of each slice of bread. Assemble 2 sandwiches by layering Monterey Jack cheese, vegetables, and chicken between the unbuttered sides of the bread."
        },
        {
            "7": "Place sandwiches on the grill, close the lid, and cook until bread is golden brown and cheese is melted, about 3 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "10 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "2 "
        },
        {
            "Yield": "2 sandwiches"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "808"
        },
        {
            "Fat": "50g"
        },
        {
            "Carbs": "49g"
        },
        {
            "Protein": "44g"
        }
    ],
    "Images": [],
    "main category": "flour"
}