{
    "title": "Orange Blintzes",
    "Category": "Blintz",
    "Ingredients": [
        {
            "1": "2 tablespoons white sugar"
        },
        {
            "2": "1 teaspoon grated orange zest"
        },
        {
            "3": "0.75 teaspoon salt"
        },
        {
            "4": "1 cup all-purpose flour"
        },
        {
            "5": "0.25 cup milk"
        },
        {
            "6": "0.25 cup vanilla yogurt"
        },
        {
            "7": "2 tablespoons extra-virgin olive oil"
        },
        {
            "8": "4  eggs"
        },
        {
            "9": "0.5 cup orange juice"
        },
        {
            "10": "1  egg"
        },
        {
            "11": "3 tablespoons white sugar"
        },
        {
            "12": "2 tablespoons unsalted butter, melted"
        },
        {
            "13": "1 (16 ounce) package small curd cottage cheese"
        },
        {
            "14": "5 tablespoons dry bread crumbs"
        },
        {
            "15": "1 tablespoon grated orange zest"
        },
        {
            "16": "2 tablespoons unsalted butter"
        }
    ],
    "Directions": [
        {
            "1": "Mix 2 tablespoons of sugar, 1 teaspoon of orange zest, salt, and flour in a small bowl. Combine milk and yogurt in a separate bowl. Stir in olive oil and mix until smooth. Beat 4 eggs in a large bowl, then add orange juice. Stir in the yogurt mixture followed by the flour mixture. Beat until smooth. Allow batter to rest at room temperature for 1 hour."
        },
        {
            "2": "Beat 1 egg with 3 tablespoons of sugar, then add butter and cottage cheese, mixing until smooth. Stir in the bread crumbs and 1 tablespoon of orange zest. Refrigerate until the batter is ready."
        },
        {
            "3": "Lightly butter a 6 inch skillet, and heat over medium heat. For each crepe, pour 1/4 cup of the batter into the skillet, and immediately rotate the skillet until the batter evenly coats the bottom in a thin layer. Cook until the top of the crepe is no longer wet and the bottom has turned light brown. Run a spatula around the edge of the skillet to loosen; flip the crepe, and cook until the other side has turned light brown. Stack the crepes in a clean kitchen towel, placing waxed paper between each."
        },
        {
            "4": "Place 2 to 3 tablespoons of the filling onto the golden side of the crepe. Roll the crepe up and repeat until all the blintzes are made. Heat 2 tablespoons of butter in a large skillet and fry 4 to 5 blintzes at a time until golden brown, about 2 minutes on each side."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "12 blintzes"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "611"
        },
        {
            "Fat": "31g"
        },
        {
            "Carbs": "56g"
        },
        {
            "Protein": "28g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1444887.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}