{
    "title": "Picadillo Ground Beef Quesadillas",
    "Category": "Quesadillas",
    "Ingredients": [
        {
            "1": "1 medium potato, peeled and diced"
        },
        {
            "2": "1 teaspoon vegetable oil"
        },
        {
            "3": "1 pound lean ground beef"
        },
        {
            "4": "0.5 cup diced red bell pepper"
        },
        {
            "5": "0.5 cup diced onion"
        },
        {
            "6": "2 cloves garlic, minced"
        },
        {
            "7": "1 (8 ounce) can tomato sauce"
        },
        {
            "8": "0.25 cup water"
        },
        {
            "9": "2 tablespoons olive brine"
        },
        {
            "10": "1 teaspoon ground cumin"
        },
        {
            "11": "1 teaspoon dried oregano"
        },
        {
            "12": "1 salt and ground black pepper to taste"
        },
        {
            "13": "0.5 cup sliced pimento-stuffed green olives"
        },
        {
            "14": "3 tablespoons raisins"
        },
        {
            "15": "1 cooking spray"
        },
        {
            "16": "12 (8 inch) flour tortillas"
        },
        {
            "17": "1 cup shredded Mexican cheese blend"
        }
    ],
    "Directions": [
        {
            "1": "Place diced potato in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 8 to 10 minutes. Drain."
        },
        {
            "2": "Heat oil in a large skillet over medium heat. Add cooked potato and brown on all sides for about 3 minutes. Remove from the skillet and set aside."
        },
        {
            "3": "Add ground beef to the skillet; cook and stir until browned, crumbly, and no longer pink in the center, 4 to 5 minutes. Stir in bell pepper, onion, and garlic; cook until softened, 3 to 4 minutes. Drain as much fat from the pan as possible."
        },
        {
            "4": "Stir in tomato sauce, water, olive brine, oregano, salt, and pepper until well combined. Add olives, raisins, and reserved potatoes; stir well. Reduce heat to low and simmer picadillo for 8 minutes, stirring occasionally."
        },
        {
            "5": "Heat a nonstick skillet over medium heat and spray with cooking spray. Place a tortilla in the hot skillet and cook until browned, 1 to 2 minutes per side."
        },
        {
            "6": "Spread about 1/4 cup hot picadillo on one half of the hot tortilla. Top with Mexican cheese, then fold tortilla in half, pressing down with a spatula. Cook until cheese is melted, about 1 more minute. Repeat to cook remaining quesadillas."
        },
        {
            "7": "Cut each quesadilla into 3 triangles to serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "45 mins"
        },
        {
            "Total Time": "55 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 quesadillas"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "348"
        },
        {
            "Fat": "16g"
        },
        {
            "Carbs": "35g"
        },
        {
            "Protein": "15g"
        }
    ],
    "Images": [],
    "main category": "holidays_and_traditional_food"
}