{
    "title": "Best Home-Style Beef Stroganoff",
    "Category": "Beef Stroganoff",
    "Ingredients": [
        {
            "1": "0.25 pounds beef sirloin steak"
        },
        {
            "2": "3 teaspoons kosher salt, divided, or to taste"
        },
        {
            "3": "0.5 teaspoon ground black pepper, or to taste"
        },
        {
            "4": "0.5 teaspoon garlic powder"
        },
        {
            "5": "4 teaspoons olive oil"
        },
        {
            "6": "3 tablespoons butter, divided"
        },
        {
            "7": "1 medium onion, thinly sliced"
        },
        {
            "8": "1 (8 ounce) package sliced mushrooms"
        },
        {
            "9": "2 tablespoons all-purpose flour"
        },
        {
            "10": "1 tablespoon tomato paste"
        },
        {
            "11": "2 cups unsalted beef broth, or more to taste"
        },
        {
            "12": "2 teaspoons Dijon mustard"
        },
        {
            "13": "2 teaspoons Worcestershire sauce"
        },
        {
            "14": "1 (16 ounce) package wide egg noodles"
        },
        {
            "15": "1 cup sour cream"
        },
        {
            "16": "1 tablespoon chopped fresh parsley"
        }
    ],
    "Directions": [
        {
            "1": "Slice beef into very thin strips and season with ½ teaspoon each salt, pepper, and garlic powder."
        },
        {
            "2": "Heat 2 teaspoons oil in a large skillet over medium-high heat until very hot. Add ½ of the beef in a single layer and cook, undisturbed, for 2 minutes. Flip and cook until browned on the other side, about 1 minute. Remove to a plate and repeat with the remaining olive oil and beef."
        },
        {
            "3": "Fill a large pot with water and set over high heat on another burner."
        },
        {
            "4": "Melt 2 tablespoons butter in the same skillet over medium heat. Add onion and cook until it starts to release its juices, about 2 minutes. Add mushrooms and ½ teaspoon salt; cook, stirring often, until tender and lightly browned, 2 to 4 minutes. Sprinkle with flour and cook, stirring constantly, for 1 to 2 minutes. Stir in tomato paste and cook for 1 minute."
        },
        {
            "5": "Whisk in 2 cups beef broth and mustard and bring to a simmer, scraping the browned bits of food off the bottom of the pan with a wooden spoon. Add more broth if necessary as sauce thickens. Stir in Worcestershire sauce and add reserved beef and any drippings. Reduce heat to low and simmer, stirring occasionally, while you cook the pasta."
        },
        {
            "6": "Add egg noodles and remaining 1 teaspoon salt to the boiling water. Boil until noodles are tender yet firm to the bite, 7 to 9 minutes. Drain noodles and toss with remaining 1 tablespoon butter."
        },
        {
            "7": "Add sour cream to the sauce, a little at a time, stirring swiftly to incorporate. Taste and adjust salt and pepper, if needed."
        },
        {
            "8": "Ladle sauce over egg noodles and garnish with parsley."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "607"
        },
        {
            "Fat": "25g"
        },
        {
            "Carbs": "61g"
        },
        {
            "Protein": "35g"
        }
    ],
    "Images": [],
    "main category": "meat_&_chicken"
}