{
    "title": "Instant Pot® Beef Stroganoff",
    "Category": "Beef Stroganoff",
    "Ingredients": [
        {
            "1": "2 tablespoons vegetable oil"
        },
        {
            "2": "1 small onion, diced"
        },
        {
            "3": "2 pounds beef steak, cubed or cut into 1/2-inch to 1-inch strips"
        },
        {
            "4": "4 cloves garlic, minced"
        },
        {
            "5": "1 teaspoon chopped fresh thyme"
        },
        {
            "6": "4 cups beef broth, divided"
        },
        {
            "7": "3 tablespoons Worcestershire sauce, or more to taste"
        },
        {
            "8": "3 cups chopped fresh mushrooms"
        },
        {
            "9": "1 (16 ounce) package egg noodles"
        },
        {
            "10": "1 (24 ounce) container sour cream"
        },
        {
            "11": "2 tablespoons cornstarch, or more as needed (Optional)"
        },
        {
            "12": "1 salt and freshly ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Turn on a multi-functional pressure cooker (such as Instant Pot®), select Saute function, and add oil. Add onions to the hot oil and cook until soft and translucent, 2 to 3 minutes. Remove onions to a plate. Add beef to the pot and cook and stir until seared on all sides, 3 to 5 minutes. Mix in garlic and thyme and cook for 1 more minute. Pour in 1 cup beef broth to deglaze the pot, scraping off all the browned bits. Cancel Saute function."
        },
        {
            "2": "Mix in cooked onions, remaining 3 cups beef broth, mushrooms, and Worcestershire sauce. Close and lock the lid. Select High pressure according to manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build."
        },
        {
            "3": "Release pressure using the natural-release method according to manufacturer's instructions, for 5 minutes. Release remaining pressure carefully using the quick-release method, about 5 minutes. Unlock and remove the lid. Stir in egg noodles and mix to combine."
        },
        {
            "4": "Close and lock the lid. Select High pressure according to manufacturer's instructions; set timer for 5 minutes. Allow 10 minutes for pressure to build."
        },
        {
            "5": "Release pressure carefully using the quick-release method, about 5 minutes. Unlock and remove the lid. Stir in sour cream. To thicken the sauce (if too thin), transfer 1/4 cup broth mixture to a small bowl and mix with cornstarch; add back to pot, stirring slowly until combined. Season with salt and pepper."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Additional Time": "15 mins"
        },
        {
            "Total Time": " 1 hrs 15 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "562"
        },
        {
            "Fat": "29g"
        },
        {
            "Carbs": "49g"
        },
        {
            "Protein": "27g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8849923.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7930712.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6230989.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}