{
    "title": "Homemade Roasted Chicken Noodle Soup",
    "Category": "Chicken Noodle Soup",
    "Ingredients": [
        {
            "1": "1 Roasted Chicken-"
        },
        {
            "2": "1 (4 pound) whole chicken, cut into pieces"
        },
        {
            "3": "4 teaspoons olive oil, divided"
        },
        {
            "4": "2 teaspoons kosher salt, divided"
        },
        {
            "5": "1 teaspoon ground black pepper, divided"
        },
        {
            "6": "2 medium carrots, cut into 2-inch pieces"
        },
        {
            "7": "1 medium onion, quartered"
        },
        {
            "8": "1 head garlic, cut in half lengthwise"
        },
        {
            "9": "1 cup cold water"
        },
        {
            "10": "1 Stock-"
        },
        {
            "11": "10 cups cold water"
        },
        {
            "12": "3 medium carrots, cut into 2-inch pieces"
        },
        {
            "13": "3 stalks celery, cut into 2-inch pieces"
        },
        {
            "14": "1 medium onion, quartered"
        },
        {
            "15": "0.5 bunch parsley stems"
        },
        {
            "16": "1 large bay leaf"
        },
        {
            "17": "1 Soup-"
        },
        {
            "18": "2 tablespoons butter"
        },
        {
            "19": "2 teaspoons olive oil"
        },
        {
            "20": "2 medium carrots, peeled and finely chopped"
        },
        {
            "21": "2 stalks celery, finely chopped"
        },
        {
            "22": "1 medium onion, finely chopped"
        },
        {
            "23": "1 teaspoon kosher salt, or more to taste"
        },
        {
            "24": "0.5 teaspoon ground black pepper, or more to taste"
        },
        {
            "25": "2 teaspoons chicken soup base (such as Better than Bouillon® Roasted Chicken Base)"
        },
        {
            "26": "1 (8 ounce) package egg noodles"
        },
        {
            "27": "3 tablespoons finely chopped fresh parsley"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 425 degrees F (220 degrees C)."
        },
        {
            "2": "Prepare roasted chicken: Place chicken pieces on a rimmed baking sheet. Lightly coat with 2 teaspoons oil, then sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper."
        },
        {
            "3": "Toss carrots, onion, and garlic with the remaining 2 teaspoons oil. Arrange mixture around the chicken pieces on baking sheet."
        },
        {
            "4": "Roast in the preheated oven until vegetables are golden brown and chicken is no longer pink at the bone and the juices run clear, 50 to 60 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Remove the baking sheet from the oven and add 1 cup cold water."
        },
        {
            "5": "Remove chicken pieces from the baking sheet and let sit until cool enough to handle. Remove and discard chicken skin. Shred meat from chicken, keeping white meat and dark meat separate. Place bones in a large Dutch oven. Set aside 3 ½ cups white meat for the soup. Reserve dark meat and any remaining white meat for another use."
        },
        {
            "6": "Prepare stock: Add liquid and vegetables from the baking sheet to the Dutch oven. Add 10 cups cold water, carrots, celery, onion, parsley stems, and bay leaf; bring to a boil over medium-high heat. Reduce heat and simmer, occasionally skimming the surface for impurities, 2 to 4 hours. Strain and discard solids and reserve stock."
        },
        {
            "7": "Prepare soup: heat butter and olive oil in a clean Dutch oven medium-high heat until butter has melted. Add carrots, celery, and onion and cook, stirring constantly, for 2 minutes. Add 1 teaspoon salt and ½ teaspoon pepper and cook, stirring occasionally, until onions are translucent, another 3 to 5 minutes. Add 10 cups reserved stock and chicken base and bring mixture to a boil. Reduce to a simmer and cook until veggies are tender, about 30 minutes."
        },
        {
            "8": "While the soup is cooking, fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes. Drain."
        },
        {
            "9": "Stir cooked egg noodles into the soup with reserved white meat and parsley. Taste and adjust salt and pepper if necessary."
        }
    ],
    "Details": [
        {
            "Prep Time": "55 mins"
        },
        {
            "Cook Time": " 3 hrs 35 mins"
        },
        {
            "Total Time": " 4 hrs 30 mins"
        },
        {
            "Servings": "12 "
        },
        {
            "Yield": "12 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "495"
        },
        {
            "Fat": "29g"
        },
        {
            "Carbs": "26g"
        },
        {
            "Protein": "34g"
        }
    ],
    "Images": [],
    "main category": "soups"
}