{
    "title": "BLT Pasta Carbonara",
    "Category": "Pasta Carbonara",
    "Ingredients": [
        {
            "1": "1 tablespoon olive oil"
        },
        {
            "2": "0.5 pound sliced bacon, cut into 1/2-inch pieces"
        },
        {
            "3": "1 cup grated Parmesan cheese"
        },
        {
            "4": "3  eggs"
        },
        {
            "5": "1  egg yolk"
        },
        {
            "6": "1 salt and freshly ground black pepper to taste"
        },
        {
            "7": "6.5 ounces whole wheat elbow macaroni"
        },
        {
            "8": "3 cloves garlic, minced"
        },
        {
            "9": "1 pint cherry tomatoes, halved"
        },
        {
            "10": "1 bunch fresh spinach, stems removed and leaves torn into bite-sized pieces"
        }
    ],
    "Directions": [
        {
            "1": "Heat oil in a large skillet over medium heat. Add bacon; cook, stirring occasionally until crisp and fat has rendered, 5 to 7 minutes. Remove bacon using a slotted spoon and set aside. Pour bacon fat into a small bowl and set aside, but do not wash the skillet."
        },
        {
            "2": "Bring a large pot of lightly salted water to a boil."
        },
        {
            "3": "Mix Parmesan cheese, eggs, egg yolk, and 1/8 teaspoon black pepper together in a bowl."
        },
        {
            "4": "Cook elbow macaroni in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain into a colander set over a large, heatproof bowl. Reserve 1 cup of the cooking water and pour the rest out, keeping the now-heated bowl in place."
        },
        {
            "5": "Return 1 teaspoon reserved bacon fat to the large skillet over medium heat. Add garlic and cook until fragrant, about 30 seconds. Cook 30 seconds more and add tomatoes. Cook, stirring occasionally, until heated through but not falling apart, about 5 minutes. Stir in spinach."
        },
        {
            "6": "Add cooked bacon, cooked tomato mixture, and cooked pasta to the heated bowl. Whisk 1/2 cup of the reserved cooking water into the egg mixture. Pour this over the pasta mixture in the bowl and toss for 3 minutes. Thin sauce if necessary by adding additional reserved cooking water. Season with salt and pepper. Serve immediately with additional Parmesan cheese."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "20 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "432"
        },
        {
            "Fat": "15g"
        },
        {
            "Carbs": "54g"
        },
        {
            "Protein": "24g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9169072.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8996117.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2493091.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}