{
    "title": "Chicken-Bacon Carbonara",
    "Category": "Pasta Carbonara",
    "Ingredients": [
        {
            "1": "1 pound bacon, cut into 1-inch pieces"
        },
        {
            "2": "1 medium onion, chopped"
        },
        {
            "3": "5 cloves garlic, sliced"
        },
        {
            "4": "0.25 cup dry red wine"
        },
        {
            "5": "1 (16 ounce) package bow-tie pasta (farfalle)"
        },
        {
            "6": "2 (5 ounce) skinless, boneless chicken breasts, cubed"
        },
        {
            "7": "2 (5 ounce) skinless, boneless chicken thighs, cubed"
        },
        {
            "8": "1 tablespoon olive oil, or more as needed"
        },
        {
            "9": "0.5 teaspoon dried basil, or more to taste"
        },
        {
            "10": "0.25 teaspoon ground nutmeg, divided, or more to taste"
        },
        {
            "11": "1 freshly ground black pepper to taste"
        },
        {
            "12": "4 large eggs, beaten"
        },
        {
            "13": "1 cup heavy cream"
        },
        {
            "14": "0.5 cup grated Parmesan cheese, or more to taste"
        }
    ],
    "Directions": [
        {
            "1": "Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned but not crispy, 8 to 10 minutes. Drain on paper towels, then transfer to a bowl."
        },
        {
            "2": "Add onion to the drippings and saute over medium heat for 2 to 3 minutes. Add garlic and saute until onion is tender, 3 to 4 minutes more. Pour in wine and continue to cook, stirring constantly, until wine evaporates. Add mixture to the bacon."
        },
        {
            "3": "Bring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until tender yet firm to the bite, 8 to 11 minutes."
        },
        {
            "4": "Meanwhile, coat chicken in just enough oil to moisten. Place in the same skillet that was used for the bacon. Heat over medium heat and cook, sprinkling chicken with 1/2 of the basil, a pinch of nutmeg, and pepper, until browned, 5 to 7 minutes. Turn chicken and repeat seasoning on the other side. Continue to cook until no longer pink in the center and juices run clear, 5 to 7 minutes more. Stir bacon mixture into the chicken and keep warm until pasta is done."
        },
        {
            "5": "Combine eggs, cream, Parmesan cheese, and remaining 1/8 teaspoon nutmeg in a jar or shaker. Cover and shake until well combined."
        },
        {
            "6": "Drain pasta and set aside in a bowl."
        },
        {
            "7": "Dump chicken mixture and all drippings into the pasta pot, away from the heat. Add pasta and toss well. All at once, pour egg mixture into the pot, tossing quickly and thoroughly to cook, but not curdle. Serve hot."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "50 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "771"
        },
        {
            "Fat": "39g"
        },
        {
            "Carbs": "59g"
        },
        {
            "Protein": "45g"
        }
    ],
    "Images": [],
    "main category": "carbs"
}