{
    "title": "Maple Syrup-Glazed Bacon Breakfast Carbonara",
    "Category": "Pasta Carbonara",
    "Ingredients": [
        {
            "1": "1 tablespoon olive oil"
        },
        {
            "2": "0.5 pound bacon, diced"
        },
        {
            "3": "0.5 teaspoon garlic powder"
        },
        {
            "4": "3  eggs"
        },
        {
            "5": "0.5 cup grated Parmigiano-Reggiano cheese"
        },
        {
            "6": "0.5 teaspoon ground black pepper"
        },
        {
            "7": "3 tablespoons maple syrup, or more to taste"
        },
        {
            "8": "1 (16 ounce) package spaghetti"
        }
    ],
    "Directions": [
        {
            "1": "Heat oil in a large, high-sided skillet over medium heat. Add bacon and cook, stirring occasionally and sprinkling with garlic powder, until browned and crispy, 7 to 8 minutes."
        },
        {
            "2": "Meanwhile, beat eggs in a separate bowl. Mix in Parmigiano-Reggiano cheese and black pepper."
        },
        {
            "3": "Remove bacon onto paper towels to drain, reserving 3 tablespoons of the oil and bacon grease in the pan. Return bacon to the pan, stir in maple syrup, and bring to a simmer. Quickly turn heat down to low and let simmer for 1 to 2 minutes."
        },
        {
            "4": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain pasta in a strainer set over large glass bowl. Pour 1/4 cup of the pasta water into the skillet with the bacon; stir. Add pasta and toss until coated."
        },
        {
            "5": "Pour remaining pasta water out of the large bowl. Drop the coated noodles into the bowl. Pour in the egg mixture and quickly toss with the pasta until cheese has melted and sauce is creamy and smooth, 1 to 2 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "30 mins"
        },
        {
            "Total Time": "45 mins"
        },
        {
            "Servings": "6 "
        },
        {
            "Yield": "6 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "455"
        },
        {
            "Fat": "13g"
        },
        {
            "Carbs": "63g"
        },
        {
            "Protein": "20g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7486998.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}