{
    "title": "Pineapple Baked Rice (Main Course for Chinese New Year)",
    "Category": "Fried Rice",
    "Ingredients": [
        {
            "1": "1 cup Thai jasmine rice"
        },
        {
            "2": "0.75 cup water"
        },
        {
            "3": "1  pineapple"
        },
        {
            "4": "0.25 cup vegetable oil, divided"
        },
        {
            "5": "2  eggs, beaten"
        },
        {
            "6": "1 link Chinese sausage, thinly sliced"
        },
        {
            "7": "0.25 cup finely chopped carrot"
        },
        {
            "8": "0.25 cup finely chopped onion"
        },
        {
            "9": "0.25 cup green peas"
        },
        {
            "10": "0.25 cup corn"
        }
    ],
    "Directions": [
        {
            "1": "Rinse jasmine rice and place in a rice cooker with water. Cook rice according to manufacturer's instructions, 15 to 20 minutes."
        },
        {
            "2": "Preheat the oven to 300 degrees F (150 degrees C)."
        },
        {
            "3": "Cut pineapple in half lengthwise. Cut out flesh, leaving a thin layer on the skin. Chop 1/2 cup of the flesh; place in a bowl. Reserve remaining flesh for another use. Place pineapple 'bowls' on a baking sheet."
        },
        {
            "4": "Bake in the preheated oven until fragrant, about 5 minutes. Remove from the oven."
        },
        {
            "5": "Increase oven temperature to 350 degrees F (175 degrees C)."
        },
        {
            "6": "Heat 2 tablespoons vegetable oil in a nonstick skillet over medium heat. Pour in beaten eggs; cook until set, about 5 minutes. Transfer to a plate and cut into small pieces. Use a paddle to fluff the cooked rice."
        },
        {
            "7": "Cook and stir Chinese sausage in a separate, dry skillet until fat renders, about 5 minutes. Transfer sausage to a bowl, reserving fat in the skillet."
        },
        {
            "8": "Stir remaining 2 tablespoons oil into the skillet used to cook the sausage. Heat it until you can feel the heat above the skillet. Stir in carrot for 1 minute. Add onion, peas, and corn; stir-fry until onion softens, 3 to 5 minutes. Add 1/2 of the rice; stir well to combine. Mix in remaining rice. Add egg pieces and sausage slices. Mix in pineapple cubes evenly."
        },
        {
            "9": "Transfer fried rice to the pineapple bowls. Cover with aluminum foil."
        },
        {
            "10": "Bake in the preheated oven until heated through, about 15 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 5 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "595"
        },
        {
            "Fat": "23g"
        },
        {
            "Carbs": "90g"
        },
        {
            "Protein": "14g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F347791.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}