{
    "title": "Spam® Fried Rice",
    "Category": "Fried Rice",
    "Ingredients": [
        {
            "1": "1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), cubed"
        },
        {
            "2": "1 tablespoon sesame oil"
        },
        {
            "3": "1  onion, diced"
        },
        {
            "4": "4 cups leftover cooked rice"
        },
        {
            "5": "1 cup frozen peas and carrots"
        },
        {
            "6": "4 large eggs, beaten"
        },
        {
            "7": "2 tablespoons soy sauce"
        },
        {
            "8": "0.5 tablespoon Sriracha (Optional)"
        },
        {
            "9": "4 large eggs"
        },
        {
            "10": "1 salt and ground black pepper to taste"
        },
        {
            "11": "1 tablespoon shredded nori, or to taste (Optional)"
        },
        {
            "12": "1 tablespoon sliced scallions, or to taste (Optional)"
        },
        {
            "13": "1 teaspoon sesame seeds, or to taste (Optional)"
        },
        {
            "14": "1 teaspoon black sesame seeds, or to taste (Optional)"
        }
    ],
    "Directions": [
        {
            "1": "Heat a large skillet over medium-high heat. Add Spam® and fry until lightly browned, 5 to 7 minutes. Transfer to a plate."
        },
        {
            "2": "Heat sesame oil in the same pan until shimmering, about 1 minute. Add onion and saute until it softens slightly, about 5 minutes. Reduce heat and add rice and frozen vegetables; mix and fry until heated through, about 5 minutes. Push the rice mixture to the sides or edges of the pan, add beaten eggs to the center, and scramble until curds form, 3 to 4 minutes."
        },
        {
            "3": "Stir half of the Spam® back into the pan and mix the eggs in with the rest of the rice mixture. Add soy sauce and Sriracha. Mix and remove from the heat."
        },
        {
            "4": "Crack remaining eggs into a skillet over medium heat. Cook until outer edges become opaque, about 1 minute. Cover, reduce heat to low, and cook until whites are completely set, about 4 minutes. Season with salt and pepper."
        },
        {
            "5": "Place fried eggs on top of the fried rice, add reserved Spam®, and garnish with nori, scallions, and sesame seeds."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": "25 mins"
        },
        {
            "Total Time": "40 mins"
        },
        {
            "Servings": "4 "
        },
        {
            "Yield": "4 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "688"
        },
        {
            "Fat": "38g"
        },
        {
            "Carbs": "56g"
        },
        {
            "Protein": "31g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7968217.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}