{
    "title": "Andouille Sausage",
    "Category": "Sausage Recipes",
    "Ingredients": [
        {
            "1": "0.5  yards of large sausage casing, about 2 to 3 inches wide"
        },
        {
            "2": "4 pounds lean pork meat"
        },
        {
            "3": "2 pounds pork fat"
        },
        {
            "4": "0.25 cup minced garlic"
        },
        {
            "5": "2 tablespoons salt"
        },
        {
            "6": "1 teaspoon freshly ground black pepper"
        },
        {
            "7": "1 teaspoon cayenne pepper"
        },
        {
            "8": "0.25 teaspoon dried thyme"
        },
        {
            "9": "1 tablespoon ground paprika"
        },
        {
            "10": "0.25 teaspoon crushed bay leaf"
        },
        {
            "11": "0.25 teaspoon dried sage"
        },
        {
            "12": "5 teaspoons hickory-flavored liquid smoke"
        }
    ],
    "Directions": [
        {
            "1": "Soak the casing in cold water for about an hour to soften it and loosen the salt in which it is packed. Place the wide end of the sausage stuffer up against the sink faucet and run cold water through the inside of the casing to remove excess salt."
        },
        {
            "2": "Cut the meat and fat into 1/2-inch wide chunks. Pass them once through the coarse blade of a meat grinder. In a large bowl, mix together the ground pork and fat with the garlic, salt, pepper, cayenne, thyme, paprika, bay leaf, sage, and hickory smoke. A wooden spoon works well."
        },
        {
            "3": "Cut the casing into 26 inch lengths and tie a small knot in one end of each. Fit the open end over the tip of the sausage stuffer and slide it on until the tip of the stuffer touches the knot. The casing will look like accordion folds. This keeps excess air from getting into the casings. Fit the stuffer onto the meat grinder or according the directions that come with the stuffer, or hold the wide end of the stuffer against or over the opening by hand."
        },
        {
            "4": "Fill the hopper with the sausage mixture. Turn the machine on if it is electric and feed the stuffing gradually into the hopper; for a manual machine, push the stuffing through with a wooden pestle. The sausage casing will fill and inflate gradually. Stop filling about 1 1/4 inches from the funnel end and slip the casing off the funnel, smoothing out any bumps carefully with your fingers and being careful not to push the stuffing out of the casing. Tie off the open end of the sausage tightly with a piece of string or make a knot in the casing itself."
        },
        {
            "5": "To cook, slice the sausage into half-inch rounds and grill in a hot skillet with no water for about 12 minutes on each side, or until brown and crisp at the edges."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Additional Time": " 1 hrs"
        },
        {
            "Total Time": " 1 hrs 35 mins"
        },
        {
            "Servings": "24 "
        },
        {
            "Yield": "3 sausages"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "482"
        },
        {
            "Fat": "46g"
        },
        {
            "Carbs": "1g"
        },
        {
            "Protein": "16g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6685287.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3052115.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img3": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F28082.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img4": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F28085.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "meat_&_chicken"
}