{
    "title": "Turkey Shepherd's Pie with Butternut Squash",
    "Category": "Shepherd's Pie",
    "Ingredients": [
        {
            "1": "1  butternut squash, halved lengthwise"
        },
        {
            "2": "1 tablespoon extra-virgin olive oil, divided"
        },
        {
            "3": "1 salt and ground black pepper to taste"
        },
        {
            "4": "1  sweet potatoes, diced"
        },
        {
            "5": "1 medium onion"
        },
        {
            "6": "1 clove garlic, chopped"
        },
        {
            "7": "1 pound ground turkey, or more to taste"
        },
        {
            "8": "0.5 cup turkey gravy"
        },
        {
            "9": "1 teaspoon Worcestershire sauce"
        },
        {
            "10": "0.25 teaspoon dried thyme, or to taste (Optional)"
        },
        {
            "11": "0.25 teaspoon dried oregano, or to taste (Optional)"
        },
        {
            "12": "1 tablespoon butter"
        },
        {
            "13": "2 teaspoons milk, or to taste"
        },
        {
            "14": "0.5 cup frozen corn"
        },
        {
            "15": "0.5 cup frozen peas"
        },
        {
            "16": "0.25 teaspoon chili powder, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 375 degrees F (190 degrees C)."
        },
        {
            "2": "Place squash halves on a baking sheet. Brush insides with about 1 tablespoon olive oil and season with salt and pepper."
        },
        {
            "3": "Bake in the preheated oven until squash is tender enough to scoop out and mash, about 30 minutes. Leave oven on."
        },
        {
            "4": "Place sweet potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain."
        },
        {
            "5": "Heat 1 tablespoon oil in a skillet over medium-high heat; stir in onion and garlic. Season with salt and pepper. Saute until onion has softened and browned, 5 to 7 minutes."
        },
        {
            "6": "Remove 1/3 of the onion-garlic mixture. Add ground turkey to the skillet with the rest of the onions. Saute until turkey is no longer pink, 5 to 7 minutes. Add turkey gravy, Worcestershire sauce, thyme, and oregano. Cook and stir until flavors combine, 2 to 3 minutes."
        },
        {
            "7": "Remove and discard squash seeds and scoop insides into a bowl. Add sweet potatoes, reserved onion-garlic mixture, butter, and milk; mash together until smooth."
        },
        {
            "8": "Spread turkey mixture into the bottom of a 9-inch square baking pan. Top with corn and peas; add the sweet potato mash last. Sprinkle with chili powder."
        },
        {
            "9": "Bake in the hot oven until top begins to brown, 30 to 45 minutes."
        }
    ],
    "Details": [
        {
            "Prep Time": "15 mins"
        },
        {
            "Cook Time": " 1 hrs 7 mins"
        },
        {
            "Total Time": " 1 hrs 22 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "1 9-inch pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "221"
        },
        {
            "Fat": "8g"
        },
        {
            "Carbs": "25g"
        },
        {
            "Protein": "14g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F374568.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "carbs"
}