{
    "title": "Marbled Chocolate Pumpkin Pie",
    "Category": "Pumpkin Pie",
    "Ingredients": [
        {
            "1": "2 ounces semisweet chocolate, finely chopped"
        },
        {
            "2": "1 (9 inch) unbaked pie crust"
        },
        {
            "3": "1 (16 ounce) can pumpkin puree"
        },
        {
            "4": "1 (14 ounce) can sweetened condensed milk"
        },
        {
            "5": "3 large eggs"
        },
        {
            "6": "0.5 teaspoons pumpkin pie spice"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 425 degrees F (220 degrees C). Fit pie crust into a 9-inch pie dish and place it on a baking sheet."
        },
        {
            "2": "Melt the chocolate in the microwave or on the top of a double boiler. To melt the finely-chopped chocolate in the microwave, melt it in a microwave-proof bowl in 30-second intervals, stirring between intervals. Take care not to overheat, which will cause the chocolate to burn and become grainy. Set the melted chocolate aside while preparing the remainder of the pie filling."
        },
        {
            "3": "Combine pumpkin puree, condensed milk, eggs, and pumpkin pie spice in a large bowl; mix until combined."
        },
        {
            "4": "Measure ½ cup of the pumpkin pie filling and stir it into the bowl of melted chocolate until smooth."
        },
        {
            "5": "Pour the remaining pie filling into the pie shell. Dollop the chocolate pie filling on top. Use a toothpick or butter knife to create a marbled effect by swirling in and out of each of the dollops."
        },
        {
            "6": "Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and continue to bake until filling is set, 35 to 40 minutes.Remove from the oven, set on a wire rack, and cool completely before serving."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Bake Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs 10 mins"
        },
        {
            "Servings": "9 "
        },
        {
            "Yield": "1 pumpkin pie"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "174"
        },
        {
            "Fat": "11g"
        },
        {
            "Carbs": "17g"
        },
        {
            "Protein": "4g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/Qsc0_Dxd8AW-A_ehQQ-V6CVBKEU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Marbled-Chocolate-Pumpkin-Pie-4x3-2-1b309f45cf104432b7b12a4d551ebdd6.jpg"
        }
    ],
    "main category": "pies"
}