{
    "title": "Shrimp Scampi with Tomatoes, Pasta, and Roasted Asparagus",
    "Category": "Shrimp Scampi",
    "Ingredients": [
        {
            "1": "1 pound penne pasta"
        },
        {
            "2": "0.5 cup butter"
        },
        {
            "3": "1 tablespoon Dijon mustard"
        },
        {
            "4": "1 tablespoon minced garlic, or more to taste"
        },
        {
            "5": "1 tablespoon minced flat-leaf parsley, or more to taste"
        },
        {
            "6": "0.5  lemon, juiced"
        },
        {
            "7": "0.25 cup white wine, or more to taste"
        },
        {
            "8": "1 pound uncooked medium shrimp, peeled and deveined"
        },
        {
            "9": "1 pint grape tomatoes, halved"
        },
        {
            "10": "1 bunch fresh asparagus, trimmed"
        },
        {
            "11": "2 tablespoons olive oil"
        },
        {
            "12": "2 tablespoons freshly grated Parmesan cheese, or to taste"
        },
        {
            "13": "1 teaspoon minced garlic"
        },
        {
            "14": "1 coarse kosher salt to taste"
        },
        {
            "15": "1 freshly ground black pepper to taste"
        },
        {
            "16": "1 crushed red pepper to taste"
        },
        {
            "17": "0.25 cup grated Pecorino Romano cheese, or to taste"
        },
        {
            "18": "0.25 cup shredded Italian cheese blend, or to taste"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 450 degrees F (230 degrees C)."
        },
        {
            "2": "Bring a large pot of lightly salted water to a boil. Add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain pasta and return to the pot."
        },
        {
            "3": "Meanwhile, melt butter in a saucepan over medium-low heat. Add Dijon mustard, 1 tablespoon garlic, parsley, lemon juice, and white wine. Place shrimp and tomatoes in a small glass baking dish and pour butter sauce on top. Stir until shrimp and tomatoes are well coated."
        },
        {
            "4": "Combine asparagus, olive oil, Parmesan cheese, 1 teaspoon garlic, salt, black pepper, and red pepper in a second glass baking dish."
        },
        {
            "5": "Place both baking dishes side by side in the oven and bake until shrimp is fully pink, about 15 minutes. Pour shrimp, tomatoes, and butter over the cooked penne pasta and stir to combine. Add Pecorino Romano cheese and Italian blended cheese; mix to combine. Serve asparagus over top of the pasta."
        }
    ],
    "Details": [
        {
            "Prep Time": "20 mins"
        },
        {
            "Cook Time": "15 mins"
        },
        {
            "Total Time": "35 mins"
        },
        {
            "Servings": "8 "
        },
        {
            "Yield": "8 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "442"
        },
        {
            "Fat": "19g"
        },
        {
            "Carbs": "47g"
        },
        {
            "Protein": "21g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8138160.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "sea_fruit"
}