{
    "title": "Italian Capezzoli di Venere (Chocolate Truffles of Venus)",
    "Category": "Truffles",
    "Ingredients": [
        {
            "1": "12 ounces high quality dark chocolate, chopped"
        },
        {
            "2": "16 ounces canned whole chestnuts, drained"
        },
        {
            "3": "6 tablespoons butter, softened"
        },
        {
            "4": "0.5 cup white sugar"
        },
        {
            "5": "0.25 cup brandy"
        },
        {
            "6": "1 teaspoon vanilla extract"
        },
        {
            "7": "12 ounces high quality white chocolate, chopped - divided"
        },
        {
            "8": "1 dash powdered red food coloring"
        }
    ],
    "Directions": [
        {
            "1": "Place the dark chocolate into the top part of a double boiler over simmering water, and let the chocolate melt. Turn off the heat and let the chocolate cool."
        },
        {
            "2": "Place the chestnuts into the work bowl of a food processor, and process until the chestnuts are smoothly pureed, about 1 minute."
        },
        {
            "3": "Beat together the butter and sugar with an electric mixer until the mixture is light and fluffy, about 3 minutes. Stir in the chestnuts, brandy, and vanilla extract until the mixture is smooth. Stir in the chocolate, and pinch off about 1 tablespoon of filling per truffle. Roll the mixture into balls about 1 inch in diameter. If the mixture is too soft to hold its shape, chill for several minutes in refrigerator."
        },
        {
            "4": "Reserve about 1 ounce of white chocolate for tempering, and about 1 ounce for coloring. Melt the remaining 10 ounces of white chocolate over simmering water in a double boiler until the chocolate is melted and warm but not hot (about 105 degrees F (40 degrees C)). Remove the pan containing the melted chocolate from the double boiler, and add about 1 ounce of chopped, unmelted white chocolate. Stir the chocolate until the unmelted pieces of chocolate melt, and the temperature drops to 80 to 82 degrees F (27 to 28 degrees C))."
        },
        {
            "5": "Carefully dip each center in the melted white chocolate, and gently place the truffle onto a piece of parchment paper or waxed paper to cool and harden, about 15 minutes."
        },
        {
            "6": "Melt the remaining 1 ounce of chopped white chocolate over simmering water in a double boiler until the chocolate is melted and warm but not hot. Stir in a very small amount of powdered red food coloring until you get a desired shade of pink. Dip a little colored chocolate out with a spoon, dot each truffle with a pink dot, and allow the pink chocolate dots to set, about 15 minutes. Place the truffles into paper candy cups to serve."
        }
    ],
    "Details": [
        {
            "Prep Time": " 1 hrs 30 mins"
        },
        {
            "Additional Time": "30 mins"
        },
        {
            "Total Time": " 2 hrs"
        },
        {
            "Servings": "60 "
        },
        {
            "Yield": "60 truffles"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "99"
        },
        {
            "Fat": "5g"
        },
        {
            "Carbs": "12g"
        },
        {
            "Protein": "1g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F469900.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        },
        {
            "img2": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F469899.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}