{
    "title": "Chocolate Beet Cake with Beet-Vanilla Glaze",
    "Category": "Chocolate Cake",
    "Ingredients": [
        {
            "1": "1 Cake-"
        },
        {
            "2": "1 baking spray with flour"
        },
        {
            "3": "0.75 cups all-purpose flour"
        },
        {
            "4": "1 cup unsweetened cocoa powder"
        },
        {
            "5": "2 teaspoons baking soda"
        },
        {
            "6": "1 teaspoon baking powder"
        },
        {
            "7": "0.5 teaspoon salt"
        },
        {
            "8": "4 large eggs, separated, at room temperature"
        },
        {
            "9": "1 cup firmly packed brown sugar"
        },
        {
            "10": "1 cup white sugar"
        },
        {
            "11": "0.5 cup unsalted butter, at room temperature"
        },
        {
            "12": "0.25 cup vegetable oil"
        },
        {
            "13": "0.25 cups pureed cooked beets"
        },
        {
            "14": "1 tablespoon vanilla extract"
        },
        {
            "15": "1 cup buttermilk, at room temperature"
        },
        {
            "16": "0.5 cups chocolate chips"
        },
        {
            "17": "1 Glaze-"
        },
        {
            "18": "1 cup powdered sugar"
        },
        {
            "19": "2 tablespoons heavy cream"
        },
        {
            "20": "2 teaspoons pureed cooked beets"
        },
        {
            "21": "1 teaspoon vanilla extract"
        },
        {
            "22": "1 pinch salt"
        }
    ],
    "Directions": [
        {
            "1": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10 cup Bundt pan with a baking spray containing flour."
        },
        {
            "2": "Sift together flour, cocoa powder, baking soda, baking powder, and salt into a bowl."
        },
        {
            "3": "Separate eggs. Place egg whites into a bowl, and whip on high speed until stiff peaks form. Set aside."
        },
        {
            "4": "Cream together brown sugar, white sugar, butter, and oil in a large bowl with an electric mixer for 2 to 3 minutes. Add egg yolks and beat for another 3 minutes. Mix in beet puree and vanilla. Add in half of the sifted flour mixture, and mix until just combined. Pour in buttermilk and mix until just combined. Add in remaining flour mixture and mix until just combined. Fold in chocolate chips."
        },
        {
            "5": "Add 1/3 of whipped egg whites to the cake batter, and gently fold to combine. Add in remaining egg whites, and gently fold just until no streaks of egg white remain. Pour batter into the prepared pan and gently smooth top into an even layer."
        },
        {
            "6": "Bake in the preheated oven until top of cake springs back lightly when touched (or until a bamboo skewer inserted into the center of the cake comes out with a few moist crumbs), 50 to 55 minutes. Allow cake to cool in the pan for 20 minutes before gently running a knife around the edges of the cake to loosen. Invert cake onto a wire rack, and cool completely."
        },
        {
            "7": "To make the glaze combine powdered sugar, heavy cream, beet puree, vanilla extract, and salt in a bowl. Whisk until smooth. If glaze is too thick, add more heavy cream; if glaze is too thin, add more powdered sugar until desired consistency is reached. Drizzle glaze over cooled cake."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": "55 mins"
        },
        {
            "Cool Time": " 1 hrs"
        },
        {
            "Total Time": " 2 hrs 25 mins"
        },
        {
            "Servings": "12 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "518"
        },
        {
            "Fat": "23g"
        },
        {
            "Carbs": "79g"
        },
        {
            "Protein": "7g"
        }
    ],
    "Images": [],
    "main category": "cakes"
}