{
    "title": "Hot Bean and Bacon Dip with Air Fryer Tortilla Chips",
    "Category": "Nachos",
    "Ingredients": [
        {
            "1": "1 avocado oil cooking spray"
        },
        {
            "2": "0.5 pound bacon"
        },
        {
            "3": "0.5 cup chopped onion"
        },
        {
            "4": "1 (4 ounce) can chopped green chiles (such as Ortega®)"
        },
        {
            "5": "2 cloves garlic, minced"
        },
        {
            "6": "1 (29 ounce) can pinto beans, undrained"
        },
        {
            "7": "0.5 cup chicken broth"
        },
        {
            "8": "1 teaspoon chili powder"
        },
        {
            "9": "2 tablespoons cream cheese"
        },
        {
            "10": "1 salt and ground black pepper to taste"
        },
        {
            "11": "1 cup shredded sharp Cheddar cheese"
        },
        {
            "12": "1 cup shredded pepper Jack cheese"
        },
        {
            "13": "12 (6 inch) corn tortillas"
        }
    ],
    "Directions": [
        {
            "1": "Preheat the oven to 350 degrees F (175 degrees C). Lightly spray an 8x8-inch baking dish."
        },
        {
            "2": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble once cooled."
        },
        {
            "3": "Saute onion in the same skillet until translucent, 4 to 5 minutes. Add green chiles and garlic and cook for 2 more minutes. Add pinto beans; bring to a boil. Stir in chicken broth and chili powder. Reduce heat to low and mash beans. Let simmer until slightly thickened, 5 to 6 minutes. Add cream cheese and stir until melted. Simmer until slightly thickened, 5 to 6 minutes. Add bacon and stir until well combined. Season with salt and pepper."
        },
        {
            "4": "Layer 1/2 of the bean mixture, 1/2 cup pepper Jack, and 1/2 cup Cheddar cheese into the prepared baking dish. Repeat layers."
        },
        {
            "5": "Bake, covered, in the preheated oven for 15 minutes. Uncover and continue baking until cheese is melted or lightly browned, 5 to 7 minutes more."
        },
        {
            "6": "Meanwhile, preheat an air fryer to 350 degrees F (175 degrees C) according to manufacturer's instructions."
        },
        {
            "7": "Cut each tortilla into fourths. Spray both sides of each tortilla with avocado oil. Place in air fryer basket in a single layer. Air fry for 4 to 6 minutes. Flip and continue cooking until crisp, 2 to 3 minutes more. Check your basket constantly because they can burn quickly. Sprinkle with salt and serve with hot dip."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "50 mins"
        },
        {
            "Total Time": " 1 hrs"
        },
        {
            "Servings": "16 "
        },
        {
            "Yield": "16 servings"
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "191"
        },
        {
            "Fat": "9g"
        },
        {
            "Carbs": "18g"
        },
        {
            "Protein": "10g"
        }
    ],
    "Images": [
        {
            "img1": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7634246.jpg&q=60&c=sc&orient=true&w=160&poi=auto&h=90"
        }
    ],
    "main category": "snacks_&_sweets"
}