{
    "title": "Chef John's Chicken Fricassee",
    "Category": "Food Wishes®",
    "Ingredients": [
        {
            "1": "6  bone-in, skin-on chicken thighs"
        },
        {
            "2": "2 teaspoons kosher salt, plus more to taste"
        },
        {
            "3": "1 tablespoon vegetable oil"
        },
        {
            "4": "2 cups thickly sliced fresh mushrooms"
        },
        {
            "5": "1 cup diced yellow onion"
        },
        {
            "6": "0.5 cup sliced shallots (Optional)"
        },
        {
            "7": "2 cloves garlic, minced"
        },
        {
            "8": "0.5 teaspoon freshly ground black pepper"
        },
        {
            "9": "1 pinch cayenne"
        },
        {
            "10": "2 teaspoons all-purpose flour"
        },
        {
            "11": "0.5 cups white wine"
        },
        {
            "12": "6 sprigs thyme"
        },
        {
            "13": "1 cup chicken broth"
        },
        {
            "14": "0.5 cup heavy cream"
        }
    ],
    "Directions": [
        {
            "1": "Season chicken thighs with salt on both sides."
        },
        {
            "2": "Heat vegetable oil in a skillet over medium-high heat and place chicken skin-side-down into the hot oil. Cook until there is a good sear and fat is rendered, about 5 minutes. Flip and cook the other side until seared as well, about 2 minutes. Set aside."
        },
        {
            "3": "Leave 2 tablespoons of the rendered fat in the pan and add sliced mushrooms. Cook until browned, 5 to 8 minutes. Add onion, shallots, and garlic and cook, stirring occasionally, until onions are soft and translucent, about 5 minutes. Season with pepper and cayenne and stir in flour to thicken the mixture, about 1 minute."
        },
        {
            "4": "Pour in white wine and cook, stirring, until alcohol has evaporated. Raise the heat to high and keep cooking until sauce has reduced to half, 3 to 5 minutes."
        },
        {
            "5": "Add chicken broth, thyme, and bay leaf and bring to a boil over high heat. Reduce heat to medium-lo and add chicken and any accumulated juices back into the skillet, skin side up. Cover and simmer gently for 45 minutes, turning over thighs halfway through."
        },
        {
            "6": "Remove lid and turn thighs back to skin side up. Continue to simmer uncovered, basting occasionally, until chicken is tender and sauce reduces even more. If the pan gets dry before the chicken is tender, add some more water or broth."
        },
        {
            "7": "Add cream and simmer until sauce reaches desired thickness. Heat can be raised to medium to reduce cream faster if chicken is already tender. Sauce can be served thin and runny, or reduced to a thick sauce. Sprinkle with fresh thyme and serve."
        }
    ],
    "Details": [
        {
            "Prep Time": "30 mins"
        },
        {
            "Cook Time": " 1 hrs 20 mins"
        },
        {
            "Total Time": " 1 hrs 50 mins"
        },
        {
            "Servings": "6 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "407"
        },
        {
            "Fat": "27g"
        },
        {
            "Carbs": "7g"
        },
        {
            "Protein": "22g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/S-te1yWxANZNlT4mKTnqpWGii08=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Chicken-Fricassee-4x3-1-2000-fe0f0f80b8d948b8a6d45abd921b99af.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}