{
    "title": "Crispy Garlic Crumb Steak",
    "Category": "Food Wishes®",
    "Ingredients": [
        {
            "1": "0.5 cup panko bread crumbs"
        },
        {
            "2": "5 tablespoons olive oil, divided"
        },
        {
            "3": "2 cloves garlic, crushed"
        },
        {
            "4": "1 pound top-sirloin steak, trimmed"
        },
        {
            "5": "1 salt and freshly ground black pepper to taste"
        }
    ],
    "Directions": [
        {
            "1": "Put breadcrumbs in a small bowl."
        },
        {
            "2": "Combine 3 tablespoons olive oil and garlic in a skillet and heat over medium heat until garlic sizzles, 20 to 30 seconds. Strain olive oil into the breadcrumbs and mix to combine to create garlic crumbs. Allow garlic crumbs to cool."
        },
        {
            "3": "Cut the steak into two (8-pounce) portions. Place one of the steaks onto a piece of plastic wrap and fold wrap over to cover meat. Pound with a tenderizer or another heavy object to 1/4 inch thickness. Repeat with the second steak."
        },
        {
            "4": "Season on both sides with salt and pepper."
        },
        {
            "5": "Spoon cooled garlic crumb over the flattened steak to cover the surface up to the edges. Fold over plastic wrap and pound again to drive garlicky breadcrumbs into the steak. Flip steak over and repeat process on the other side."
        },
        {
            "6": "Heat remaining 2 tablespoon olive oil in a skillet over medium-high heat. Once hot, add steak and cook until meat starts to sizzle, 1 to 2 minutes. Reduce heat to medium and cook about 2 minutes per side for medium to medium-rare. An instant-read thermometer inserted into the center should read 130 to140 degrees F (54 to 60 degrees C)."
        }
    ],
    "Details": [
        {
            "Prep Time": "10 mins"
        },
        {
            "Cook Time": "5 mins"
        },
        {
            "Total Time": "15 mins"
        },
        {
            "Servings": "2 "
        }
    ],
    "Nutrition Facts": [
        {
            "Calories": "666"
        },
        {
            "Fat": "45g"
        },
        {
            "Carbs": "20g"
        },
        {
            "Protein": "51g"
        }
    ],
    "Images": [
        {
            "img1": "https://www.allrecipes.com/thmb/YFr0Xkiswt0nXalV7PiC6g5xFr0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Garlic-Crumb-Steak-1x1-1-2000-57db6c7d61854f3e9e01ab38e52b8048.jpg"
        }
    ],
    "main category": "cooking_technique_&_channels"
}